Repository: aleax/openscada
Catalog: src/moduls/bd/PostgreSQL/po/*.po
Languages: de, ru, uk

source: DB PostgreSQL
ru: БД PostgreSQL
uk: БД PostgreSQL

source: Roman Savochenko, Maxim Lysenko (2010-2011)
ru: Роман Савоченко, Максим Лысенко (2010-2011)
uk: Роман Савоченко, Максим Лисенко (2010-2011)

source: DB module. Provides support of the DBMS PostgreSQL.
de: DB-Modul. Bietet Unterstützung für das DBMS PostgreSQL.
ru: Модуль БД. Предоставляет поддержку СУБД PostgreSQL.
uk: Модуль БД. Надає підтримку СУБД PostgreSQL.

source: Fatal error - unable to allocate connection.
de: Fataler Fehler - es ist unmöglich die Verbindung herzustellen
ru: Фатальная ошибка - невозможно установить соединение.
uk: Фатальна помилка - неможливо встановити з'єднання.

source: Error connecting the DB: %s
de: Fehler beim Verbinden der DB: %s
ru: Ошибка подключения БД: %s
uk: Помилка підключення БД: %s

source: Error querying the DB: '%s (%s)'!
de: Fehler beim Abfragen der DB: '%s (%s)'!
ru: Ошибка запроса БД: '%s (%s)'!
uk: Помилка запиту БД: '%s (%s)'!

source: Error opening the table '%s': the DB is disabled.
de: Fehler beim Öffnen der Tabelle '%s': Die DB ist deaktiviert.
ru: Ошибка открытия таблицы '%s': БД отключена.
uk: Помилка відкриття таблиці '%s': БД вимкнено.

source: The table '%s' is not present!
de: Die Tabelle '%s' ist nicht vorhanden!
ru: Таблица '%s' отсутствует!
uk: Таблиця '%s' відсутня!

source: Error starting a transaction!
de: Fehler beim Starten einer Transaktion!
ru: Ошибка запуска транзакции!
uk: Помилка запуску транзакції!

source: Error stopping a transaction!
de: Fehler beim Stoppen einer Transaktion!
ru: Ошибка останова транзакции!
uk: Помилка зупинки транзакції!

source: ERR CON for: %s
de: ERR CON für: %s
ru: ERR CON для: %s
uk: ERR CON для: %s

source: Repeated errors of requesting the DB: '%s (%s)'.
de: Wiederholte Fehler beim Anfordern der DB: '%s (%s)'.
ru: Повторяемые ошибки запроса БД: '%s (%s)'.
uk: Повторювані помилки запиту БД: '%s (%s)'.

source: ERR CON_st for: %s
de: ERR CON_st für: %s
ru: ERR CON_st для: %s
uk: ERR CON_st для: %s

source: Error connecting the DB: '%s (%s)'!
de: Fehler beim Verbinden der DB: '%s (%s)'!
ru: Ошибка подключения БД: '%s (%s)'!
uk: Помилка підключення БД: '%s (%s)'!

source: ERR QUERY (con=%d;res=%d;tr=%d) for: %s
de: ERR QUERY (con=%d;res=%d;tr=%d) für: %s
ru: ERR ЗАПРОС (con=%d;res=%d;tr=%d) для: %s
uk: ERR ЗАПИТ (con=%d;res=%d;tr=%d) для: %s

source: OK (tr=%d) for: %s
de: OK (tr=%d) für: %s
ru: OK (tr=%d) для: %s
uk: OK (tr=%d) для: %s

source: Status
ru: Статус
uk: Статус

source: PostgreSQL DBMS address must be written as: "{host};{hostaddr};{user};{pass};{db}[;{port}[;{connect_timeout}]]". Where: host - hostname on which the DBMS server PostgreSQL works. If this begins with a slash ('/'), it specifies Unix socket rather than TCP/IP communication; the value is the name of the directory in which the socket file is stored; hostaddr - numeric IP address of the host for connecting; user - user name of the DB; pass - password of the user for accessing the DB; db - name of the DB; port - port, which listening by the DBMS server (default 5432); connect_timeout - connection timeout, in seconds; For local DBMS: ";;user;password;OpenSCADA;5432;10". For remote DBMS: "server.nm.org;;user;password;OpenSCADA;5432;10".
de: Die PostgreSQL-DBMS-Adresse muss als geschrieben werden: "{host};{hostaddr};{user};{pass};{db}[;{port}[;{connect_timeout}]]". Wo: host - hostname, auf dem der DBMS Server PostgreSQL arbeitet. Wenn dies mit einem Schrägstrich ('/') beginnt, gibt es den Unix-Socket anstelle der TCP/IP-Kommunikation an; Der Wert ist der Name des Verzeichnisses, in dem die Socket-Datei gespeichert ist. hostaddr - zahlenadresse des Hosts des PostgreSQL-Servers; user - name des Datenbankbenutzers; pass - kennwort des Nutzers für den Zugang zu der DB; db - name der Datenbank; port - port, der vom DBMS-Server überwacht wird (default 3306); connect_timeout - timeout der Verbindung, in Sekunden; Für lokale DBMS: ";;user;password;OpenSCADA;5432;10". Für entfernte DBMS: "server.nm.org;;user;password;OpenSCADA;5432;10".
ru: Адрес БД PostgreSQL записывается в виде: "{host};{hostaddr};{user};{pass};{db}[;{port}[;{connect_timeout}]]". Где: host - имя хоста на котором работает сервер СУБД PostgreSQL. Если начинается со слеша ('/'), то указывается UNIX-сокет вместо TCP; значение это - имя директории, в которой храниться файл сокета; hostaddr - численный адрес хоста PostgreSQL сервера; user - имя пользователя БД; pass - пароль пользователя для доступа к БД; db - имя БД; port - порт, который слушает сервер БД (по умолчанию 5432); connect_timeout - таймаут соединения, в секундах; Для локальной СУБД: ";;user;password;OpenSCADA;5432;10". Для удалённой СУБД: "server.nm.org;;user;password;OpenSCADA;5432;10".
uk: Адреса СУБД PostgreSQL записується таким чином: "{host};{hostaddr};{user};{pass};{db}[;{port}[;{connect_timeout}]]". Де: host - ім'я хосту на якому працює сервер СУБД PostgreSQL. Якщо починається зі слеша ('/'), то використовується UNIX-сокет замість TCP; значення це - ім'я каталогу де зберігається файл сокету; hostaddr - чисельна адреса хосту PostgreSQL сервера; user - ім'я користувача БД; pass - пароль користувача для доступу до БД; db - ім'я БД; port - порт, який слухає сервер СУБД (по замовченню 5432); connect_timeout - час очікування з'єднання, у секундах; Для локальної СУБД: ";;user;password;OpenSCADA;5432;10". Для віддаленої СУБД: "server.nm.org;;user;password;OpenSCADA;5432;10".

source: Enabled.
de: Aktiviert.
ru: Включено.
uk: Ввімкнено.

source: Disabled.
de: Behindert.
ru: Выключено.
uk: Вимкнено.

source: Connected: %s.
de: Verbunden: %s.
ru: Подключен: %s.
uk: Підключений: %s.

source: Requests: %g; Request time: %s[%s,%s,%s]; Max time request: '%s'
de: Anfragen: %g; Anfragezeit: %s[%s,%s,%s]; Max Zeitanforderung: '%s'
ru: Запросов: %g; Время запроса: %s[%s,%s,%s]; Запрос макс. времени: '%s'
uk: Запитів: %g; Час запиту: %s[%s,%s,%s]; Запит макс. часу: '%s'

source: Table is empty!
de: Tabelle ist leer!
ru: Таблица пуста!
uk: Таблиця порожня!

source: The row "%s" is not present. Are you saved the object?
de: Die Zeile "%s" ist nicht vorhanden. Sind Sie das Objekt gespeichert?
ru: Запись "%s" отсутствует. Вы сохраняли этот объект?
uk: Запис "%s" відсутній. Ви зберігали цей об'єкт?
