Repository: aleax/openscada
Catalog: src/moduls/daq/MMS/po/*.po
Languages: de, ru

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко

source: MMS(IEC-9506) client implementation.
de: MMS(IEC-9506) Client-Implementierung
ru: Реализация клиента MMS(IEC-9506)

source: Parameteres table
ru: Таблица параметров

source: Acquisition schedule
de: Planung der Befragung
ru: Планирование опроса

source: Gather task priority
de: Niveau der Priorität der Datenempfangaufgabe
ru: Уровень приоритета задачи сбора данных

source: Restore timeout (s)
de: Zeitüberschreitung bei der Wiederherstellung (s)
ru: Интервал восстановления (с)

source: Sync inter remote station period (s)
de: Periode der Sznchronisierung mit der entfernten Station (sek)
ru: Период синхронизации с удалённой станцией (сек)

source: Server address
de: Server-Adresse
ru: Адрес сервера

source: Variables into read request
de: Variablen in Leseanforderung
ru: Переменных в запросе чтения

source: Destination TSAP
ru: TSAP назначения

source: Standard
ru: Стандарт

source: Variables list (next line separated)
de: Variablen-Liste (nächste Zeile getrennt)
ru: Перечень переменных (разделение след. строкой)

source: No activity data.
de: Keine Aktivitätsdaten.
ru: Нет активности данных.

source: Connection error. Restoring in %.6g s.
de: Anschaltungsfehler. Wiederherstellung in %.6g s.
ru: Ошибка подключения. Восстановление через %.6g с.

source: Call now.
de: Rufen Sie jetzt an.
ru: Вызов сейчас.

source: Call by period: %s.
de: Aufruf mit einer Periode: %s.
ru: Вызовы с периодом: %s.

source: Call next by cron '%s'.
de: Call nächsten durch cron '%s'.
ru: Следующий вызов по cron '%s'.

source: Spent time: %s. Requests %.6g.
de: Verbrauchte Zeit: %s. Anfragen %.6g.
ru: Затрачено времени: %s. Запросов %.6g.

source: Remote host error
de: Remote-Host-Fehler
ru: Ошибка удалёного хоста

source: MMS automatic created transport for '%s' controller.
de: MMS erstellt automatische Transport für '%s' Controller.
ru: Автоматически созданный MMS транспорт для контроллера '%s'.

source: DAQ.%s.%s: connect to data source: %s.
de: DAQ.%s.%s: Verbindung zu Datenquelle: %s.
ru: DAQ.%s.%s: подключение к источнику данных: %s.

source: STOP
ru: ОСТАНОВЛЕН

source: OK
ru: НОРМА

source: Value '%s' type '%s' read is not implemented.
de: Wert '%s' Typ '%s' lesen nicht implementiert ist.
ru: Чтение значения '%s' типа '%s' не реализовано.

source: No data
de: Keine Daten
ru: Нет данных

source: Zero for disable periodic sync.
de: Zero deaktivieren periodische Synchronisation.
ru: Ноль для отключения периодической синхронизации.

source: Value type '%s' is not implemented for '%s'.
de: Werttyp '%s' ist nicht für '%s' implementiert.
ru: Значения типа '%s' не реализовано для '%s'.

source: Attributes configuration list. List must be written by lines in format: "{MMS_domain}/{MMS_var}[:{opt}[:{tp}[:{id}[:{name}]]]]". Where: {MMS_domain} - MMS domain or '*' for global. {MMS_var} - MMS variable name into domain or global. {opt} - Options: w - writable; s - single request; /{NN} - call at cycle even to number {N} [2...99]. {tp} - force type: bool - boolean; real - real; int - integer; string - string; struct - structure; array - array; {id} - force attribute ID. {name} - force attribute name.
de: Attribute Konfigurationsliste. Liste muss von Linien im Format geschrieben werden: "{MMS_domain}/{MMS_var}[:{opt}[:{tp}[:{id}[:{name}]]]]". Wo: {MMS_domain} - MMS-Domäne oder '*' für globale. {MMS_var} - MMS Variablenname in Domäne oder global. {opt} - Optionen: w - beschreibbar; s - einzelne Anfrage; /{NN} - rufen bei Zyklus sogar Nummer {N} [2...99]. {tp} - Kraft-Typ: bool - boolean; real - real; int - ganze Zahl; string - Leine; struct - Struktur; array - Feld; {id} - Kraft-Attribut ID. {name} - Kraft Attributnamen.
ru: Список конфигурации атрибутов. Список должен записываться строками формата: "{MMS_domain}/{MMS_var}[:{opt}[:{tp}[:{id}[:{name}]]]]". Где: {MMS_domain} - MMS домен или '*' для глобального. {MMS_var} - MMS имя переменной в домене или глобально. {opt} - Опции: w - доступен для записи; s - одиночный запрос; /{NN} - вызов в цикле кратно номеру {N} [2...99]. {tp} - прямо указанный тип: bool - логический; real - реальный; int - целый; string - строка; struct - структура; array - масив; {id} - прямо указанный идентификатор. {name} - прямо указанное имя.

source: Variable append
de: Variable anhängen
ru: Добавление переменной

source: 1:Parameter is disabled.
de: 1:Parameter ist abgeschaltet.
ru: 1:Параметр отключен.

source: 2:Acquisition is stopped.
de: 2:Anfrage ist angehalten.
ru: 2:Опрос остановлен.

source: Write to '%s' error: %s.
de: Schreiben Sie '%s' Fehler: %s.
ru: Ошибка записи в '%s': %s.

source: Parameters table
de: Parametertabelle
