Repository: aleax/openscada
Catalog: src/moduls/daq/BFN/po/*.po
Languages: de

source: Roman Savochenko
de: Roman Savotschenko

source: Support Big Farm Net (BFN) modules for Viper CT/BAS and other from "Big Dutchman" (http://www.bigdutchman.com).
de: Big Farm Net (BFN) Module für Viper CT/BAS und andere aus "Big Dutchman " (http://www.bigdutchman.com).

source: Acquisition schedule
de: Planung der Befragung

source: Priority of the acquisition task
de: Priorität der Erfassungsaufgabe

source: Period of sync with the remote station, seconds
de: Periode der Synchronisieren mit der entfernten Station, Sekunden

source: Transport address
de: Adresse des Transports

source: User
de: Nutzer

source: Password
de: Passwort

source: Symbols
de: Symbole

source: Symbols DB
de: Symbole DB

source: Identifier
de: Identifikator

source: Alarms
de: Alarme

source: New symbol for code
de: Neues Symbol für die Code

source: New symbol for alarm
de: Neues Symbol für Alarm

source: Error: '%s'.
de: Fehler: '%s'.

source: Acquisition.
de: Erwerb.

source: Acquisition with the period: %s.
de: Erwerb mit dem Zeitraum: %s.

source: Next acquisition by the cron '%s'.
de: Nächste Übernahme durch den Cron '%s'.

source: Spent time: %s.
de: Verbrauchte Zeit: %s.

source: House:
de: Haus:

source: House computer:
de: Haus-Computer:

source: DAQ.%s.%s: connect to the data source: %s.
de: DAQ.%s.%s: Anschluss an die Datenquelle: %s.

source: Error connecting to the transport '%s'.
de: Verbinden Sie den Transport '%s' Fehler.

source: Error parsing the respond. The respond seems incomplete.
de: Reagieren Parsing-Fehler. Mögliche reagieren unvollständig.

source: Unknown alarm '%s'.
de: Unbekannte Alarm '%s'.

source: Main
de: Generell

source: Alarm:
de: Alarme:

source: Norma:
de: Norm:

source: 1:Parameter disabled.
de: 1:Parameter abgeschaltet.

source: 2:Acquisition stopped.
de: 2:Befragung ist gestoppt.
