Repository: aleax/openscada
Catalog: src/moduls/ui/Vision/po/*.po
Languages: de, ru, uk

source: The button for the active window closing
de: Schaltfläche zum Schließen des aktiven Fensters
ru: Кнопка для закрытия активного окна

source: Press to close active window.
de: Betätigen zum Schließen des aktiven Fensters.
ru: Нажать для закрытия активного окна.

source: The button for all windows closing
de: Schaltfläche zum Schließen aller Fenster
ru: Кнопка для закрытия всех окон

source: Press to close all windows.
de: Betätigen zum Schließen aller Fenster.
ru: Нажать для закрытия всех окон.

source: The button for all windows tiling
de: Schaltfläche zum Aufschichten aller Fenster
ru: Кнопка для укладывания всех окон

source: Press to tile all windows.
de: Betätigen zum Aufschichten aller Fenster.
ru: Нажать для укладывания всех окон.

source: The button for all windows cascading
de: Schaltfläche zum Staffeln aller Fenster
ru: Кнопка для каскадирования всех окон

source: Press to cascade all windows.
de: Betätigen zum Staffeln aller Fenster.
ru: Нажать для каскадирования всех окон.

source: Activate next window
de: Nächstes Fenster aktivieren
ru: Активация следующего окна

source: The button for next window activation
de: Schaltfläche zum Aktivieren des nächsten Fensters
ru: Кнопка для активации следующего окна

source: Press to activate next window.
de: Betätigen zum Aktivieren des nächsten Fensters.
ru: Нажать для активации следующего окна.

source: Activate previous window
de: Vorheriges Fenster aktivieren
ru: Активация предыдущего окна

source: The button for previous window activation
de: Schaltfläche zum Aktivieren des vorherigen Fensters
ru: Кнопка для активации предыдущего окна

source: Press to activate previous window.
de: Betätigen zum Aktivieren des vorherigen Fensters.
ru: Нажать для активации предыдущего окна.

source: Widgets view functions
de: Widgetsansichtfunktionen
ru: Функции видимости виджетов

source: Elementars figure tools
de: Werkzeuge der elementaren Figuren
ru: Панель элементарных фигур

source: This label displays current user.
de: Dieses Feld zeigt den aktuellen Benutzer.
ru: Эта метка показывает текущего пользователя.

source: Field for display the current user.
de: Feld für Anzeige des aktuellen Benutzers.
ru: Поле для отображения текущего пользователя.

source: Double click to change user.
de: Zweimal klicken um den Benutzers zu wechseln.
ru: Дважды кликнуть для смены пользователя.

source: This label displays the using VCA engine station.
de: Dieses Feld zeigt die Station der VCA Maschine.
ru: Эта метка показывает используемую станцию движка СВУ.

source: Field for display of the using VCA engine station.
de: Feld für Anzeige der Station der VCA Maschine.
ru: Поле для отображения используемой станции движка СВУ.

source: This label displays widgets' scaling mode.
de: Dieses Zeichen zeigt Maßstab des Widgets.
ru: Эта метка показывает текущий режим масштабирования.

source: Field for display widgets' scaling mode.
de: Feld für Anzeige des Maßstab des Widgets .
ru: Поле для отображения текущего режима масштабирования.

source: Click to change widgets' scaling mode.
de: Betätigen um Maßstab des Widgets zu ändern.
ru: Нажать для смены режима масштабирования виджетов.

source: This label displays modifying.
de: Dieses Feld zeigt die Änderung.
ru: Эта метка показывает факт изменения.

source: Field for display modifying.
de: Feld für Anzeige der Änderungen.
ru: Поле для отображения факта изменения.

source: Click to save all modifyings.
de: Klicken, um alle Änderungen speichern.
ru: Нажать для сохранения всех изменений.

source: This label displays current widget's scale.
de: Dieses Zeichen zeigt den Bereich des aktuellen Widgets an.
ru: Эта метка показывает текущий режим масштабирования.

source: Field for display the scale of the current widget.
de: Feld für Anzeige des Bereichs des aktuellen Widgets.
ru: Поле для отображения текущего пользователя.

source: Dock window for projects management.
de: Fenster für Steuerung von Projekten.
ru: Плавающее окно для управления проектами.

source: Dock window for widgets and their libraries management.
de: Fenster für Steuerung von Widgets und Bibliotheken.
ru: Плавающее окно для управления виджетами и их библиотеками.

source: Dock window for widget's attributes inspection.
de: Fenster für Untersuchung der Widgetsattribute.
ru: Плавающее окно для инспектора атрибутов виджета.

source: Dock window for widget's links inspection.
de: Fenster für Untersuchung der Widgetslinks.
ru: Плавающее окно для инспектора ссылок виджета.

source: Visual items save
de: Speicherung der Elemente
ru: Сохранение визуальных элементов

source: Some visual items changed. Save the changes to DB on exit?
de: Einige visuelle Elemente verändert. Speichern Sie die Änderungen DB an der Ausfahrt?
ru: Некоторые визуальные элементы были изменены. Сохранить изменения в БД при выходе?

source: %1 v%2. %3 Author: %4 Developers: %5 License: %6 %7 v%8. %9 License: %10 Author: %11 Web site: %12
de: %1 v%2. %3 Autor: %4 Entwickler: %5 Lizenz: %6 %7 v%8. %9 Lizenz: %10 Autor: %11 Web Seite: %12
ru: %1 v%2. %3 Автор: %4 Разработчики: %5 Лицензия: %6 %7 v%8. %9 Лицензия: %10 Автор: %11 Web сайт: %12

source: Are you sure of loading visual items '%1' from DB?
de: Wollen Sie wirklich die Elemente '%1' aus der Datenbank laden?
ru: Вы действительно желаете загрузить визуальные элементы '%1' из БД?

source: Load visual item's data from DB
de: Element aus der Datenbank laden
ru: Загрузка данных визуального элемента из БД

source: Are you sure of saving all modifications to DB?
de: Sind Sie sicher, alle zu retten Änderungen der DB?
ru: Вы действительно желаете сохранить все изменения в БД?

source: Are you sure of saving visual items '%1' to DB?
de: Wollen Sie wirklich die Elemente '%1' in die Datenbank speichern?
ru: Вы действительно желаете сохранить визуальные элементы '%1' в БД?

source: Save visual item's data to DB
de: Speichern des Elements in die Datenbank
ru: Сохранение данных визуального элемента в БД

source: Enter new project's identifier and name.
de: Bezeichnung und Namen des neuen Projekts eingeben.
ru: Введите идентификатор и имя нового проекта.

source: Enter new widget's library identifier and name.
de: Bezeichnung und Namen des neuen Widgetsbibliothek eingeben.
ru: Введите идентификатор и имя новой библиотеки виджетов.

source: New widget's library
de: Neue Widgetsbibliothek
ru: Новая библиотека виджетов

source: Enter new widget's/page's identifier and name.
de: Bezeichnung und Namen des neuen Widgets/der neuen Seite eingeben.
ru: Введите идентификатор и имя нового виджета/страницы.

source: Create widget/page
de: Widget/Seite erstellen
ru: Создать виджет/страницу

source: Are you sure of deleting visual items: '%1'?
de: Wollen Sie wirklich die Elemente '%1' löschen?
ru: Вы действительно желаете удалить визуальные элементы '%1'?

source: Delete visual items
de: Löschen der Elemente
ru: Удаление визуальных элементов

source: Widget: %1
ru: Виджет: %1

source: Widget's '%1' editing window is already opened.
de: Fenster für die Widgetbearbeitung '%1' ist schon geöffnet.
ru: Окно редактирования виджета '%1' уже открыто.

source: Are you sure of clear all changes for visual items: '%1'? All changes will be lost and variables are returning to default values or will be inherited!
de: Wollen Sie wirklich alle Änderungen Elements: '%1' zurücksetzen? Alle Änderungen gehen verloren und die Variablen erhalten Standardwerte oder vererbte Werte!
ru: Вы действительно желаете очистить все изменения визуальных элементов: '%1'? Все изменения будут утеряны и переменные вернутся к значениям по умолчанию или по наследованию!

source: Visual items' changes clear
de: Zurücksetzen der Änderungen
ru: Очистка изменений визуальных элементов

source: Visual items move or copy
de: Kopieren oder Verschieben der Elementen
ru: Копирование или перемещение визуальных элементов

source: Project '%1' move.
de: Verschieben von Projekt '%1'.
ru: Перемещение проекта '%1'.

source: Project '%1' copy.
de: Kopieren von Projekt '%1'.
ru: Копирование проекта '%1'.

source: Widget's library '%1' move.
de: Verschieben der Widgetsbibliothek '%1'.
ru: Перемещение библиотеки виджетов '%1'.

source: Widget's library '%1' copy.
de: Kopieren der Widgetsbibliohek '%1'.
ru: Копирование библиотеки виджетов '%1'.

source: Move page '%1' to '%2'.
de: Verschieben der Seite '%1' nach '%2'.
ru: Перемещение страницы '%1' в '%2'.

source: Copy page '%1' to '%2'.
de: Kopieren der Seite '%1' nach '%2'.
ru: Копирование страницы '%1' в '%2'.

source: Move widget '%1' to '%2'.
de: Verschieben des Widgets '%1' nach '%2'.
ru: Перемещение виджета '%1' в '%2'.

source: Copy widget '%1' to '%2'.
de: Kopieren des Widgets '%1' nach '%2'.
ru: Копирование виджета '%1' в '%2'.

source: Enter new widget's identifier and name.
de: Bezeichnung und Namen des neuen Widgets eingeben.
ru: Введите идентификатор и имя нового виджета.

source: Try copy/move self to self for "%1/%1"!
de: Versuchen Sie kopieren / verschieben Selbstselbst für "%1/%1"!
ru: Попытка копирования/перемещения себя в себя для "%1/%1"!

source: Widget's library properties
de: Eigenschaften der Widgetsbibliothek
ru: Свойства библиотеки виджетов

source: Item's icon. Click for download other.
de: Item-Symbol.Klicken Sie zum Download von anderen.
ru: Иконка элемента. Нажмите для загрузки другой.

source: Date of modification:
de: Änderungsdatum:
ru: Дата модификации:

source: Calculate period (ms):
de: Rechenzeit (ms):
ru: Период вычисления (мс):

source: Run window mode:
de: Ausführungsfenster Modus:
ru: Режим окна исполнения:

source: Keep aspect ratio on scale:
de: Seitenverhältnis beibehalten auf der Skala
ru: Сохранять пропорцию при масштабировании

source: Mime data
de: Mime Angaben
ru: Mime данные

source: Mime type
de: Mime Typ
ru: Mime тип

source: Close
de: Schliessen
ru: Закрыть

source: Get node '%1' information error.
de: Fehler bei der Knoteninformation '%1'.
ru: Ошибка запроса информации узла '%1'.

source: No set
de: Kein Satz
ru: Не установлен

source: Load icon picture
de: Iconbild laden
ru: Загрузить изображение иконки

source: Load icon image '%1' error.
de: Fehler beim Laden des Iconbildes '%1'.
ru: Ошибка загрузки изображения иконки '%1'.

source: Changes apply
de: Änderungen gelten
ru: Принятие изменений

source: Some changes you don't apply! Apply now or lost the?
de: Einige Änderungen nicht gelten! Bewerben Sie sich jetzt oder verloren das?
ru: Некоторые изменения не приняты! Принять сейчас или потерять?

source: No one row is selected.
de: Keine Zeile ist ausgewählt.
ru: Ни одной строки не выбрано.

source: Open file '%1' is fail: %2
de: Fehler beim Öffnen der Datei '%1': %2
ru: Ошибка открытия файла '%1': %2

source: Loadable file '%1' is too large.
de: Ladbarer Datei '%1' ist zu groß.
ru: Загружаемый файл '%1' очень большой.

source: Save data
de: Daten speichern
ru: Сохранить данные

source: Write data to file '%1' is fail: %2
de: Fehler beim Schreiben der Daten in die Datei '%1': %2
ru: Ошибка записи данных в файл '%1': %2

source: Widget properties
de: Widgets Eigenschaften
ru: Свойства виджета

source: Proc.
de: Bearbeit.
ru: Обраб.

source: Procedure calculate (ms):
de: Rechenzeit der Funktion (ms):
ru: Вычисления процедуры (мс):

source: Getting node '%1' information error.
de: Fehler bei der Knoteninformation '%1'.
ru: Ошибка запроса информации узла '%1'.

source: Valid widget is not selected
de: Kein gültiges Widget ist ausgewählt
ru: Не выбрано корректного виджета

source: Valid attribute is not selected
de: Kein gültiges Attribut ist ausgewählt
ru: Не выбрано корректного атрибута

source: Press to clear attribute's changes.
de: Betätigen zum Zurücksetzen Änderungen des Attributs.
ru: Нажать для очистки изменений атрибута.

source: Full text of the attribute edit.
de: Full-Text-Bearbeitung Attribut.
ru: Полнотекстовое редактирование атрибута.

source: Attribute '%1' edit for widget '%2'.
de: Attribut '%1' für die eigene WebSite '%2' zu editieren.
ru: Редактирование атрибута '%1' для виджета '%2'.

source: Short help for text syntax description.
de: Kurze Hilfe für die Syntax des Textes.
ru: Короткая помощь для описания синтаксиса текста.

source: Widgets' development tree '%s' request time %f ms.
de: Widget Entwicklung Baum '%s' Anfrage Zeitpunkt %f ms.
ru: Время запроса дерева разработки виджетов '%s': %f мс.

source: Add widget based at '%1'
de: Hinzufügen des Widgets basierend auf '%1'
ru: Добавление виджета основанного от '%1'

source: The button for addition widget based at '%1'
de: Schaltfläche zum Hinzufügen des Widgets basierend auf '%1'
ru: Кнопка для добавления виджета основанного от '%1'

source: Press to add widget based at '%1'.
de: Betätigen um das Widgets basierend auf '%1' hinzuzufügen
ru: Нажать для добавления виджета основанного от '%1'

source: Container's widget
de: Widgetscontainer
ru: Виджет контейнера

source: Widgets' development tree '%s' load time %f ms.
de: Widget Entwicklung Baum '%s' Ladezeit %f ms.
ru: Время загрузки дерева разработки виджетов '%s': %f мс.

source: Press to refresh present libraries.
de: Betätigen um die vorhandenen Bibliotheken zu aktualisiern.
ru: Нажать для обновления доступных библиотек.

source: Project's development tree '%s' load time %f ms.
de: Projektentwicklung Baum '%s' Ladezeit %f ms.
ru: Время загрузки дерева разработки проектов '%s': %f мс.

source: Press to refresh present projects.
de: Betätigen um die vorhandenen Projekte zu aktualisieren.
ru: Нажать для обновления доступных проектов.

source: Warning! Edit widget already set.
de: Achtung! Edit Widget bereits eingestellt.
ru: Внимание! Виджет уже установлен в редактирование.

source: Exit from widget editing
de: Beenden der Widgetbearbeitung
ru: Выход из редактирования виджета

source: Press to exit from widget editing.
de: Betätigen zum Beenden der Widgetbearbeitung.
ru: Нажать для выхода из редактирования виджета.

source: Enter for the widget editing
de: Starten der Widgetbearbeitung
ru: Вход в редактирование виджета

source: Press to enter for the widget editing.
de: Betätigen zum Starten der Widgetbearbeitung.
ru: Нажать для входа в редактирование виджета.

source: Make icon from the widget
de: Das Icon aus dem Widget erstellen
ru: Создать иконку из виджета

source: Press to make icon from the widget.
de: Betätigen zum Erstellen des Icons aus dem Widget.
ru: Нажать для создания иконки из виджета.

source: Make image from the widget
de: Das Bild aus dem Widget erstellen
ru: Создать изображение из виджета

source: Press to make image from the widget.
de: Betätigen zum Erstellen des Bildes aus dem Widget.
ru: Нажать для создания изображения из виджета.

source: Reset zoom (100%)
de: Reset Maßstab (100%)
ru: Сбросить масштаб (100%)

source: Press to set the visual scale of the widget to 100%.
de: Betätigen um Maßstab auf 100% einzustellen.
ru: Нажмите для того, чтобы установить визуальный масштаб в 100%.

source: Save widget's image
de: Speicherung des Widgetbildes
ru: Сохранение изображения виджета

source: Save to file '%1' is error.
de: Fehler beim Speichern in die Datei '%1'.
ru: Ошибка сохранения в файл '%1'.

source: Widget is not enabled or shape is not supported!
de: Widget ist nicht eingeschaltet oder Widgetform wird nicht unterstützt!
ru: Виджет отключен или образ виджета не поддерживается!

source: Vision runtime
de: Vision-Ausführungszeit
ru: Vision-исполнение

source: The button for printing of the master page by default
de: Schaltfläche zum Drucken der Hauptseite standard
ru: Кнопка для печати главной страницы по умолчанию

source: Press for printing of the master page by default.
de: Betätigen zum Drucken der Hauptseite standard.
ru: Нажать для печати главной страницы по умолчанию.

source: The button for printing of the selected page
de: Schaltfläche zum Drucken der ausgewählten Seite
ru: Кнопка для печати выбранной страницы

source: Press for printing of the selected page.
de: Betätigen zum Drucken der ausgewählten Seite.
ru: Нажать для печати выбранной страницы.

source: The button for printing of the selected diagram
de: Schaltfläche zum Drucken des ausgewählten Diagramms
ru: Кнопка для печати выбранной диаграммы

source: Press for printing of the selected diagram.
de: Betätigen zum Drucken des ausgewählten Diagramms.
ru: Нажать для печати выбранной диаграммы.

source: The button for printing of the selected document
de: Schaltfläche zum Drucken des ausgewählten Dokuments
ru: Кнопка для печати выбранного документа

source: Press for printing of the selected document.
de: Betätigen zum Drucken des ausgewählten Dokuments.
ru: Нажать для печати выбранного документа.

source: The button for exporting of the master page by default
de: Schaltfläche für den Export der Hauptseite, standard
ru: Кнопка для экспорта главной страницы, по умолчанию

source: Press for exporting of the master page by default.
de: Betätigen für den Export der Hauptseite, standard.
ru: Нажать для экспорта главной страницы, по умолчанию.

source: The button for exporting of the selected page
de: Schaltfläche für den Export der ausgewählten Seite
ru: Кнопка для экспорта выбранной страницы

source: Press for exporting of the selected page.
de: Betätigen für den Export der ausgewählten Seite.
ru: Нажать для экспорта выбранной страницы.

source: The button for exporting of the selected diagram
de: Schaltfläche für den Export des ausgewählten Diagrammes
ru: Кнопка для экспорта выбранной диаграммы

source: Press for exporting of the selected diagram.
de: Betätigen für den Export des ausgewählten Diagrammes.
ru: Нажать для экспорта выбранной диаграммы.

source: The button for exporting of the selected document
de: Schaltfläche für den Export des ausgewählten Dokuments
ru: Кнопка для экспорта выбранного документа

source: Press for exporting of the selected document.
de: Betätigen für den Export des ausgewählten Dokuments.
ru: Нажать для экспорта выбранного документа.

source: The button for closing Vision runtime window
de: Schaltfläche zum Schliessen des Ausführungsfenster Vision
ru: Кнопка для закрытия окна исполнения Vision

source: Press for display the program and OpenSCADA information.
de: Betätigen für Informationen über das Programm und OpenSCADA.
ru: Нажать для получения информации о программе и OpenSCADA.

source: The button for all alarms quittance
de: Schaltfläche für die Quittierung aller Störungen
ru: Кнопка для квитации всех нарушений

source: Press for all alarms quittance.
de: Betätigen für die Quittierung aller Störungen.
ru: Нажать для квитации всех нарушений.

source: Blink alarm
de: Blinzalarme
ru: Квитация мигания

source: The button for all blink alarms quittance
de: Schaltfläche für Quittierung alle Alarme blinken
ru: Кнопка для квитации всех нарушений миганием

source: Press for all blink alarms quittance.
de: Betätigen für die Quittierung alle Alarme blinken.
ru: Нажать для квитации всех нарушений миганием.

source: Speaker alarm
de: Lautsprecheralarm
ru: Квитация гудка

source: PC speaker alarm
de: PC Lautsprecheralarm
ru: Квитация гудка

source: The button for all PC speaker alarms quittance
de: Schaltfläche für die Quittierung aller Lautsprecheralarme
ru: Кнопка для квитации всех нарушений гудком

source: Press for all PC speaker alarms quittance.
de: Betätigen für die Quittierung aller Lautsprecheralarme.
ru: Нажать для квитации всех нарушений гудком.

source: Sound/speech alarm
de: Signal/Redealarm
ru: Квитация звука/речи

source: Sound or speech alarm
de: Signal- oder Redealarm
ru: Квитация звука/речи

source: The button for all sound or speech alarms quittance
de: Schaltfläche für die Quittierung aller akustischen Alarme
ru: Кнопка для квитации всех нарушений звуком или речью

source: Press for all sound or speech alarms quittance.
de: Betätigen für Quittierung aller akustischen Alarme.
ru: Нажать для квитации всех нарушений звуком или речью.

source: Alarms (status)
de: Störung (Status)
ru: Нарушение (статус)

source: This label displays current system's time.
de: Dieses Zeichen zeigt die aktuelle Systemzeit.
ru: Эта метка показывает текущего системное время.

source: Field for display of the current user.
de: Feld für Anzeige des aktuellen Beutzers.
ru: Поле для отображения текущего пользователя.

source: This label displays used VCA engine station.
de: Dieses Zeichen zeigt die Station der VCA Maschine.
ru: Эта метка показывает используемую станцию движка СВУ.

source: Field for display of the used VCA engine station.
de: Feld für Anzeige der Station der VCA Maschine.
ru: Поле для отображения используемой станции движка СВУ.

source: This label displays used interface style.
de: Dieses Zeichen zeigt verwendete Schnittstelle Stil.
ru: Эта метка показывает используемый стиль интерфейса.

source: Field for display the used interface style.
de: Feld für Anzeige verwendete Schnittstelle Stil.
ru: Поле для отображения используемого стиля интерфейса.

source: Double click for style change.
de: Zweimal klicken für Stil zu ändern.
ru: Дважды кликнуть для смены стиля.

source: Connection to visualization server '%1' error: %2
de: Der Anschluss an Visualisierungs-Server '%1' Fehler: %2
ru: Ошибка подключения к серверу визуализации '%1': %2

source: Root page scale [%f:%f].
ru: Масштаб корневой страницы [%f:%f].

source: Print page
de: Seite drucken
ru: Печать страницы

source: No one page for print is present!
de: Keine Seite zum Drucken ist vorhanden!
ru: Нет ни одной страницы для печати!

source: Select page for print.
de: Seite zum Drucken auswählen.
ru: Выбор страницы для печати.

source: Page print.
de: Seite drucken.
ru: Печать страницы.

source: Print page: "%1" (%2)
de: Drucken von Seiten "%1" (%2)
ru: Печать страницы "%1" (%2)

source: Print diagram
de: Diagramm drucken
ru: Печать диаграммы

source: No one page is present!
de: Keine Seite ist vorhanden.
ru: Нет ни одной страницы.

source: No one diagram is present!
de: Kein Diagramm ist vorhanden!
ru: Нет ни одной диаграммы!

source: Select diagram for print.
de: Diagramm zum Drucken auswählen.
ru: Выбор диаграммы для печати.

source: Diagram print.
de: Diagramm drucken.
ru: Печать диаграммы.

source: Print diagram: "%1" (%2)
de: Diagramme drucken: "%1" (%2)
ru: Печать диаграммы: "%1" (%2)

source: Print document
de: Dokument drucken
ru: Печать документа

source: No one document is present!
de: Kein Dokument ist vorhanden!
ru: Нет ни одного документа для печати!

source: Select document for print.
de: Dokument zum Drucken auswählen.
ru: Выбор документа для печати.

source: Document print.
de: Dokument drucken.
ru: Печать документа.

source: Print document: "%1" (%2)
de: Dokument drucken: "%1" (%2)
ru: Печать документа: "%1" (%2)

source: Export page
de: Export der Seite
ru: Экспорт страницы

source: No one page for export is present!
de: Keine Seite für den Export ist vorhanden!
ru: Нет ни одной страницы для экспорта!

source: Select page for export.
de: Seite für den Export auswählen.
ru: Выбор страницы для экспорта.

source: Page export.
de: Export der Seite.
ru: Экспорт страницы.

source: Save page's image
de: Speicherung des Bildes der Seite
ru: Сохранение изображения страницы

source: Export diagram
de: Export-Chart
ru: Экспорт диаграммы

source: Select diagram for export.
de: Chart für den Export auswählen.
ru: Выбор диаграммы для экспорта.

source: Diagram export.
de: Export-Chart.
ru: Экспорт диаграммы.

source: Save diagram
de: Chart speichern
ru: Сохранить диаграмму

source: Error write to: %1.
de: Fehler schreiben Sie an: %1.
ru: Ошибка записи в: %1.

source: Export document
de: Export des Dokuments
ru: Экспорт документа

source: Select document for export.
de: Dokument für den Export auswählen.
ru: Выбор документа для экспорта.

source: Document export.
de: Export des Dokumentes.
ru: Экспорт документа.

source: Save document
de: Speicherung des Dokumentes
ru: Сохранение документа

source: No data for export.
de: Keine Daten für Export.
ru: Нет данных для экспорта.
