Repository: aleax/openscada
Catalog: src/moduls/ui/Vision/po/*.po
Languages: de, ru, uk

source: The button for exporting the master page, by default
uk: Кнопка експорту головної сторінки, по замовченню.

source: Press for exporting the master page, by default.
uk: Натиснути для експорту головної сторінки, по замовченню.

source: Export the selected page
de: Export der ausgewählten Seite
ru: Экспорт выбранной страницы
uk: Експорт обраної сторінки

source: The button for exporting the selected page
uk: Кнопка експорту обраної сторінки

source: Press for exporting the selected page.
uk: Натиснути для експорту обраної сторінки.

source: Export the selected diagram
de: Export des ausgewählten Diagrammes
ru: Экспорт выбранной диаграммы
uk: Експорт обраної діаграми

source: The button for exporting the selected diagram
uk: Кнопка експорту обраної діаграми

source: Press for exporting the selected diagram.
uk: Натиснути для експорту обраної діаграми.

source: Export the selected document
de: Export des ausgewählten Dokuments
ru: Экспорт выбранного документа
uk: Експорт обраного документу

source: The button for exporting the selected document
uk: Кнопка експорту обраного документу

source: Press for exporting the selected document.
uk: Натиснути для експорту обраного документу.

source: Table
uk: Таблиця

source: Export the selected table
uk: Експорт обраної таблиці

source: The button for exporting the selected table
uk: Кнопка експорту обраної таблиці

source: Press for exporting the selected table.
uk: Натиснути для експорту обраної таблиці.

source: Project '%1' manual
uk: Підручник проєкту '%1'

source: The button for getting the using project '%1' manual
uk: Кнопка отримання підручника проєкту '%1'

source: Press for getting the using project '%1' manual.
uk: Натиснути для отримання підручника проєкту '%1'.

source: The button for requesting the information about GUI elements
uk: Кнопка запиту інформації про GUI елементи

source: Requesting the information about GUI elements
uk: Запит інформації про GUI елементи

source: Press for requesting the information about GUI elements.
uk: Натиснути для запиту інформації про GUI елементи.

source: Alarm level
de: Störungsstufe
ru: Уровень нарушения
uk: Рівень порушення

source: The button for quietance all alarms
uk: Кнопка квітації всіх порушень

source: Press for quietance all alarms.
uk: Натиснути для квітації всіх порушень.

source: General (status)
uk: Загальний (статус)

source: This label shows the current system time.
uk: Це маркування показує поточний системний час.

source: This label displays the used interface style.
uk: Це маркування показує використаний стиль інтерфейсу.

source: Field for displaying the used interface style.
uk: Поле відображення використаного стилю інтерфейсу.

source: Double click to change the style.
uk: Подвійно клікнути для зміни користувача.

source: Status line items
uk: Елементи рядку статусу

source: Running window
uk: Вікно виконання

source: Original size;Maximize;Full screen
uk: Оригінальний розмір;Максимізувати;На весь екран

source: Keep aspect ratio on the scaling
uk: Зберігати пропорцію під час масштабування

source: Do not show the status bar
uk: Не показувати рядок статусу

source: Control and save window positions
uk: Керування та збереження положень вікон

source: Alarm level: %1
de: Stufe der Störung: %1
ru: Уровень нарушения: %1
uk: Рівень порушення: %1

source: Restore the session creation for '%s'.
uk: Відновлення створення сеансу для '%s'.

source: Time of the session updating '%s': %s[%s]ms. Planer period %s(%s)ms
uk: Час оновлення сеансу '%s': %s[%s]мс. Планова періодичність %s(%s)мс

source: Error function of the notificator '%s': %s
uk: Помилка функції сповіщувача '%s': %s

source: Enabled notification
uk: Сповіщення включено

source: Performing the notification, always 1
uk: Здійснення сповіщення, завжди 1

source: Making the resource, always 0
uk: Формування ресурсу, завжди 0

source: Resource stream
uk: Потік ресурсу

source: Notification message
uk: Повідомлення сповіщення

source: Language of the notification message
uk: Мова повідомлення сповіщення

source: Resource stream type
uk: Тип потоку ресурсу

source: Procedure ID
uk: ID процедури

source: Notificator %d
uk: Сповіщувач %d

source: The button for quietance the current "%1"
uk: Кнопка для квітації поточного "%1"

source: Press for quietance the current "%1".
uk: Натиснути для квітації поточного "%1".

source: The button for quietance all "%1"
uk: Кнопка для квітації всіх "%1"

source: Press for quietance all "%1".
uk: Натиснути для квітації всіх "%1".

source: Page: '%1'. No access to view.
uk: Сторінка: '%1'. Відсутній доступ для перегляду.

source: <Disabled>
uk: <Вимкнено>

source: Select your style from the list.
uk: Оберіть Ваш стиль з переліку.

source: Selecting a style
uk: Вибір стилю

source: Elementary figure
de: Elementare Figur
ru: Элементарная фигура
uk: Елементарна фігура

source: Make this point dynamic
de: Diesen Punkt dynamisch machen
ru: Сделать эту точку динамической
uk: Зробити цю точку динамічною

source: Press to make this point dynamic
de: Betätigen Sie, um diesen Punkt dynamisch zu machen.
ru: Нажмите для того, чтобы сделать эту точку динамической.
uk: Натисніть, щоб зробити цю точку динамічною.

source: Make this point static
de: Diesen Punkt statisch machen
ru: Сделать эту точку статической
uk: Зробити цю точку статичною

source: Press to make this point static
de: Betätigen Sie, um diesen Punkt statisch zu machen.
ru: Нажмите для того, чтобы сделать эту точку статической.
uk: Натисніть, щоб зробити цю точку статичною.

source: Make line width dynamic
de: Die Linienstärke dynamisch machen
ru: Сделать ширину линии динамической
uk: Зробити ширину лінії динамічною

source: Press to make line width dynamic
de: Betätigen, um die Linienstärke dynamisch zu machen.
ru: Нажмите для того, чтобы сделать ширину линии динамической.
uk: Натисніть, щоб зробити ширину лінії динамічною.

source: Make line width static
de: Die Linienstärke statisch machen
ru: Сделать ширину линии статической
uk: Зробити ширину лінії статичною

source: Press to make line width static
de: Betätigen, um die Linienstärke statisch zu machen.
ru: Нажмите для того, чтобы сделать ширину линии статической.
uk: Натисніть, щоб зробити ширину лінії динамічною.

source: Make line color dynamic
de: Linienfarbe dynamisch machen
ru: Сделать цвет линии динамическим
uk: Зробити колір лінії динамічним

source: Press to make line color dynamic
de: Betätigen, um Linienfarbe dynamisch zu machen.
ru: Нажмите для того, чтобы сделать цвет линии динамическим.
uk: Натисніть, щоб зробити колір лінії динамічним.

source: Make line color static
de: Linienfarbe statisch machen
ru: Сделать цвет линии статическим
uk: Зробити колір лінії статичним

source: Press to make line color static
de: Betätigen, um Linienfarbe statisch zu machen.
ru: Нажмите для того, чтобы сделать цвет линии статическим.
uk: Натисніть, щоб зробити колір лінії статичним.

source: Make border width dynamic
de: Randbreite dynamisch machen
ru: Сделать ширину границы линии динамической
uk: Зробити ширину границі динамічною

source: Press to make border width dynamic
de: Betätigen, um die Randbreite dynamisch zu machen.
ru: Нажмите для того, чтобы сделать ширину границы линии динамической.
uk: Натисніть, щоб зробити ширину границі динамічною.

source: Make border width static
de: Randbreite statisch machen
ru: Сделать ширину границы линии статической
uk: Зробити ширину границі статичною

source: Press to make border width static
de: Betätigen, um die Randbreite statisch zu machen.
ru: Нажмите для того, чтобы сделать ширину борта линии статической.
uk: Натисніть, щоб зробити ширину границі статичною.

source: Make border color dynamic
de: Randfarbe dynamisch machen
ru: Сделать цвет границы линии динамическим
uk: Зробити колір границі динамічним

source: Press to make border color dynamic
de: Betätigen, um die Randfarbe dynamisch zu machen.
ru: Нажмите для того, чтобы сделать цвет границы линии динамическим.
uk: Натисніть, щоб зробити колір границі динамічним.

source: Make border color static
de: Randfarbe statisch machen
ru: Сделать цвет границы линии статическим
uk: Зробити колір границі статичним

source: Press to make border color static
de: Betätigen, um die Randfarbe statisch zu machen.
ru: Нажмите для того, чтобы сделать цвет границы линии статическим.
uk: Натисніть, щоб зробити колір границі статичним.

source: Make line style dynamic
de: Linienstil dynamisch machen
ru: Сделать стиль линии динамическим
uk: Зробити стиль лінії динамічним

source: Press to make line style dynamic
de: Betätigen, um den Linienstil dynamisch zu machen.
ru: Нажмите для того, чтобы сделать стиль линии динамическим.
uk: Натисніть, щоб зробити стиль лінії динамічним.

source: Make line style static
de: Linienstil statisch machen
ru: Сделать стиль линии статическим
uk: Зробити стиль лінії статичним

source: Press to make line style static
de: Betätigen, um den Linienstil statisch zu machen.
ru: Нажмите для того, чтобы сделать стиль линии статическим.
uk: Натисніть, щоб зробити стиль лінії статичним.

source: Show the figure's properties
de: Zeigen die Abbildung der Eigenschaften
ru: Показать свойства элементарной фигуры
uk: Показати властивості елементарної фігури

source: Press to show the properties dialog
de: Drücken, um den Eigenschaften-Dialog
ru: Нажать для получения свойств элементарной фигуры.
uk: Натиснути для отримання властивостей елементарної фігури.

source: Delete the current fill
de: Löschen Sie die aktuelle füllen
ru: Удалить заливку
uk: Видалити заповнення

source: Press to delete the current fill
de: Betätigen, um Löschen der aktuellen füllen.
ru: Нажать для удаления заливки.
uk: Натиснути для видалення заповнення.

source: Make fill color dynamic
de: Füllfarbe dynamisch machen
ru: Сделать цвет заливки динамическим
uk: Зробити колір заповнення динамічним

source: Press to make fill color dynamic
de: Betätigen, um die Füllfarbe dynamisch zu machen.
ru: Нажмите для того, чтобы сделать цвет заливки динамическим.
uk: Натисніть, щоб зробити колір заповнення динамічним.

source: Make fill color static
de: Füllfarbe statisch machen
ru: Сделать цвет заливки статическим
uk: Зробити колір заповнення статичним

source: Press to make fill color static
de: Betätigen, um die Füllfarbe statisch zu machen.
ru: Нажмите для того, чтобы сделать цвет заливки статическим.
uk: Натисніть, щоб зробити колір заповнення статичним.

source: Make fill image dynamic
de: Einfüllbild dynamisch machen
ru: Сделать изображение заливки динамическим
uk: Зробити зображення заповнення динамічним

source: Press to make fill image dynamic
de: Betätigen, um Einfüllbild dynamisch zu machen.
ru: Нажмите для того, чтобы сделать изображение заливки динамическим.
uk: Натисніть, щоб зробити зображення заповнення динамічним.

source: Make fill image static
de: Einfüllbild statisch machen
ru: Сделать изображение заливки статическим
uk: Зробити зображення заповнення статичним

source: Press to make fill image static
de: Betätigen, um Einfüllbild statisch zu machen.
ru: Нажмите для того, чтобы сделать изображение заливки статическим.
uk: Натисніть, щоб зробити зображення заповнення статичним.

source: Show the fill's properties
de: Zeigen die füllen die Eigenschaften
ru: Показать свойства заливки
uk: Показати властивості заповнення

source: Press to show the fill's properties dialog
de: Drücken, um die Füllung der Eigenschaften-Dialog
ru: Нажать для получения свойств заливки.
uk: Натиснути для отримання властивостей заповнення.

source: Make all values of the widget the static ones
de: Alle Widgetsgrössen statisch machen
ru: Сделать все величины виджета статическими
uk: Зробити усі величини віджета статичними

source: Press to make all values of the widget static ones
de: Betätigen, um alle Widgetsgrössen statisch zu machen.
ru: Нажмите для того, чтобы сделать все величины виджета статическими.
uk: Натисніть, щоб зробити усі величини віджета статичними.

source: Point coordinates(x,y): (%1, %2)
de: Punkt koordinaten(x,y): (%1, %2)
ru: Координаты точки(x,y): (%1, %2)
uk: Координати точки(x,y): (%1, %2)

source: Coordinates(x,y): (%1, %2)
de: Koordinaten(x,y): (%1, %2)
ru: Координаты(x,y): (%1, %2)
uk: Координати(x,y): (%1, %2)

source: Properties for the %1 figures.
de: Eigenschaften für Figuren: %1.
ru: Свойства для фигур: %1.
uk: Властивості для фігур: %1.

source: Properties for the '%1' figure: '%2'.
de: Eigenschaften für '%1' Figuren: '%2'.
ru: Свойства для '%1' фигуры: '%2'.
uk: Властивості для '%1' фігури: '%2'.

source: Elementary figure properties.
de: Elementare Eigenschaften Figur.
ru: Свойства элементарной фигуры.
uk: Властивості елементарних фігур.

source: Line:
ru: Линия:
uk: Лінія:

source: Border:
de: Rand:
ru: Граница:
uk: Границя:

source: Points:
de: Punkte:
ru: Точки:
uk: Точки:

source: Point 3:
de: Punkt 3:
ru: Точка 3:
uk: Точка 3:

source: Point 4:
de: Punkt 4:
ru: Точка 4:
uk: Точка 4:

source: Point 5:
de: Punkt 5:
ru: Точка 5:
uk: Точка 5:

source: Include(checked)/Exclude(unchecked) the fill color from the properties list.
de: Einschließen(eingeschlossen)/Ausschließen(ausgeschlossen) Einbettungsfarbe aus der Attributenliste.
ru: Включить(включен)/Исключить(выключен) цвет заливки из списка свойств.
uk: Включити(обраний)/Виключити(необраний) колір заповнення зі списку властивостей.

source: Fill Color
de: Füllfarbe
ru: Цвет заливки
uk: Колір заповнення

source: Set the default fill color.
de: Festlegen der Standard-Farbe füllen.
ru: Установить цвет заливки по умолчанию.
uk: Встановити колір заповнення за замовчуванням.

source: Include(checked)/Exclude(unchecked) the fill image from the properties list.
de: Einschließen(eingeschlossen)/Ausschließen(ausgeschlossen) Einbettungsbild aus der Attributenliste.
ru: Включить(включен)/Исключить(выключен) изображение заливки из списка свойств.
uk: Включити(обраний)/Виключити(необраний) зображення заповнення зі списку властивостей.

source: Fill Image
de: Füllen Image
ru: Изображение заливки
uk: Зображення заповнення

source: Set the default fill image.
de: Stellen Sie die Standard füllen Bild.
ru: Установить изображение заливки по умолчанию.
uk: Встановити зображення заповнення за замовчуванням.

source: Make the fill color Dynamic(checked)/Static(unchecked).
de: Einbettungsfarbe Dynamisch(eingeschaltet)/Statisch(abgeschaltet)machen.
ru: Сделать цвет заливки Динамическим(включена)/Статическим(выключена).
uk: Зробити колір заповнення Динамічним(обрана)/Статичним(необрана).

source: Dyn/Stat
ru: Дин/Стат
uk: Дін/Стат

source: Make the fill image Dynamic(checked)/Static(unchecked).
de: Einbettungsbild Dynamisch(eingeschaltet)/Statisch(abgeschaltet)machen.
ru: Сделать изображение заливки Динамическим(включена)/Статическим(выключена).
uk: Зробити зображення заповнення Динамічним(обрана)/Статичним(необрана).

source: Include(checked)/Exclude(unchecked) the line width from the properties list.
de: Einschließen(eingeschlossen)/Ausschließen(ausgeschlossen) die Linienbreite aus der Attributenliste.
ru: Включить(включен)/Исключить(выключен) ширину линии из списка свойств.
uk: Включити(обраний)/Виключити(необраний) ширину лінії зі списку властивостей.

source: Line width
de: Linienbreite
ru: Ширина линии
uk: Ширина лінії

source: Set the default line width.
de: Festlegen der Standard-Linienbreite.
ru: Установить ширину линии по умолчанию.
uk: Встановити ширину лінії за замовчуванням.

source: Make the line width Dynamic(checked)/Static(unchecked).
de: Linienbreite Dynamisch(eingeschaltet)/Statisch(abgeschaltet)machen.
ru: Сделать ширину линии Динамической(включена)/Статической(выключена).
uk: Зробити ширину лінії Динамічною(обрана)/Статичною(необрана).

source: Include(checked)/Exclude(unchecked) the line color from the properties list.
de: Eischließen(eingeschlossen)/Ausschließen(ausgeschlossen) Linienfarbe aus der Attributenliste.
ru: Включить(включен)/Исключить(выключен) цвет линии из списка свойств.
uk: Включити(обраний)/Виключити(необраний) колір лінії зі списку властивостей.

source: Line color
de: Linienfarbe
ru: Цвет линии
uk: Колір лінії

source: Set the default line color.
de: Stellen Sie die Standard Linienfarbe.
ru: Установить цвет линии по умолчанию.
uk: Встановити колір лінії за замовчуванням.

source: Make the line color Dynamic(checked)/Static(unchecked).
de: Linienfarbe Dynamisch(eingeschaltet)/Statisch(abgeschaltet)machen.
ru: Сделать цвет линии Динамическим(включена)/Статическим(выключена).
uk: Зробити колір лінії Динамічним(обрана)/Статичним(необрана).

source: Include(checked)/Exclude(unchecked) the line style from the properties list.
de: Eischließen(eingeschlossen)/Ausschließen(ausgeschlossen) Linienstil aus der Attributenliste.
ru: Включить(включен)/Исключить(выключен) стиль линии из списка свойств.
uk: Включити(обраний)/Виключити(необраний) стиль лінії зі списку властивостей.

source: Line style
de: Linienstil
ru: Стиль линии
uk: Стиль лінії

source: Set the default line style.
de: Festlegen der Standard-Linie Stil.
ru: Установить стиль линии по умолчанию.
uk: Встановити стиль лінії за замовчуванням.

source: Make the line style Dynamic(checked)/Static(unchecked).
de: Linienstil Dynamisch(eingeschaltet)/Statisch(abgeschaltet)machen.
ru: Сделать стиль линии Динамическим(включена)/Статическим(выключена).
uk: Зробити стиль лінії Динамічним(обрана)/Статичним(необрана).

source: Include(checked)/Exclude(unchecked) the border width from the properties list.
de: Eischließen(eingeschlossen)/Ausschließen(ausgeschlossen) Randbreite aus der Attributenliste.
ru: Включить(включен)/Исключить(выключен) ширину границы из списка свойств.
uk: Включити(обраний)/Виключити(необраний) ширину границі зі списку властивостей.

source: Border width
de: Randbreite
ru: Ширина границы
uk: Ширина границі

source: Set the default line's border width.
de: Festlegen der Standard-Linie den Rand Weite.
ru: Установить ширину границы по умолчанию.
uk: Встановити ширину границі за замовчуванням.

source: Make the border width Dynamic(checked)/Static(unchecked).
de: Randbreite Dynamisch(eingeschaltet)/Statisch(abgeschaltet)machen.
ru: Сделать ширину границы Динамической(включена)/Статической(выключена).
uk: Зробити ширину границі Динамічною(обрана)/Статичною(необрана).

source: Include(checked)/Exclude(unchecked) the border color from the properties list.
de: Eischließen(eingeschlossen)/Ausschließen(ausgeschlossen) Randfarbe aus der Attributenliste.
ru: Включить(включен)/Исключить(выключен) цвет границы из списка свойств.
uk: Включити(обраний)/Виключити(необраний) колір границі зі списку властивостей.

source: Border color
de: Randfarbe
ru: Цвет границы
uk: Колір границі

source: Set the default line's border color.
de: Festlegen der Standard-Linie den Rand Farbe.
ru: Установить цвет границы по умолчанию.
uk: Встановити колір границі за замовчуванням.

source: Make the border color Dynamic(checked)/Static(unchecked).
de: Randfarbe Dynamisch(eingeschaltet)/Statisch(abgeschaltet)machen.
ru: Сделать цвет границы Динамическим(включена)/Статическим(выключена).
uk: Зробити колір границі Динамічним(обрана)/Статичним(необрана).

source: Point 1:
de: Punkt 1:
ru: Точка 1:
uk: Точка 1:

source: Make the 1 point Dynamic(checked)/Static(unchecked).
de: Punkt 1 Dynamisch(eingeschaltet)/Statisch(abgeschaltet)machen.
ru: Сделать 1 точку Динамической(включена)/Статической(выключена).
uk: Зробити 1 точку Динамічною(обрана)/Статичною(необрана).

source: Point 2:
de: Punkt 2:
ru: Точка 2:
uk: Точка 2:

source: Make the 2 point Dynamic(checked)/Static(unchecked).
de: Punkt 2 Dynamisch(eingeschaltet)/Statisch(abgeschaltet)machen.
ru: Сделать 2 точку Динамической(включена)/Статической(выключена).
uk: Зробити 2 точку Динамічною(обрана)/Статичною(необрана).

source: Make the 3 point Dynamic(checked)/Static(unchecked).
de: Punkt 3 Dynamisch(eingeschaltet)/Statisch(abgeschaltet)machen.
ru: Сделать 3 точку Динамической(включена)/Статической(выключена).
uk: Зробити 3 точку Динамічною(обрана)/Статичною(необрана).

source: Make the 4 point Dynamic(checked)/Static(unchecked).
de: Punkt 4 Dynamisch(eingeschaltet)/Statisch(abgeschaltet)machen.
ru: Сделать 4 точку Динамической(включена)/Статической(выключена).
uk: Зробити 4 точку Динамічною(обрана)/Статичною(необрана).

source: Make the 5 point Dynamic(checked)/Static(unchecked).
de: Punkt 5 Dynamisch(eingeschaltet)/Statisch(abgeschaltet)machen.
ru: Сделать 5 точку Динамической(включена)/Статической(выключена).
uk: Зробити 5 точку Динамічною(обрана)/Статичною(необрана).

source: Solid
ru: Сплошная
uk: Суцільна

source: Dashed
de: Gestrichelte
ru: Пунктир
uk: Пунктир

source: Dotted
de: Gepunktet
ru: Точечная
uk: Крапкова

source: Widget's shape '%1' is not implemented yet!
de: Widgetsgestalt '%1' ist nicht verfügbar!
ru: Образ виджета '%1' ещё не реализован!
uk: Образ віджету '%1' ще не реалізовано!

source: Saving a file
uk: Збереження файлу.

source: Loading a file
uk: Завантаження файлу.

source: Error writing to the file '%1'.
uk: Помилка запису до файлу '%1'.

source: Time of building the trend: %f ms.
uk: Час формування тренду: %f мс.

source: kHz
ru: кГц
uk: кГц

source: Hz
ru: Гц
uk: Гц

source: %ds
ru: %dс
uk: %dс

source: %gs
ru: %gс
uk: %gс

source: %gms
ru: %gмс
uk: %gмс

source: Time of drawing the trend: %f ms.
uk: Час відображення тренду: %f мс.

source: Date and time
de: Datum und Uhrzeit
ru: Дата и время
uk: Дата та час

source: Print
uk: Друк

source: Export
uk: Експорт

source: Error parsing the document: %s
uk: Помилка розбору документу: %s

source: Loading page: '%1'.
de: Lade Seite: '%1'.
ru: Загрузка страницы: '%1'.
uk: Завантаження сторінки: '%1'.

source: Cancel
de: Abbrechen
ru: Отмена
uk: Скасувати

source: Selecting an user
uk: Вибір користувача

source: Station:
uk: Станція:

source: User:
de: Benutzer:
ru: Пользователь:
uk: Користувач:

source: Password:
de: Kennwort:
ru: Пароль:
uk: Пароль:

source: Selecting a font
uk: Вибір шрифту

source: Font:
de: Schrift:
ru: Шрифт:
uk: Шрифт:

source: Bold
de: Fett
ru: Усиленный
uk: Підсилений

source: Italic
de: Kursiv
ru: Наклонный
uk: Нахилений

source: Strikeout
de: Durchgestrichen
ru: Перечёркнутый
uk: Перекреслений

source: Underline
de: Unterstrichen
ru: Подчёркнутый
uk: Підкреслений

source: Sample:
de: Muster:
ru: Образец:
uk: Зразок:

source: AaBbCcDdEeFf
ru: АаБбВвГгДдЕе
uk: АаБбВвГгДдЕе

source: Find
de: Suche
ru: Поиск
uk: Пошук

source: Find next
de: Weitersuchen
ru: Поиск следующего
uk: Пошук наступного

source: Apply
uk: Прийняти

source: Cursor = (%1:%2)
ru: Курсор = (%1:%2)
uk: Курсор = (%1:%2)

source: Enter a string to search:
uk: Введіть рядок для пошуку:

source: Search string
uk: Рядок пошуку

source: Backward
de: Rückwärts
ru: Обратный
uk: Зворотній

source: Case sensitively
de: Case sensibel
ru: Чувствительный к регистру
uk: Чутливий до регістру

source: Whole words
de: Ganze Wörter
ru: Слово целиком
uk: Слово цілком

source: Time of requesting the VCA engine '%s': %f ms.
uk: Час запиту до рушія СВУ '%s' %f мс.

source: Time of loading '%s': %f ms.
uk: Час завантаження '%s': %f мс.

source: Time of initiating '%s': %f ms.
uk: Час ініціалізації '%s': %f мс.

source: Input dialog of Vision
uk: Діалог вводу Vision

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко

source: Roman Savochenko, Lysenko Maxim, Yashina Kseniya
de: Roman Savotschenko, Maxim Lysjenko, Ksenija Jaschina
ru: Роман Савоченко, Лысенко Максим, Яшина Ксения

source: Visual operation user interface.
de: Benutzerschnittstelle
ru: Рабочий пользовательский интерфейс.

source: Developers
de: Entwickler
ru: Разработчики
