Repository: aleax/openscada
Catalog: src/moduls/ui/Vision/po/*.po
Languages: de, ru, uk

source: Several sessions are already opened on the project "%1". You can create new or connect to present session. Please, select needed or press "Cancel".
de: Bereits mehrere offene Sessions für das Projekt "%1". Sie können eine neue Sitzung erstellen oder sich an eine existierende Sitzung verbinden. Bitte wählen Sie die richtige oder klicken Sie "Abbrechen".
ru: Уже открыто несколько сеансов для проекта "%1". Вы можете создать новый сеанс или подключиться к существующему. Пожалуйста, выберите нужное или нажмите "Отмена".

source: Select session for connection or new creation
de: Sitzung für die Verbindung auswählen oder eine neue
ru: Выбор сеанса для подключения или создание нового

source: Error open: %s
de: Fehler beim Öffnen: %s
ru: Ошибка открытия: %s

source: Error write to: %s
de: Fehler schreiben Sie an: %s
ru: Ошибка записи в: %s

source: Session creation restore for '%s'.
de: Wiederaufbau der Schaffung der Session für '%s'.
ru: Восстановление создания сеанса для '%s'.

source: Session '%s' update time %f ms.
de: Sitzung '%s' Aktualisierungszeit %f ms.
ru: Время обновления сеанса '%s' %f мс.

source: Page: '%1'. View access is not permitted.
de: Seite: '%1'. Ansicht Zugriff ist nicht erlaubt.
ru: Страница: '%1'. Отсутствует доступ для просмотра.

source: No style
de: Kein Stil
ru: Нет стиля

source: Select your style from list.
de: Wählen Sie Ihren Stil aus der Liste.
ru: Выберите Ваш стиль из списка.

source: Style select
de: Stil wählen
ru: Выбор стиля

source: Save file
de: Datei speichern
ru: Сохранение файла.

source: Load file
de: Datei laden
ru: Загрузка файла.

source: Write file '%1' is fail.
de: Fehler beim Schreiben in die Datei '%1'.
ru: Ошибка записи в файл '%1'.

source: Trend build: %f ms.
de: Trend zu bauen: %f ms.
ru: Время формирования графика: %f мс.

source: Trend draw: %f ms.
de: Trend zu ziehen: %f ms.
ru: Время изображения графика: %f мс.

source: Document parsing error: %s
de: Fehler der Dokumentanalyse: %s
ru: Ошибка разбора документа: %s

source: Ok
de: Annehmen
ru: Принять

source: Select user
de: Benutzer auswählen
ru: Выбор пользователя

source: Font select
de: Schrift auswählen
ru: Выбор шрифта

source: Enter text string for search:
de: Geben Sie den Text-String für Suche:
ru: Ввод строки текста для поиска:

source: String search
de: String-Suche
ru: Поиск строки

source: Request to VCA engine '%s' time %f ms.
de: Zeit der Anfrage an die VCA Maschine '%s' %f msek.
ru: Время запроса к движку СВУ '%s' %f мс.

source: Load '%s' time %f ms.
de: Zeit für Laden '%s' %f msek.
ru: Время загрузки '%s' %f мс.

source: Init '%s' time %f ms.
de: Zeit der Initialisation '%s' %f ms.
ru: Время инициализации '%s' %f мс.

source: Vision dialog
ru: Vision диалог
