Repository: aleax/openscada
Catalog: src/moduls/ui/Vision/po/*.po
Languages: de, ru, uk

source: Operation user interface (Qt)
de: Benutzerschnittstelle (Qt)
ru: Рабочий пользовательский интерфейс (Qt)
uk: Робочий інтерфейс користувача (Qt)

source: Roman Savochenko, Maxim Lysenko (2006-2012), Kseniya Yashina (2006-2007), Evgen Zaichuk (2005-2006)
uk: Роман Савоченко, Максим Лисенко (2006-2012), Ксенія Яшина (2006-2007), Евген Зайчук (2005-2006)

source: Visual operation user interface, based on the Qt library - front-end to the VCA engine.
uk: Робочий інтерфейс користувача, заснований на бібліотеці Qt - зовнішній інтерфейс до рушія СВУ.

source: ======================= Module <%s:%s> options ======================= ---- Parameters of the module section '%s' of the configuration file ---- StartUser <user> Start-up, no-password, user. UserPass <pass> User password for non-local start. RunPrjs <list> List of projects to be launched at the start of the module. ExitLstRunPrjCls <0|1> Exit closing the last completed project (by default 1). DropCommonWdgStls <0|1> Reset widget styles to common for some specific widgets in runtime, like to buttons (default 1). CachePgLife <hours> Lifetime of the pages in the cache (by default 1). CachePgSz <numb> Maximum number of the pages in the cache (by default 10). VCAstation <id> The station with the VCA engine ('.' is local). RestoreTime <seconds> Connection recovery time.
uk: ======================== Опції модуля <%s:%s> ============================ ------ Параметри модульної секції '%s' конфігураційного файлу ------ StartUser <корист> Стартовий, безпарольний, користувач. UserPass <пароль> Пароль користувача для нелокального запуску. RunPrjs <перелік> Перелік проєктів які мають запускатися при старті модуля. ExitLstRunPrjCls <0|1> Вихід при закритті останнього проєкту що виконується (по замовченню = 1). DropCommonWdgStls <0|1> Скидати стилі віджетів до загального для деяких специфічних віджетів у режимі виконання, на кшталт кнопок (по замовченню 1). CachePgLife <години> Час життя сторінок у кешу (по замовченню 1). CachePgSz <кільк.> Максимальна кількість сторінок у кешу (по замовченню 10). VCAstation <id> Станція з рушієм СВУ ('.' - локальна). RestoreTime <секунди> Час відновлення підключення.

source: Loading the module.
uk: Завантаження модуля.

source: Saving the module.
uk: Збереження модуля.

source: Error connecting to remote station!
uk: Помилка підключення до віддаленої станції!

source: Error authenticating the user '%1'!!!
uk: Помилка автентифікації користувача '%1'!!!

source: Starting the module.
uk: Старт модуля.

source: Stopping the module.
uk: Зупинка модуля.

source: Number of individual displays
uk: Кількість окремих екранів

source: Main windows
uk: Основні вікна

source: Module options
de: Optionen des Moduls
ru: Опции модуля
uk: Опції модуля

source: Exit when closing the last running project
uk: Вихід при закритті останнього проєкту що виконується

source: Reset widget styles to common
uk: Скидати стилі віджетів до загального

source: Required for some widget styles like "gtk" in some specific widgets in run mode, like buttons for the background color and images.
uk: Потрібне для деяких стилів віджетів на кшталт "gtk" у роботі деяких специфічних віджетів у режимі виконання, на кшталт кнопок для кольору фону та зображень.

source: Lifetime and maximum number of the cached pages
uk: Час життя та максимальна кількість сторінок у кеші

source: The time is specified in hours, which defines the inactivity interval for closing pages in the cache. Zero value of the time excludes the closing of pages in the cache.
uk: Час вказується у годинах, який визначає інтервал бездіяльності для закриття сторінок у кеш. Нульове значення часу виключає закриття сторінок у кеш.

source: The number defines a limit of pages in the cache. Zero value of the number excludes the cache limit.
uk: Кількість визначає обмеження сторінок у кеші. Нульове значення кількості виключає закриття сторінок у кеш.

source: Go to the remote stations list configuration
uk: Перейти до конфігурації переліку віддалених станцій

source: Station of the VCA engine
uk: Станція рушія СВУ

source: Use '%s' for querying the station together user and password at the module generic call. Useful at presence of many control stations and for opening several of them simultaneously.
uk: Користуйтеся '%s' для запиту станції разом із користувачем та паролем при загальному виклику модуля. Корисно за наявності багато станцій керування та відкриття декількох з них одночасно.

source: <Select>
uk: <Вибір>

source: Starting user
uk: Стартовий користувач

source: Password of the user
uk: Пароль користувача

source: Connection recovery time, seconds
uk: Час відновлення підключення, секунд

source: List of the projects for launch
uk: Перелік проєктів для пуску

source: Automatically executed projects, divided by the symbol ';'. To open the project window on the desired display (1), use the project name format: 'PrjName-1'. To connect to the background or another open session use "ses_{SesID}".
uk: Автоматично виконувані проєкти, поділені символом ';'. Для відкриття вікна проєкту на потрібному дисплеї (1) використовуйте формат ім'я проєкту: 'PrjName-1'. Для підключення до фонового або іншого відкритого сеансу використати "ses_{SesID}".

source: %d: Development by "%s" for the station "%s".
uk: %d: Розробка від "%s" для станції "%s".

source: %d: Running "%s:%s" from "%s" - %s, for the station "%s", updating period %s(%s), cached pages %d and resources %d.
uk: %d: Виконання "%s:%s" від "%s" - %s, для станції "%s", період оновлення %s(%s), кешованих сторінок %d та ресурсів %d.

source: Connected
uk: Під'єднаний

source: Disconnected
uk: Від'єднаний

source: <Local>
uk: <Локально>

source: Ready
de: Fertig
ru: Готов
uk: Готовий

source: %s %s-developing: %s
uk: %s %s-розробка: %s

source: Full screen
de: Vollbild
ru: Весь экран
uk: Весь екран

source: Full screen mode toggling
uk: Перемикання режиму "На весь екран"

source: The button for full screen mode toggling
uk: Кнопка для перемикання режиму "На весь екран"

source: Press for toggling the full screen mode.
uk: Натиснути для перемикання режиму "На весь екран".

source: &Close
de: &Schliessen
ru: &Закрыть
uk: &Закрити

source: Close the Vision window
uk: Закрити вікно Vision

source: The button for closing the Vision developing window
uk: Кнопка для закриття вікна розробки Vision

source: Press to close of the current Vision developing window.
uk: Натиснути для закриття вікна розробки Vision.

source: &Quit
de: &Beenden
ru: &Выход
uk: &Вихід

source: Quit the program
uk: Вихід з програми

source: The button for complete quit the program
uk: Кнопка повного виходу з програми

source: Press for complete quit the program.
uk: Натиснути для повного виходу з програми.

source: &About
de: &Über
ru: &Про
uk: &Про

source: Program and OpenSCADA information
de: OpenSCADA-Information
ru: Информация о программе и OpenSCADA
uk: Інформація про програму та OpenSCADA

source: The button of the information of the program and OpenSCADA
uk: Кнопка інформації про програму та OpenSCADA

source: Press for information of the program and OpenSCADA.
uk: Натиснути для інформації про програму та OpenSCADA.

source: About &Qt
de: Über &Qt
ru: Про &Qt
uk: Про &Qt

source: Qt information
ru: Информация о Qt
uk: Інформація про Qt

source: The button for getting the using Qt information
uk: Кнопка для отримання інформації про Qt

source: Press for getting the using Qt information.
uk: Натиснути для отримання інформації про Qt.

source: Manual on ...
uk: Підручник на ...

source: The button for getting the library manual
uk: Кнопка отримання підручника бібліотеки

source: Press for getting the library manual.
uk: Натиснути для отримання підручника бібліотеки.

source: Manual on '%1'
uk: Підручник на '%1'

source: The button for getting the using '%1' manual
uk: Кнопка отримання підручника '%1'

source: Press for getting the using '%1' manual.
uk: Натиснути для отримання підручника '%1'.

source: What's &This
de: Was ist &das
ru: Что &это
uk: Що &це

source: Requesting about GUI elements
uk: Запит інформації про GUI елементи

source: The button for requesting information about the user interface elements
uk: Кнопка запиту інформації про GUI елементи

source: Press for requesting information about the user interface elements.
uk: Натиснути для запиту інформації про GUI елементи.

source: Load from DB
de: Datenbank laden
ru: Загрузить из БД
uk: Завантажити з БД

source: Load the item data from DB
uk: Завантажити дані елементу з БД

source: The button for loading the item data from the DB
uk: Кнопка завантаження даних елементу з БД

source: Press for loading the item data from the DB.
uk: Натиснути для завантаження даних елементу з БД.

source: Load from DB forcibly
uk: Примусово завантажити з БД

source: Load the item data from DB forcibly
uk: Примусово завантажити дані елементу з БД

source: The button for loading the item data from the DB forcibly, not only when it changed
uk: Кнопка примусового завантаження даних елементу з БД, не тільки коли змінено

source: Press for loading the item data from the DB forcibly, not only when it changed.
uk: Натиснути для примусового завантаження даних елементу з БД, не тільки коли змінено.

source: Save to DB
de: Datenbank speichern
ru: Сохранить в БД
uk: Зберегти у БД

source: Save the item data to DB
uk: Зберегти дані елементу у БД

source: The button for saving the item data to the DB
uk: Кнопка збереження даних елементу у БД

source: Press for saving the item data to the DB.
uk: Натиснути для збереження даних елементу у БД.

source: Save to DB forcibly
uk: Примусово зберегти у БД

source: Save the item data to DB forcibly
uk: Примусово зберегти дані елементу у БД

source: The button for saving the item data to the DB forcibly, not only when it changed
uk: Кнопка примусового збереження даних елементу у БД, не тільки коли змінено

source: Press for saving the item data to the DB forcibly, not only when it changed.
uk: Натиснути для примусового збереження даних елементу у БД, не тільки коли змінено.

source: Run project
uk: Запустити проєкт

source: Run the project execution for the selected item
uk: Запуск виконання проєкту для обраного елемента

source: The button for running the project execution for the selected item
uk: Кнопка запуску виконання проєкту для обраного елемента

source: Press for running the project execution for the selected item.
uk: Натиснути для запуску виконання проєкту для обраного елемента.

source: New project
de: Neues Projekt
ru: Новый проект
uk: Новий проєкт

source: The button for creation a new project
uk: Кнопка створення нового проєкту

source: Press for creation a new project.
uk: Натиснути для створення нового проєкту.

source: New library
de: Neue Bibliothek
ru: Новая библиотека
uk: Нова бібліотека

source: New widgets library
uk: Нова бібліотека віджетів

source: The button for creation a new widgets library
uk: Кнопка створення нової бібліотеки віджетів

source: Press for creation a new widgets library.
uk: Натиснути для створення нової бібліотеки віджетів.

source: Add visual item
de: Element hinzufügen
ru: Добавить визуальный элемент
uk: Додати візуальний елемент

source: Adding a visual item to the library, container widget, project or page
uk: Додавання візуального елементу до бібліотеки, контейнерного віджету, проєкту або сторінки

source: The button for adding a visual item to the library, container widget, project or page
uk: Кнопка додавання візуального елементу до бібліотеки, контейнерного віджету, проєкту або сторінки

source: Press for adding a visual item to the library, container widget, project or page.
uk: Натиснути для додавання візуального елементу до бібліотеки, контейнерного віджету, проєкту або сторінки.

source: Delete visual item
de: Element löschen
ru: Удалить визуальный элемент
uk: Видалити візуальний елемент

source: Deleting the visual item from the library, container widget, project or page
uk: Видалення візуального елементу з бібліотеки, контейнерного віджета, проєкту або сторінки

source: The button for deleting the visual item from the library, container widget, project or page
uk: Кнопка видалення візуального елементу з бібліотеки, контейнерного віджета, проєкту або сторінки

source: Press for deleting the visual item from the library, container widget, project or page.
uk: Натиснути для видалення візуального елементу з бібліотеки, контейнерного віджета, проєкту або сторінки.

source: Properties of the visual item
uk: Властивості візуального елементу

source: Getting the properties of the visual item
uk: Отримання властивостей візуального елементу

source: The button for getting the properties of the visual item
uk: Кнопка отримання властивостей візуального елементу

source: Press for getting the properties of the visual item.
uk: Натиснути для отримання властивостей візуального елементу.

source: Edit visual item
uk: Редагувати візуальний елемент

source: Going to editing the visual item
uk: Перехід до редагування візуального елементу

source: The button for going to editing the visual item
uk: Кнопка переходу до редагування візуального елементу

source: Press for going to editing the visual item.
uk: Натиснути для переходу до редагування візуального елементу

source: Clear visual item changes
uk: Очистити зміни візуального елементу

source: Clearing the visual items changes
uk: Очищення змін візуального елементу

source: The button for clearing the visual items changes
uk: Кнопка виконання очищення змін візуального елементу

source: Press for clearing the visual items changes.
uk: Натиснути для очищення змін візуального елементу.

source: Lower down visual item changes
uk: Опустити зміни візуального елементу

source: Lowering down the visual item changes to the parent
uk: Опущення змін візуального елементу до предку

source: The button for lowering down the visual item changes to the parent
uk: Кнопка опущення змін візуального елементу до предку

source: Press for lowering down the visual item changes to the parent.
uk: Натиснути для опущення змін візуального елементу до предку.

source: Undo visual item changes
uk: Відмінити зміни візуального елементу

source: Undoing the visual item changes:
uk: Відміна змін візуального елементу:

source: The button for undoing the visual item changes
uk: Кнопка відміни змін візуального елементу

source: Press for undoing the visual item changes.
uk: Натиснути для відміни змін візуального елементу.

source: Redo visual item changes
uk: Повторити зміни візуального елементу

source: Redoing the visual item changes:
uk: Повторення змін візуального елементу:

source: The button for redoing the visual item changes
uk: Кнопка для повторення змін візуального елементу

source: Press for redoing the visual item changes.
uk: Натиснути для повторення змін візуального елементу.

source: Copy visual item
uk: Копіювати візуальний елемент

source: Copying the visual item
uk: Копіювання візуального елементу

source: The button for copying the visual item
uk: Кнопка копіювання візуального елементу

source: Press for copying the visual item.
uk: Натиснути для копіювання візуального елементу.

source: Cut visual item
uk: Вирізати візуальний елемент

source: Cutting the visual item
uk: Вирізання візуального елементу

source: The button for cutting the visual item
uk: Кнопка вирізання візуального елементу

source: Press for cutting the visual item.
uk: Натиснути для вирізання візуального елементу.

source: Paste visual item
uk: Вставити візуальний елемент

source: Pasting the visual item
uk: Вставлення візуального елементу

source: The button for pasting the visual item
uk: Кнопка вставлення візуального елементу

source: Press for pasting the visual item.
uk: Натиснути для вставлення візуального елементу.

source: Raise up to the top
uk: Підняти догори

source: Raising up the selected widgets to the top
uk: Підняття обраних віджетів на гору

source: The button for raising up the selected widgets to the top
uk: Кнопка підняття обраних віджетів на гору

source: Press for raising up the selected widgets to the top.
uk: Натиснути для підняття обраних віджетів на гору.

source: Lower down to the bottom
uk: Опустити додолу

source: Lowering down the selected widgets to the bottom
uk: Опущення обраних віджетів додолу

source: The button for lowering down the selected widgets to the bottom
uk: Кнопка опущення обраних віджетів додолу

source: Press for lowering down the selected widgets to the bottom.
uk: Натиснути для опущення обраних віджетів додолу.

source: Rise up
uk: Підняти

source: Raising up the selected widgets
uk: Підняття обраних віджетів

source: The button for raising up the selected widgets
uk: Кнопка підняття обраних віджетів

source: Press for raising up the selected widgets.
uk: Натиснути для підняття обраних віджетів.

source: Lower down
uk: Опустити

source: Lowering down the selected widgets
uk: Опущення обраних віджетів

source: The button for lowering down the selected widgets
uk: Кнопка опущення обраних віджетів

source: Press for lowering down the selected widgets.
uk: Натиснути для опущення обраних віджетів.

source: Align to the left
uk: Вирівняти ліворуч

source: Aligning the selected widgets to the left
uk: Вирівнювання обраних віджетів ліворуч

source: The button for aligning the selected widgets to the left
uk: Кнопка вирівнювання обраних віджетів ліворуч

source: Press for aligning the selected widgets to the left.
uk: Натиснути для вирівнювання обраних віджетів ліворуч.

source: Align vertically to the center
uk: Вирівняти у центрі вертикально

source: Aligning the selected widgets vertically to the center
uk: Вирівнювання обраних віджетів у центрі вертикально

source: The button for aligning the selected widgets vertically to the center
uk: Кнопка вирівнювання обраних віджетів у центрі вертикально

source: Press for aligning the selected widgets vertically to the center.
uk: Натиснути для вирівнювання обраних віджетів у центрі вертикально.

source: Align to the right
uk: Вирівняти праворуч

source: Aligning the selected widgets to the right
uk: Вирівнювання обраних віджетів праворуч

source: The button for aligning the selected widgets to the right
uk: Кнопка вирівнювання обраних віджетів праворуч

source: Press for aligning the selected widgets to the right.
uk: Натиснути для вирівнювання обраних віджетів праворуч.

source: Align to the top
uk: Вирівняти догори

source: Aligning the selected widgets to the top
uk: Вирівнювання обраних віджетів догори

source: The button for aligning the selected widgets to the top
uk: Кнопка вирівнювання обраних віджетів догори

source: Press for aligning the selected widgets to the top.
uk: Натиснути для вирівнювання обраних віджетів догори.

source: Align horizontally to the center
uk: Вирівняти у центрі горизонтально

source: Aligning the selected widgets horizontally to the center
uk: Вирівнювання обраних віджетів у центрі горизонтально

source: The button for aligning the selected widgets horizontally to the center
uk: Кнопка вирівнювання обраних віджетів у центрі горизонтально

source: Press for aligning the selected widgets horizontally to the center.
uk: Натиснути для вирівнювання обраних віджетів у центрі горизонтально.

source: Align to the bottom
uk: Вирівняти додолу

source: Aligning the selected widgets to the bottom
uk: Вирівнювання обраних віджетів додолу

source: The button for aligning the selected widgets to the bottom
uk: Кнопка вирівнювання обраних віджетів додолу

source: Press for aligning the selected widgets to the bottom.
uk: Натиснути для вирівнювання обраних віджетів додолу.

source: Return the cursor
uk: Повернути курсор

source: Returning the cursor
uk: Повернення курсору

source: The button for returning the cursor
uk: Кнопка повернення курсору

source: Press for returning the cursor.
uk: Натиснути для повернення курсору.

source: Add line
de: Eine Linie hinzufügen
ru: Добавить линию
uk: Додати лінію

source: Adding a line to the elementary figure
uk: Додання лінії до елементарної фігури

source: The button for adding a line to the elementary figure
uk: Кнопка додання лінії до елементарної фігури

source: Press for adding a line to the elementary figure.
uk: Натиснути для додання лінії до елементарної фігури.

source: Add arc
de: Einen Bogen hinzufügen
ru: Добавить дугу
uk: Додати дугу

source: Adding an arc to the elementary figure
uk: Додання дуги до елементарної фігури

source: The button for adding an arc to the elementary figure
uk: Кнопка додання дуги до елементарної фігури

source: Press for adding an arc to the elementary figure.
uk: Натиснути для додання дуги до елементарної фігури.

source: Add Besier curve
de: Den Besie-Bogen hinzufügen
ru: Добавить кривую Безье
uk: Додати криву Безьє

source: Adding a Besier curve to the elementary figure
uk: Додання кривої Безьє до елементарної фігури

source: The button for adding a Besier curve to the elementary figure
uk: Кнопка додання кривої Безьє до елементарної фігури

source: Press for adding a Besier curve to the elementary figure.
uk: Натиснути для додання кривої Безьє до елементарної фігури.

source: Connections
de: Verbindungen
ru: Подключиться
uk: Прив'язки

source: Enabling the connections
uk: Включення прив'язок

source: The button for enabling the connections
uk: Кнопка включення прив'язок

source: Press for enabling the connections.
uk: Натиснути для включення прив'язок.

source: Cl&ose
de: &Schließen
ru: &Закрыть
uk: &Закрити

source: Close the active window
uk: Закрити активне вікно

source: The button for closing the active window
uk: Кнопка закриття активного вікна

source: Press for closing the active window.
uk: Натиснути для закриття активного вікна.

source: Close &All
de: Schließen &alle
ru: Закрыть &все
uk: Закрити &все

source: Close all windows
de: Alle Fenster schließen
ru: Закрыть все окна
uk: Закриття всіх вікон

source: The button for closing all windows
uk: Кнопка закриття всіх вікон

source: Press for closing all windows.
uk: Натиснути для закриття всіх вікон.

source: &Tile
de: &Aufschichten
ru: &Уложить
uk: &Укласти

source: Tile all windows
de: Alle Fenster aufschichten
ru: Укладывание всех окон
uk: Укласти всі вікна

source: The button for tiling all windows
uk: Кнопка укладки всіх вікон

source: Press for tiling all windows.
uk: Натиснути для укладки всіх вікон.

source: &Cascade
de: &Staffeln
ru: &Каскадировать
uk: &Каскадувати

source: Cascade all windows
de: Staffeln aller Fenster
ru: Каскадирование всех окон
uk: Каскадувати всі вікна

source: The button for cascading all windows
uk: Кнопка каскадування всіх вікон

source: Press for cascading all windows.
uk: Натиснути для каскадування всіх вікон.

source: Ne&xt
de: &Nächstes
ru: &Следующее
uk: &Наступне

source: Activate the next window
uk: Активувати наступне вікно

source: The button for activating the next window
uk: Кнопка активування наступного вікна

source: Press for activating the next window.
uk: Натиснути для активування наступного вікна.

source: Pre&vious
de: &Vorheriges
ru: &Предыдущее
uk: &Попереднє

source: Activate the previous window
uk: Активувати попереднє вікно

source: The button for activating the previous window
uk: Кнопка активування попереднього вікна

source: Press for activating the previous window.
uk: Натиснути для активування попереднього вікна.

source: &File
de: &Datei
ru: &Файл
uk: &Файл

source: &Edit
de: &Bearbeiten
ru: &Редактирование
uk: &Редагування

source: &Project
de: &Projekt
ru: &Проект
uk: &Проєкт

source: &Widget
ru: &Виджет
uk: &Віджет

source: &View
de: An&sicht
ru: В&ид
uk: В&ид

source: &Window
de: &Fenster
ru: &Окно
uk: Вікн&о

source: &Help
de: &Hilfe
ru: &Помощь
uk: &Допомога

source: Visual items toolbar
de: Toolbar der Elemente
ru: Панель визуальных элементов
uk: Панель візуальних елементів

source: Functions of the widgets location
uk: Функції розташування віджетів
