Repository: aleax/openscada
Catalog: src/moduls/ui/Vision/po/*.po
Languages: de, ru, uk

source: ======================= The module <%s:%s> options ======================= ---------- Parameters of the module section '%s' in config-file ---------- StartUser <user> No password requested start user. UserPass <pass> User password for no local start. RunPrjs <list> Run projects list on the module start. RunPrjsSt {0;1} Display status for run projects (default = 1). ExitLstRunPrjCls {0;1}Exit on last run project close (default = 1). CachePgLife <hours> Cached pages lifetime. VCAstation <id> VCA station id ('.' - local). PlayCom <cmd> Audio alarms' files play command.
de: ======================== Optionen des Moduls <%s:%s> ============================ ------- Parameter des Abschnitts '%s' in der Konfigurationsdatei --------- StartUser <user> Startbenutzer, ohne Kennwort. UserPass <passwort> Passwort auf eine nicht-lokale Start. RunPrjs <list> Liste von aktivierten Projekte beim Starten . RunPrjsSt {0;1} Zeigt den Status der laufenden Projekte (standardmäßig = 1). ExitLstRunPrjCls {0;1}Beenden, wenn der letzte der Ablauf des Projekts (standardmäßig = 1). CachePgLife <uhr> Die Lebensdauer der Seiten im Cache. VCAstation <id> Station mit der VCA Maschine ('.' - local). PlayCom <befehl> Audio-Alarme Dateien abspielen Befehl.
ru: ======================== Опции модуля <%s:%s> ============================ ------- Параметры модульной секции '%s' в конфигурационном файле --------- StartUser <польз> Стартовый, беcпарольный, пользователь. UserPass <пароль> Пароль пользователя для нелокального запуска. RunPrjs <список> Перечень запускаемых при старте проектов. RunPrjsSt {0;1} Отображать статус для запускаемых проектов (по умолчанию = 1). ExitLstRunPrjCls {0;1}Выход при закрытии последнего исполняющегося проекта (по умолчанию = 1). CachePgLife <часы> Время жизни страниц в кеше. VCAstation <id> Станция с движком СВУ ('.' - локальная). PlayCom <команда> Команда проигрывания аудио-файлов сигнализации.

source: Load module.
de: Modul laden.
ru: Загрузка модуля.

source: Save module.
de: Speicherung des Moduls.
ru: Сохранение модуля.

source: Error connection to remote station!
de: Fehler beim Verbinden an die enfernte Station!
ru: Ошибка подключения к удалённой станции!

source: Auth wrong!!!
de: Authentifizierungsfehler!!!
ru: Ошибка аутентификации!!!

source: Start module.
de: Modul starten.
ru: Старт модуля.

source: Stop module.
de: Modul anhalten.
ru: Останов модуля.

source: Display number
de: Anzeige der Anzahl
ru: Количество экранов

source: VCA engine station
de: Station der VCA Maschine
ru: Станция движка СВУ

source: Start user
de: Start Benutzer
ru: Стартовый пользователь

source: User password
de: Kennwort des Benutzers
ru: Пароль пользователя

source: Cached pages lifetime
de: Gespeicherte Seiten Lebensdauer
ru: Время жизни страниц в кеше

source: The time in hours for close pages from cache by inactive. For zero time pages will not closed.
de: Die Zeit in Stunden für eine enge Seiten aus dem Cache von inaktiv. Für den Zeitpunkt Null Seiten werden nicht geschlossen.
ru: Время указано в часах, которое определяет интервал не активности для закрытия страниц в кеше. Нулевое значение времени исключает закрытие страниц в кеше.

source: Run projects list
de: Liste von aktivierten Projekten
ru: Перечень запускаемых проектов

source: Automatic started project's list separated by symbol ';'. For opening a project's window to need display (1) use project's name format: 'PrjName-1'.
de: Liste der automatisch gestarteten Projekte, getrennt mit dem Symbol ';'. Für das Laden eines Projektfensters (1) verwenden Sie den Namen des Projekts im Format: 'PrjName-1'.
ru: Перечень автоматически запускаемых проектов, разделённый символом ';'. Для открытия окна проекта на нужном дисплее (1) используйте имя проекта в формате: 'PrjName-1'.

source: Run projects status display
de: Zeigt den Status von aktivierten Projekten
ru: Отображение статуса запускаемых проектов

source: Exit on last run project close
de: Beenden, wenn der letzte der Ablauf des Projekts
ru: Выход при закрытии последнего исполняющегося проекта

source: Go to remote stations list configuration
de: Konfiguration der entfernten Stationen
ru: Переход к конфигурации перечня удалённых станций

source: Alarms
de: Störungen
ru: Нарушения

source: Play command
de: Play Kommando
ru: Команда проигрывания

source: Command line for call sounds play. Use %f for source file name inserting. If source file is not used play sample is sent to pipe.
de: Kommandozeile für Wiedergabe des Tons. Verwenden Sie %f für Dateinamen. Falls Dateiname nicht verwendet wird, werden die Dateien in den Kanal gesendet.
ru: Командная строка для вызова проигрывания звука. Используйте %f для вставки имени файла источника. Если файл источника не указан то данные направляются в канал.

source: Options help
de: Optionen Hilfe
ru: Помощь по опциям

source: OpenSCADA Vision developing: %s
de: OpenSCADA Vision-Entwicklung: %s
ru: OpenSCADA Vision-разработка: %s

source: Full screen toggle
de: Umschalten Vollbild
ru: Переключатель режима "На весь экран"

source: The button for full screen toggle
de: Schaltfläche zum Umschalten des Vollbilds
ru: Кнопка для переключения режима "На весь экран"

source: Press for toggle full screen.
de: Betätigen zum Umschalten des Vollbilds.
ru: Нажать для переключения режима "На весь экран".

source: Close Vision window
de: Schliessen des Fensters Vision
ru: Закрытие окна Vision

source: The button for closing Vision developing window
de: Schaltfläche zum Schliessen des Entwicklungsfensters Vision
ru: Кнопка для закрытия окна разработки Vision

source: Press to close the current Vision developing window.
de: Betätigen zum Schliessen des Entwicklungsfensters Vision
ru: Нажать для закрытия окна разработки Vision

source: Quit from OpenSCADA
de: Beenden von OpenSCADA
ru: Выход из OpenSCADA

source: The button for full quit from OpenSCADA
de: Schaltfläche für das Beenden von OpenSCADA
ru: Кнопка для полного выхода из OpenSCADA

source: Press for full quit from OpenSCADA system.
de: Betätigen um OpenSCADA zu beenden
ru: Нажать для полного выхода из OpenSCADA

source: The button for display the program and OpenSCADA information
de: Schaltfläche Informationen über OpenSCADA-
ru: Кнопка для получения информации о программе и OpenSCADA

source: Press to display the program and OpenSCADA information.
de: Betätigen um Informationen über OpenSCADA zu erhalten.
ru: Нажать для получения информации о программе и OpenSCADA.

source: The button for getting the using QT information
de: Schaltfläche für Informationen über QT
ru: Кнопка для получения информации о Qt

source: Press to get the using QT information.
de: Betätigen um Informationen über QT zu erhalten.
ru: Нажать для получения информации о Qt

source: %1 manual
de: %1 Handbuch
ru: %1 руководство

source: The button for getting the using %1 manual
de: Schaltfläche für %1 Handbuch
ru: Кнопка для получения руководства %1

source: Press to get the using %1 manual.
de: Betätigen um %1 Handbuch.
ru: Нажать для получения руководства %1.

source: The button for question about GUI elements
de: Schaltfläche für Informationen über die Benutzerschnittstelle
ru: Кнопка для запроса информации о GUI элементах

source: Get respond about user interface elements
de: Hilfe über die Elemente der Benutzerschnittstelle
ru: Запрос информации о GUI элементах

source: Press to respond about user interface elements.
de: Betätigen um Informationen über die Benutzerschnittstelle zu erhalten
ru: Нажать для запроса информации о GUI элементах.

source: Load item data from DB
de: Elemente aus der Datenbank laden
ru: Загрузка данных элемента из БД

source: The button for loading item data from DB
de: Schaltfläche für das Laden der Elemente aus der Datenbank
ru: Кнопка для загрузки данных элемента из БД

source: Press to load item data from DB.
de: Betätigen um die Elemente aus der Datenbank zu laden.
ru: Нажать для загрузки данных элемента из БД.

source: Save item data to DB
de: Elemente in die Datenbank speichern
ru: Сохранение данных элемента в БД

source: The button for saving item data to DB
de: Schaltfläche für das Speichern der Elemente in die Datenbank
ru: Кнопка для сохранения данных элемента в БД

source: Press to save item data to DB.
de: Betätigen um die Elemente in die Datenbank zu speichern.
ru: Нажать для сохранения данных элемента в БД

source: Run project execution
de: Projekt starten
ru: Запустить исполнение проекта

source: Run project execution for selected item
de: Starten des Projekts, für das ausgewählte Element
ru: Запуск исполнения проекта, для выбранного элемента

source: The button for running project execution for selected item
de: Schaltfläche zum Starten des Projekts, für das ausgewählte Element
ru: Кнопка для запуска исполнения проекта, для выбранного элемента

source: Press to run project execution for selected item.
de: Betätigen zum Starten des Projekts, für das ausgewählte Element
ru: Нажать для запуска исполнения проекта, для выбранного элемента

source: New project create
de: Neues Projekt erstellen
ru: Создание нового проекта

source: The button for creation of the new project
de: Schaltfläche zum Erstellen des neuen Projekts
ru: Кнопка для создания нового проекта

source: Press to create the new project.
de: Betätigen, um ein neues Projekt zu erstellen.
ru: Нажать для создания нового проекта.

source: New widgets library creation
de: Erstellen der Widgetsbibliothek
ru: Создание новой библиотеки

source: The button for creation of the new widgets library
de: Schaltfläche zum Erstellen der neuen Bibliothek
ru: Кнопка для создания новой библиотеки

source: Press to create the new widgets library.
de: Betätigen um die neue Bibliothek zu erstellen.
ru: Нажать для создания новой библиотеки.

source: Add visual item into library, container widget, project or page
de: Hinzufügen des Elements in die Bibliothek, den Widgetscontainer, das Projekt oder die Seite
ru: Добавление визуального элемента в библиотеку, контейнер виджетов, проект или страницу

source: The button for addition of the visual item into library, container widget, project or page
de: Schaltfläche zum Hinzufügen des Elements in die Bibliothek, den Widgetscontainer, das Projekt oder die Seite
ru: Кнопка для добавления визуального элемента в библиотеку, контейнер виджетов, проект или страницу

source: Press to add visual item into library, container widget, project or page.
de: Betätigen zum Hinzufügen des Elements in die Bibliothek, den Widgetscontainer,das Projekt oder die Seite .
ru: Нажать для добавления визуального элемента в библиотеку, контейнер виджетов, проект или страницу.

source: Delete visual item from library, container widget, project or page
de: Löschen des Elements aus der Bibliothek, dem Widgetscontainer, dem Projekt oder der Seite
ru: Удаление визуального элемента из библиотеки, контейнера виджетов, проекта или страницы

source: The button for deleting visual item from library, container widget, project or page
de: Schaltfläche zum Löschen des Elements aus der Bibliothek, dem Widgetscontainer, dem Projekt oder der Seite
ru: Кнопка для удаления визуального элемента из библиотеки, контейнера виджетов, проекта или страницы

source: Press to delete visual item from library, container widget, project or page.
de: Betätigen zum Löschen des Elements aus der Bibliothek, dem Widgetscontainer, dem Projekt oder der Seite.
ru: Нажать для удаления визуального элемента из библиотеки, контейнера виджетов, проекта или страницы.

source: Visual item properties
de: Eigenschaften des Elements
ru: Свойства визуального элемента

source: Get visual item properties
de: Laden der Eigenschaften des Elements
ru: Получение свойств визуального элемента

source: The button for getting the visual item properties
de: Schaltfläche für die Eigenschaften des Elements
ru: Кнопка для получения свойств визуального элемента

source: Press to get the visual item properties.
de: Betätigen für die Eigenschaften des Elements.
ru: Нажать для получения свойств визуального элемента.

source: Visual item edit
de: Element bearbeiten
ru: Редактировать визуальный элемент

source: Goes visual item edit
de: Zum Bearbeiten des Elementes
ru: Переход к редактированию визуального элемента

source: The button for going to visual item edition
de: Schaltfläche zum Bearbeiten des Elements
ru: Кнопка для перехода к редактированию визуального элемента

source: Press to go to visual item edition.
de: Betätigen um Element zu bearbeiten.
ru: Нажать для перехода к редактированию визуального элемента.

source: Visual item changes clear
de: Änderungen zurücksetzen
ru: Очистить изменения визуального элемента

source: Goes visual item changes clear
de: Zum Zurücksetzen der Änderungen
ru: Переход к очистке изменений визуального элемента

source: The button for going to visual item changes clear
de: Schaltfläche zum Zurücksetzen der Änderungen
ru: Кнопка для перехода к очистке изменений визуального элемента

source: Press to go to visual item changes clear.
de: Betätigen zum Zurücksetzen der Änderungen.
ru: Нажать для перехода к очистке изменений визуального элемента.

source: Visual item changes UnDo
de: Visuelle Element Änderungen rückgängig
ru: Откат изменений визуального элемента

source: Make visual item changes UnDo:
de: Machen Sie visuelle Element Änderungen rückgängig:
ru: Выполнение отката изменений визуального элемента:

source: The button for making visual item changes UnDo
de: Schaltfläche zum machen Sie visuelle Element Änderungen rückgängig
ru: Кнопка для выполнения отката изменений визуального элемента

source: Press to make visual item changes UnDo.
de: Betätigen zum machen Sie visuelle Element Änderungen rückgängig.
ru: Нажать для выполнения отката изменений визуального элемента.

source: Visual item changes ReDo
de: Visuelle Element ändert wiederholen Sie
ru: Повтор изменений визуального элемента

source: Make visual item changes ReDo:
de: Machen Sie visuelle Element ändert wiederholen Sie:
ru: Выполнить повтор изменений визуального элемента:

source: The button for making visual item changes ReDo
de: Schaltfläche zum machen Sie visuelle Element ändert wiederholen Sie
ru: Кнопка для выполнения повтора изменений визуального элемента

source: Press to make visual item changes ReDo.
de: Betätigen zum machen Sie visuelle Element ändert wiederholen Sie.
ru: Нажать для выполнения повтора изменений визуального элемента.

source: Visual item cut
de: Element ausschneiden
ru: Вырезать визуальный элемент

source: Make visual item cut
de: Ausschneiden des Elements
ru: Выполнение вырезания визуального элемента

source: The button for making visual item cut
de: Schaltfläche zum Ausschneiden des Elements
ru: Кнопка для выполнения вырезания визуального элемента

source: Press to make visual item cut.
de: Betätigen zum Ausschneiden des Elements.
ru: Нажать для выполнения вырезания визуального элемента.

source: Visual item copy
de: Element kopieren
ru: Копировать визуальный элемент

source: Make visual item copy
de: Kopieren des Elements
ru: Выполнение копирования визуального элемента

source: The button for making visual item copy
de: Schaltfläche zum Kopieren des Elements
ru: Кнопка для выполнения копирования визуального элемента

source: Press to make visual item copy.
de: Betätigen zum Kopieren des Elements.
ru: Нажать для выполнения копирования визуального элемента.

source: Visual item paste
de: Element einfügen
ru: Вставить визуальный элемент

source: Make visual item paste
de: Einfügen des Elements
ru: Выполнить вставку визуального элемента

source: The button for making visual item paste
de: Schaltfläche zum Einfügen des Elements
ru: Кнопка для выполнения вставки визуального элемента

source: Press to make visual item paste.
de: Betätigen zum Einfügen des Elements.
ru: Нажать для выполнения вставки визуального элемента.

source: Up widget
de: Widget an den Anfang verschieben
ru: Поднять виджет

source: Raise selected widget to the top
de: Verschieben ausgewählten Widget an den Anfang
ru: Поднятие выбранного виджета на самый верх

source: The button for raising the selected widget to the top
de: Schaltfläche zum Verschieben des ausgewählten Widgets an den Anfang
ru: Кнопка для поднятия выбранного виджета на самый верх

source: Press to raise the selected widget to the top.
de: Betätigen zum Verschieben des ausgewählten Widgets an den Anfang.
ru: Нажать для поднятия выбранного виджета на самый верх.

source: Down widget
de: Widget ans Ende verschieben
ru: Опустить виджет

source: Down selected widget to the bottom
de: Verschieben ausgewählten Widget ans Ende
ru: Опускание выбранного виджета на самый низ

source: The button for downing the selected widget to the bottom
de: Schaltfläche zum Verschieben des ausgewählten Widgets ans Ende
ru: Кнопка для опускания выбранного виджета на самый низ

source: Press to down the selected widget to the bottom.
de: Betätigen zum Verschieben des ausgewählten Widgets ans Ende.
ru: Нажать для опускания выбранного виджета на самый низ.

source: Rise widget
de: Widget nach oben
ru: Виджет вверх

source: Raise selected widget
de: Verschieben den ausgewählten Widget nach oben
ru: Поднятие выбранного виджета

source: The button for raising the selected widget
de: Schaltfläche zum Verschieben des ausgewählten Widgets nach oben
ru: Кнопка для поднятия виджета

source: Press to raise the selected widget.
de: Betätigen zum Verschieben des ausgewählten Widgets nach oben.
ru: Нажать для поднятия виджета.

source: Lower widget
de: Widget nach unten
ru: Виджет вниз

source: Down selected widget
de: Verschieben ausgewählten Widget nach unten
ru: Опускание выбранного виджета

source: The button for downing the selected widget
de: Schaltfläche zum Verschieben des ausgewählten Widgets nach unten
ru: Кнопка для опускания выбранного виджета

source: Press to down the selected widget.
de: Betätigen zum Verschieben des ausgewählten Widgets nach unten.
ru: Нажать для опускания выбранного виджета.

source: Align to left
de: Links ausrichten
ru: Выравнять слева

source: Align selected widgets to the left
de: Ausrichten der ausgewählten Widgets links
ru: Выравнивание выбранных виджетов слева

source: The button for alignment of selected widgets to the left
de: Schaltfläche für Ausrichtung der ausgewählten Widgets links
ru: Кнопка для выравнивания выбранных виджетов слева

source: Press to align selected widgets to the left.
de: Betätigen für Ausrichtung der ausgewählten Widgets links.
ru: Нажать для выравнивания выбранных виджетов слева.

source: Align to vertical center
de: Zur senkrechten Mitte ausrichten
ru: Выравнять по центру вертикально

source: Align selected widgets to the vertical center
de: Ausrichten der ausgewählten Widgets zur senkrechten Mitte
ru: Выравнивание выбранных виджетов по центру вертикально

source: The button for alignment of selected widgets to the vertical center
de: Schaltfläche für Ausrichtung der ausgewählten Widgets zur senkrechten Mitte
ru: Кнопка для выравнивания выбранных виджетов по центру вертикально

source: Press to align selected widgets to the vertical center.
de: Betätigen für Ausrichtung der ausgewählten Widgets zur senkrechten Mitte.
ru: Нажать для выравнивания выбранных виджетов по центру вертикально.

source: Align to right
de: Rechts ausrichten
ru: Выравнять справа

source: Align selected widgets to the right
de: Ausrichten der ausgewählten Widgets rechts
ru: Выравнивание выбранных виджетов справа

source: The button for alignment of selected widgets to the right
de: Schaltfläche für Ausrichtung der ausgewählten Widgets rechts
ru: Кнопка для выравнивания выбранных виджетов справа

source: Press to align selected widgets to the right.
de: Betätigen für Ausrichtung der ausgewählten Widgets rechts.
ru: Нажать для выравнивания выбранных виджетов справа.

source: Align to top
de: Oben ausrichten
ru: Выравнять сверху

source: Align selected widgets to the top
de: Ausrichten der ausgewählten Widgets oben
ru: Выравнивание выбранных виджетов сверху

source: The button for alignment of selected widgets to the top
de: Schaltfläche für Ausrichtung der ausgewählten Widgets oben
ru: Кнопка для выравнивания выбранных виджетов сверху

source: Press to align selected widgets to the top.
de: Betätigen für Ausrichtung der ausgewählten Widgets oben.
ru: Нажать для выравнивания выбранных виджетов сверху.

source: Align to horizontal center
de: Zur waagerechten Mitte ausrichten
ru: Выравнять по центру горизонтально

source: Align selected widgets to the horizontal center
de: Ausrichten der ausgewählten Widgets zur waagerechten Mitte
ru: Выравнивание выбранных виджетов по центру горизонтально

source: The button for alignment selected widgets to the horizontal center
de: Schaltfläche fur Ausrichtung der ausgewählten Widgets zur waagerechten Mitte
ru: Кнопка для выравнивания выбранных виджетов по центру горизонтально

source: Press to align selected widgets to the horizontal center.
de: Betätigen fur Ausrichtung der ausgewählten Widgets zur waagerechten Mitte.
ru: Нажать для выравнивания выбранных виджетов по центру горизонтально.

source: Align to bottom
de: Unten ausrichten
ru: Выравнять снизу

source: Align selected widgets to the bottom
de: Ausrichten der ausgewählten Widgets unten
ru: Выравнивание выбранных виджетов снизу

source: The button for alignment selected widgets to the bottom
de: Schaltfläche für Ausrichtung der ausgewählten Widgets unten
ru: Кнопка для выравнивания выбранных виджетов снизу

source: Press to align selected widgets to the bottom.
de: Betätigen für Ausrichtung der ausgewählten Widgets unten.
ru: Нажать для выравнивания выбранных виджетов снизу.

source: Cursor
ru: Курсор

source: Unset cursor
de: Rückstellung des Cursors
ru: Возврат курсора

source: The button for unset cursor
de: Schaltfläche zum Rückstellen des Cursormodus
ru: Кнопка для возврата режима курсора

source: Press to unset cursor
de: Betätigen zum Rückstellen des Cursormodus
ru: Кнопка для возврата режима курсора

source: Add line to elementary figure
de: Hinzufügen einer Linie zur elementaren Figur
ru: Добавление линии к элементарной фигуре

source: The button for adding line to elementary figure
de: Schaltfläche zum Hinzufügen einer Linie zur elementaren Figur
ru: Кнопка для добавления линии к элементарной фигуре

source: Press to add line to elementary figure.
de: Betätigen zum Hinzufügen einer Linie zur elementaren Figur.
ru: Нажать для добавления линии к элементарной фигуре.

source: Add arc to elementary figure
de: Einen Bogen zur elementaren Figur hinzufügen
ru: Добавление дуги к элементарной фигуре

source: The button for adding arc to elementary figure
de: Schaltfläche zum Hinzufügen eines Bogens zur elementaren Figur
ru: Кнопка для добавления дуги к элементарной фигуре

source: Press to add arc to elementary figure.
de: Betätigen zum Hinzufügen eines Bogens zur elementaren Figur.
ru: Нажать для добавления дуги к элементарной фигуре.

source: Add Besier curve to elementary figure
de: Hinzufügen des Besie-Bogens zur elementaren Figur
ru: Добавление кривой Безье к элементарной фигуре

source: The button for adding Besier curve to elementary figure
de: Schaltfläche zum Hinzufügen des Besie-Bogens zur elementaren Figur
ru: Кнопка для добавления кривой Безье к элементарной фигуре

source: Press to add Besier curve to elementary figure.
de: Betätigen zum Hinzufügen des Besie-Bogens zur elementaren Figur.
ru: Нажать для добавления кривой Безье к элементарной фигуре.

source: Enable connections
de: Verbindungen einschalten
ru: Включение привязок

source: The button for enabling connections
de: Schaltfläche zum Einschalten der Verbindungen
ru: Кнопка для включения привязок

source: Press to enable connections
de: Betätigen zum Einschalten der Verbindungen
ru: Включение привязок

source: Close active window
de: Schließen des aktiven Fensters
ru: Закрытие активного окна
