Repository: aleax/openscada
Catalog: src/moduls/ui/Vision/po/*.po
Languages: de, ru, uk

source: Elementary figure tools
uk: Інструменти елементарної фігури

source: This label displays the current user.
uk: Це маркування показує поточного користувача.

source: Field for displaying the current user.
uk: Поле відображення поточного користувача.

source: Double click to change the user.
uk: Подвійно клікнути для зміни користувача.

source: This label displays the used VCA engine station.
uk: Це маркування показує використану станцію рушія СВУ.

source: Field for displaying the used VCA engine station.
uk: Поле відображення використаної станції рушія СВУ.

source: This label displays the widgets scaling mode.
uk: Це маркування показує поточний режим масштабування віджетів.

source: Field for displaying the widgets scaling mode.
uk: Поле відображення поточного режиму масштабування віджетів.

source: Click to change the widgets scaling mode.
uk: Натиснути для зміни режиму масштабування віджетів.

source: This label indicates the fact of making changes.
uk: Це маркування показує факт внесення змін.

source: Field for indicating the fact of making changes.
uk: Поле відображення факту внесення змін.

source: Click to save all the made changes.
uk: Натиснути для збереження всіх внесених змін.

source: This label displays the current widget scale.
uk: Це маркування показує поточний масштаб віджету.

source: Field for displaying the current widget scale.
uk: Поле відображення поточного масштабу віджету.

source: Dock window of the projects manager.
uk: Плаваюче вікно менеджеру проєктів.

source: Dock window of the manager of the widgets libraries.
uk: Плаваюче вікно менеджеру бібліотек віджетів.

source: Dock window of the inspector ot the widget attributes.
uk: Плаваюче вікно інспектору атрибутів віджета.

source: Dock window of the inspector ot the widget links.
uk: Плаваюче вікно інспектору посилань віджета.

source: Icons size
de: Icons Größe
ru: Размер иконок
uk: Розмір іконок

source: Small (16x16)
de: Klein (16x16)
ru: Малые (16x16)
uk: Малі (16x16)

source: Medium (22x22)
de: Mittel (22x22)
ru: Средние (22x22)
uk: Середні (22x22)

source: Big (32x32)
ru: Большие (32x32)
uk: Великі (32x32)

source: Huge (48x48)
de: Zu groß (48x48)
ru: Очень большие (48x48)
uk: Дуже великі (48x48)

source: Saving of the visual items
uk: Збереження візуальних елементів

source: Some visual items have been changed. Save the changes to the DB before exiting?
uk: Деякі візуальні елементи було змінено. Зберегти зміни у БД перед виходом?

source: %1 v%2. %3 Author: %4 License: %5 %6 v%7. %8 License: %9 Author: %10 Web site: %11
uk: %1 v%2. %3 Автор: %4 Ліцензія: %5 %6 v%7. %8 Ліцензія: %9 Автор: %10 Web сайт: %11

source: Manual
uk: Підручник

source: The manual '%1' was not found offline or online!
uk: Не знайдено підручника '%1' локально або віддалено!

source: Are you sure of loading visual items '%1' from the DB?
uk: Ви дійсно бажаєте завантажити візуальні елементи '%1' з БД?

source: Loading the visual items data from the DB
uk: Завантаження даних візуальних елементів з БД

source: Are you sure of saving all modifications to the DB?
uk: Ви дійсно бажаєте зберегти всі зміни у БД?

source: Are you sure of saving the visual items '%1' to the DB?
uk: Ви дійсно бажаєте зберегти візуальні елементи '%1' у БД?

source: Saving the visual items data to the DB
uk: Збереження даних візуальних елементів у БД

source: Enter the identifier and the name of the new project.
uk: Введіть ідентифікатор та ім'я нового проєкта.

source: Enter the identifier and the name of the new widgets library.
uk: Введіть ідентифікатор та ім'я нової бібліотеки віджетів.

source: Enter the identifier and the name of the new widget/page.
uk: Введіть ідентифікатор та ім'я нового віджета/сторінки.

source: Creating a widget/page
uk: Створення віджету/сторінки

source: Are you sure of deleting the visual items: '%1'?
uk: Ви дійсно бажаєте видалити візуальні елементи '%1'?

source: Deleting the visual items
uk: Видалення візуальних елементів

source: The widget '%1' editing window is already open.
uk: Вікно редагування віджету '%1' вже відкрито.

source: Are you sure of clear all changes of the visual items: '%1'? All changes will be lost and values will return to the previous state or will be inherited!
uk: Ви дійсно бажаєте очищення всіх змін візуальних елементів: '%1'? Всі зміни буде втрачено та значення повернуться до попереднього стану або будуть успадковані!

source: Are you sure for lowering down to the parent for all changes of the visual items '%1'? All other visual elements, descendant from this ancestor, will use these changes!
uk: Ви дійсно бажаєте опустити предку всі зміни візуальних елементів '%1'? Всі інші візуальні елементи, нащадки від даного предку, будуть використовувати ці зміни!

source: Moving or copying the visual items
uk: Переміщення або копіювання візуальних елементів

source: Moving the project '%1'.
uk: Переміщення проєкту '%1'.

source: Copying the project '%1'.
uk: Копіювання проєкту '%1'.

source: Moving the widgets library '%1'.
uk: Переміщення бібліотеки віджетів '%1'.

source: Copying the widgets library '%1'.
uk: Копіювання бібліотеки віджетів '%1'.

source: Moving the page '%1' to '%2'.
uk: Переміщення сторінки '%1' до '%2'.

source: Copying the page '%1' to '%2'.
uk: Копіювання сторінки '%1' до '%2'.

source: Moving the widget '%1' to '%2'.
uk: Переміщення віджету '%1' до '%2'.

source: Copying the widget '%1' to '%2'.
uk: Копіювання віджету '%1' до '%2'.

source: Enter the identifier and the name of the new widget.
uk: Введіть ідентифікатор та ім'я нового віджета.

source: As a page:
uk: Як сторінка:

source: Copy/move scheme from '%1' to '%2' is not supported.
de: Kopieren / Verschieben des Schemas von '%1' nach '%2' wird nicht unterstützt.
ru: Схема копирования/перемещения из '%1' в '%2' не поддерживается.
uk: Схема копіювання/переміщення з '%1' до '%2' не підтримується.

source: Inherit:
de: Vererben:
ru: Наследовать:
uk: Наслідувати:

source: The target item '%1' is already present! Paste to it anyway?
uk: Цільовий елемент '%1' вже присутній! Всеодно вставити до нього?

source: Attempting to copy/move yourself for "%1/%1"!
uk: Спроба копіювання/переміщення у самого себе для "%1/%1"!

source: Properties of the widgets library
uk: Властивості бібліотеки віджетів

source: The button for getting the item manual
uk: Кнопка отримання підручника елементу

source: Widgets library
de: Widgetsbibliothek
ru: Библиотека виджетов
uk: Бібліотека віджетів

source: State
de: Zustand
ru: Состояние
uk: Стан

source: Status:
uk: Статус:

source: Enabled:
de: Eingeschaltet:
ru: Включен:
uk: Ввімкнено:

source: Container DB:
de: Datenbank des Containers:
ru: БД контейнера:
uk: БД контейнера:

source: Configuration
de: Konfiguration
ru: Конфигурация
uk: Конфігурація

source: Identifier:
uk: Ідентифікатор:

source: Name:
ru: Имя:
uk: Ім'я:

source: Description:
de: Beschreibung:
ru: Описание:
uk: Опис:

source: Owner, group:
de: Besitzer, Gruppe:
ru: Владелец, группа:
uk: Власник, група:

source: Access:
de: Zugang:
ru: Доступ:
uk: Доступ:

source: Period of the calculating, milliseconds:
uk: Період обчислення, мілісекунд:

source: Resources
uk: Ресурси

source: Identifier
uk: Ідентифікатор

source: Data size
de: Datengrösse
ru: Размер данных
uk: Розмір даних

source: Add record
de: Datensatz hinzufügen
ru: Добавить запись
uk: Додати запис

source: Delete record
de: Datensatz löschen
ru: Удалить запись
uk: Видалити запис

source: Load data
de: Daten laden
ru: Загрузить данные
uk: Завантажити дані

source: Unload data
de: Daten leeren
ru: Выгрузить данные
uk: Вивантажити дані

source: Styles
de: Styl
ru: Стили
uk: Стилі

source: Style:
de: Stil:
ru: Стиль:
uk: Стиль:

source: Erase style
de: Erase Stil
ru: Удалить стиль
uk: Видалити стиль

source: Value
de: Wert
ru: Значение
uk: Значення

source: Diagnostics
uk: Діагностика

source: Time:
uk: Час:

source: Refresh
uk: Оновити

source: Size:
de: Grösse:
ru: Размер:
uk: Розмір:

source: Time
uk: Час

source: mcsec
de: msek
ru: мкс
uk: мкс

source: Category
de: Kategorie
ru: Категория
uk: Категорія

source: Level
de: Stufe
ru: Уровень
uk: Рівень

source: Message
de: Nachricht
ru: Сообщение
uk: Повідомлення

source: Error getting the node '%1' information.
uk: Помилка запиту інформації вузла '%1'.

source: Save image
uk: Зберегти зображення

source: Load image
uk: Завантажити зображення

source: Clear image
uk: Очистити зображення

source: Saving the picture
uk: Збереження картинки

source: Images (*.png *.xpm *.jpg)
de: Bilder (*.png *.xpm *.jpg)
ru: Изображения (*.png *.xpm *.jpg)
uk: Зображення (*.png *.xpm *.jpg)

source: Error saving to the file '%s'.
uk: Помилка збереження у файл '%s'.

source: Loading the picture
uk: Завантаження картинки

source: Images (*.png *.jpg)
de: Bilder (*.png *.jpg)
ru: Изображения (*.png *.jpg)
uk: Зображення (*.png *.jpg)

source: Error loading the picture '%s'.
uk: Помилка завантаження картинки '%s'.

source: Saving the changes
uk: Збереження змін

source: Some changes were made! Save the changes to the DB before the closing?
uk: Здійснено деякі зміни! Зберегти зміни у БД перед закриттям?

source: No rows selected.
uk: Жодного рядку не обрано.

source: Are you sure of loading data to selected item '%1'?
uk: Ви дійсно бажаєте завантажити дані до обраного елементу '%1'?

source: Loading the data
uk: Завантаження модуля.

source: All files (*.*)
de: Alle Dateien (*.*)
ru: Все файлы (*.*)
uk: Всі файли (*.*)

source: Error opening the file '%1': %2
uk: Помилка відкриття файлу '%1': %2

source: The download file '%1' is very large.
uk: Завантажуванний файл '%1' дуже великий.

source: Saving the data
uk: Збереження даних

source: Error writing the data to the file '%1': %2
uk: Помилка запису даних до файлу '%1': %2

source: Properties of the widget
uk: Властивості віджету

source: Widget
ru: Виджет
uk: Віджет

source: Page type:
de: Seitentyp:
ru: Тип страницы:
uk: Тип сторінки:

source: Parent widget:
de: Elternwidget:
ru: Родительский виджет:
uk: Батьківський віджет:

source: Root:
ru: Корень:
uk: Корінь:

source: Path:
de: Pfad:
ru: Путь:
uk: Шлях:

source: Periodic processing, milliseconds:
uk: Періодичне опрацювання, мілісекунд:

source: Attributes
de: Attribute
ru: Атрибуты
uk: Атрибути

source: Widget process
de: Widgetsbearbeitung
ru: Обработка виджета
uk: Обробка віджету

source: Name
ru: Имя
uk: Ім'я

source: Data type
de: Datentyp
ru: Тип данных
uk: Тип даних

source: Work area
de: Arbeitsbereich
ru: Рабочая область
uk: Робоча ділянка

source: Processing
uk: Обробка

source: Configuration template
de: Konfigurationvorlage
ru: Конфигурационный шаблон
uk: Конфігураційний шаблон

source: Add attribute
de: Attribut hinzufügen
ru: Добавить атрибут
uk: Додати атрибут

source: Delete attribute
de: Attribut löschen
ru: Удалить атрибут
uk: Видалити атрибут

source: Procedure language:
de: Verfahrenssprache:
ru: Язык процедуры:
uk: Мова процедури:

source: Translate:
uk: Перекладати:

source: Links
ru: Связи
uk: Зв'язки

source: Are you sure of editing the inherited procedure, since that can cause for unexpectedly loss of the access to the original one?!
uk: Ви дійсно бажаєте редагувати успадковану процедуру, оскільки це може призвести до неочікуваної втрати доступу до оригінальної процедури?!

source: Editing an inherited procedure
uk: Редагування успадкованої процедури

source: Correct widget is not selected
uk: Не обрано коректного віджету

source: Correct attribute is not selected
uk: Не обрано коректного атрибуту

source: <Group>
de: <Gruppe>
ru: <Группа>
uk: <Група>

source: Attribute
de: Attribut
ru: Атрибут
uk: Атрибут

source: Copy
de: Kopieren
ru: Копировать
uk: Копіювати

source: Edit
de: Bearbeiten
ru: Редактировать
uk: Редагувати

source: Clear changes
de: Klare Veränderungen
ru: Очистить изменения
uk: Очистити зміни

source: Press to clear changes of the attribute.
uk: Натиснути для очищення змін атрибуту.

source: Lower the widget changes to its parent
uk: Опустити зміни віджету до предку

source: Press for lowering the widget changes to its parent.
uk: Натиснути для опущення змін віджету до предку.

source: Full-text editing of the attribute.
uk: Повнотекстове редагування атрибуту.

source: Editing the attribute '%1' for the widget '%2'.
uk: Редагування атрибуту '%1' для віджета '%2'.

source: Short help to describe the syntax of the text.
uk: Коротка допомога для опису синтаксису текста.

source: Are you sure for lowering down to the parent for the selected attribute '%1' change of the visual item '%2'? At missing the visual item will be created in the parent and all other visual elements, descendant from this ancestor, will use this!
uk: Ви дійсно бажаєте опустити предку зміни обраного атрибуту '%1' візуального елементу '%1'? За відсутності цей візуальний елемент буде створено у предка та всі інші візуальні елементи, нащадки від даного предку, будуть використовувати його!

source: Lowering down the selected attribute change of the visual item to the parent
uk: Опущення зміни обраного атрибуту візуального елементу до предку

source: Widgets
de: Widget
ru: Виджет
uk: Віджети

source: Type
de: Typ
ru: Тип
uk: Тип

source: Library
de: Bibliothek
ru: Библиотека
uk: Бібліотека

source: Library: %1
de: Bibliothek: %1
ru: Библиотека: %1
uk: Бібліотека: %1

source: Adding a widget based on '%1'
uk: Додання віджету заснованого на '%1'

source: The button for adding a widget based on '%1'
uk: Кнопка додання віджету заснованого на '%1'

source: Press for adding a widget based on '%1'.
uk: Натиснути для додання віджету заснованого на '%1'.

source: Container widget
uk: Віджет контейнеру

source: Time of loading the widgets development tree '%s': %f ms.
uk: Час завантаження дерева розробки віджетів '%s': %f мс.

source: ... from the Library
uk: ... з Бібліотеки

source: Refresh libraries
de: Bibliotheken aktualisieren
ru: Обновить библиотеки
uk: Оновити бібліотеки

source: Press to refresh the present libraries.
uk: Натиснути для оновлення наявних бібліотек.

source: Projects
de: Projekte
ru: Проекты
uk: Проєкти

source: Project
de: Projekt
ru: Проект
uk: Проєкт

source: Page
de: Seite
ru: Страница
uk: Сторінка

source: Refresh projects
de: Projekte aktualisieren
ru: Обновить проекты
uk: Оновити проєкти

source: Press to refresh the present projects.
uk: Натиснути для оновлення наявних проєктів.

source: Scale
de: Maßstab
ru: Масштаб
uk: Масштаб

source: Resize
de: Größe ändern
ru: Изм. размера
uk: Зміна розміру

source: WARNING! The widget is already set up for editing.
uk: Увага! Віджет вже встановлено до редагування.

source: Exit the widget editing
uk: Вихід з редагування віджету

source: Press to exit the widget editing.
uk: Натиснути для виходу з редагування віджету.

source: Enter the widget editing
uk: Вхід до редагування віджету

source: Press to enter the widget editing.
uk: Натиснути для входу до редагування віджету.

source: Make up an icon from the widget
uk: Створити іконку з віджета

source: Press to make up an icon from the widget.
uk: Натиснути для створення іконки з віджета.

source: Make up an image from the widget
uk: Створити зображення з віджету

source: Press to make up an image from the widget.
uk: Натиснути для створення зображення з віджету.

source: Zoom in (+10%)
de: Vergrössern (+10%)
ru: Увеличить (+10%)
uk: Збільшити (+10%)

source: Press to increase the visual scale of the widget by 10%.
de: Betätigen um Massstab um 10% zu vergrössern.
ru: Нажмите для того, чтобы увеличить визуальный масштаб на 10%.
uk: Натисніть, щоб збільшити візуальний масштаб віджету на 10%.

source: Zoom out (-10%)
de: Verkleinern (-10%)
ru: Уменьшить (-10%)
uk: Зменшити (-10%)

source: Press to decrease the visual scale of the widget by 10%.
de: Betätigen um Massstab um 10% zu verkleinern.
ru: Нажмите для того, чтобы уменьшить визуальный масштаб на 10%.
uk: Натисніть, щоб зменшити візуальний масштаб віджету на 10%.

source: Reset the zoom (100%)
uk: Скинути масштаб (100%)

source: Press to reset the visual scale of the widget to 100%.
uk: Натисніть для встановлення візуального масштабу віджету у 100%.

source: Saving the widget image
uk: Збереження зображення віджету

source: Error saving to the file '%1'.
uk: Помилка збереження у файл '%1'.

source: Selected elements --- xy(%2:%3) wh[%4:%5]
de: Ausgewählt sind die Elemente --- xy(%2:%3) wh[%4:%5]
ru: Выбраны элементы --- xy(%2:%3) шв[%4:%5]
uk: Вибрані елементи --- xy(%2:%3) шв[%4:%5]

source: Page: '%1' --- xy(%2:%3) wh[%4:%5]
de: Seite: '%1' --- xy(%2:%3) wh[%4:%5]
ru: Страница: '%1' --- xy(%2:%3) шв[%4:%5]
uk: Сторінка: '%1' --- xy(%2:%3) шв[%4:%5]

source: ... more items (%d)
de: ... mehr Elemente (%d)
ru: ... больше пунктов (%d)
uk: ... більше пунктів (%d)

source: geometry
de: Geometrie
ru: геометрия
uk: геометрія

source: attribute '%s'
ru: атрибут '%s'
uk: атрибут '%s'

source: new widget '%s' from '%s'
de: neues Widget '%s' von '%s'
ru: новый виджет '%s' от '%s'
uk: новий віджет '%s' від '%s'

source: remove widget
de: entfernen Widget
ru: удаление виджета
uk: видалення віджету

source: copy past widget '%s' from '%s'
de: Kopie vergangenen Widget '%s' von '%s'
ru: копирование-вставка виджета '%s' из '%s'
uk: копіювання-вставка віджету '%s' з '%s'

source: unknown
de: unbekannt
ru: неизвестно
uk: невідомо

source: The widget is disabled or the widget shape is not supported!
uk: Віджет вимкнено або образ віджету не підтримується!

source: Selected elements: '%1'
de: Ausgewählt sind die Elemente: '%1'
ru: Выбраны элементы: '%1'
uk: Обрано елементи: '%1'

source: Cursor --- xy(%1:%2)
ru: Курсор --- xy(%1:%2)
uk: Курсор --- xy(%1:%2)

source: Session '%s(%s)' using the remote host %d times.
uk: Сеанс '%s(%s)' використовує віддалений хост %d рази.

source: Error connecting to the visualization server '%1': %2. The next recovery attempt after %3s!
uk: Помилка підключення до сервера візуалізації '%1': %2. Наступна спроба відновлення після %3с!

source: Scale of the root page [%f:%f].
uk: Масштаб кореневої сторінки [%f:%f].

source: Printing a page
uk: Друк сторінки

source: There is no page to print!
uk: Немає жодної сторінки для друку!

source: Select a page to print.
uk: Оберіть сторінку для друку.

source: Pages:
de: Seiten:
ru: Страницы:
uk: Сторінки:

source: Printing the page: "%1" (%2)
uk: Друк сторінки: "%1" (%2)

source: OpenSCADA project: "%1"
de: Projekt OpenSCADA: "%1"
ru: Проект OpenSCADA: "%1"
uk: Проєкт OpenSCADA: "%1"

source: User: "%1"
de: Benutzer: "%1"
ru: Пользователь: "%1"
uk: Користувач: "%1"

source: Printing a diagram
uk: Друк діаграми

source: There is no page!
uk: Немає жодної сторінки!

source: There is no diagram!
uk: Немає жодної діаграми!

source: Select a diagram to print.
uk: Оберіть діаграму для друку.

source: Diagrams:
de: Diagramme:
ru: Диаграммы:
uk: Діаграми:

source: Printing the diagram: "%1" (%2)
uk: Друк діаграми: "%1" (%2)

source: OpenSCADA project: "%1" %2 (%3)
de: Projekt OpenSCADA: "%1" %2 (%3)
ru: Проект OpenSCADA: "%1" %2 (%3)
uk: Проєкт OpenSCADA: "%1" %2 (%3)

source: User: "%1" %2
de: Benutzer: "%1" %2
ru: Пользователь: "%1" %2
uk: Користувач: "%1" %2

source: Printing a document
uk: Друк документа

source: There is no document!
uk: Немає жодного документа!

source: Select a document to print.
uk: Оберіть документ для друку.

source: Document:
de: Dokument:
ru: Документ:
uk: Документ:

source: Printing the document: "%1" (%2)
uk: Друк документа: "%1" (%2)

source: Exporting a page
uk: Експорт сторінки

source: There is no page for exporting!
uk: Немає жодної сторінки для експорту!

source: Select a page to export.
uk: Оберіть сторінку для експорту.

source: Saving the page image
uk: Збереження зображення сторінки

source: Exporting a diagram
uk: Експорт діаграми

source: Select a diagram to export.
uk: Оберіть діаграму для експорту.

source: Saving a diagram
uk: Збереження діаграми

source: Trend %1.png
ru: Тренд %1.png
uk: Тренд %1.png

source: Images (*.png *.xpm *.jpg);;CSV file (*.csv)
de: Bilder (*.png *.xpm *.jpg);;CSV-Datei (*.csv)
ru: Изображения (*.png *.xpm *.jpg);;CSV файл (*.csv)
uk: Зображення (*.png *.xpm *.jpg);;CSV файл (*.csv)

source: "Date and time";"us"
de: "Datum und Uhrzeit";"us"
ru: "Дата и время";"мкс"
uk: "Дата та час";"мкс"

source: Empty
uk: Порожньо

source: "Frequency (Hz)"
de: "Frequenz (Hz)"
ru: "Частота (Гц)"
uk: "Частота (Гц)"

source: Closing the file %d error '%s (%d)'!
uk: Помилка закриття файлу %d - '%s (%d)'!

source: Error writing to: %1.
uk: Помилка запису до: %1.

source: Exporting a document
uk: Експорт документа

source: Select a document to export.
uk: Оберіть документ для експорту.

source: Saving a document
uk: Збереження документа

source: Document %1.html
de: Dokument %1.html
ru: Документ %1.html
uk: Документ %1.html

source: XHTML (*.html);;CSV file (*.csv)
ru: XHTML (*.html);;CSV файл (*.csv)
uk: XHTML (*.html);;CSV файл (*.csv)

source: No data to export.
uk: Немає даних для експорту.

source: Exporting a table
uk: Експорт таблиці

source: There is no table!
uk: Немає жодної таблиці!

source: Select a table to export.
uk: Оберіть таблицю для експорту.

source: Table:
uk: Таблиця:

source: Saving a table
uk: Збереження таблиці.

source: Table %1.csv
uk: Таблиця %1.csv

source: CSV file (*.csv)
uk: CSV файл (*.csv)

source: Several sessions are already opened for the project "%1". You can create a new or connect to the present session. Please select the one you want or click "Cancel".
uk: Вже відкрито декілька сеансів для проєкту "%1". Ви можете створити новий сеанс або під'єднатися до існуючого. Будь ласка, оберіть потрібне або натисніть "Скасувати".

source: Selecting a session for connection or a new one creating
uk: Вибір сеансу для підключення або створення нового

source: <Create new session>
de: <Erstellen Sie eine neue Sitzung>
ru: <Создать новый сеанс>
uk: <Створити новий сеанс>

source: Running project: %1
de: Ausführen Projekt: %1
ru: Исполнение проекта: %1
uk: Виконання проєкту: %1

source: The button for closing the Vision runtime window
uk: Кнопка закриття вікна виконання Vision

source: Press to close of the current Vision runtime window.
de: Betätigen zum Schliessen des Ausführungsfensters Vision.
ru: Нажать для закрытия текущего окна исполнения Vision.
uk: Натиснути для закриття поточного вікна виконання Vision.

source: &Alarm
de: Stö&rung
ru: Н&арушение
uk: Порушення

source: &Print
de: &Drucken
ru: &Печать
uk: &Друк

source: Print the master page
de: Hauptseite drucken
ru: Печать главной страницы
uk: Друк головної сторінки

source: The button for printing the master page, by default
uk: Кнопка друку головної сторінки, по замовченню

source: Press for printing the master page, by default.
uk: Натиснути для друку головної сторінки, по замовченню.

source: Print the selected page
de: Ausgewählte Seite drucken
ru: Печать выбранной страницы
uk: Друк обраної сторінки

source: The button for printing the selected page
uk: Кнопка друку обраної сторінки

source: Press for printing the selected page.
uk: Натиснути для друку обраної сторінки.

source: Diagram
de: Diagramm
ru: Диаграмма
uk: Діаграма

source: Print the selected diagram
de: Drucken des ausgewählten Diagramms
ru: Печать выбранной диаграммы
uk: Друк обраної діаграми

source: The button for printing the selected diagram
uk: Кнопка друку обраної діаграми

source: Press for printing the selected diagram.
uk: Натиснути для друку обраної діаграми.

source: Document
de: Dokument
ru: Документ
uk: Документ

source: Print the selected document
de: Drucken des ausgewählten Dokuments
ru: Печать выбранного документа
uk: Друк обраного документу

source: The button for printing the selected document
uk: Кнопка друку обраного документу

source: Press for printing the selected document.
uk: Натиснути для друку обраного документу.

source: &Export
ru: &Экспорт
uk: &Експорт

source: Export the master page
de: Export der Hauptseite
ru: Экспорт главной страницы
uk: Експорт головної сторінки
