Repository: aleax/openscada
Catalog: src/moduls/arhiv/DBArch/po/*.po
Languages: ru, uk

source: Archiver on the DB
ru: Архиватор на БД
uk: Архіватор до БД

source: Roman Savochenko
ru: Роман Савоченко
uk: Роман Савоченко

source: The archiver module. Provides functions for messages and values archiving to the DB.
ru: Модуль архиватора. Предоставляет функции архивирования сообщений и значений на БД.
uk: Модуль архіватору. Надає функції архівації повідомлень та значень до БД.

source: Error checking the value archiver '%s'.
ru: Ошибка проверки архиватора значений '%s'.
uk: Помилка перевірки архіватору '%s'.

source: In minutes
ru: В минутах
uk: У хвилинах

source: Time, seconds
ru: Время, секунд
uk: Час, секунд

source: Time, microseconds
ru: Время, микросекунд
uk: Час, мікросекунд

source: Category
ru: Категория
uk: Категорія

source: Message
ru: Сообщение
uk: Повідомлення

source: Level
ru: Уровень
uk: Рівень

source: Error enabling the target DB: %s
ru: Ошибка включения целевой БД: %s
uk: Помилка ввімкнення цільової БД: %s

source: The archive is not started!
ru: Архив не запущен!
uk: Архів не запущено!

source: Archiving time
uk: Час архівування

source: Additional options
ru: Дополнительные опции
uk: Додаткові опції

source: Archive size, days
ru: Размер архива, дней
uk: Розмір архіву, днів

source: Set to 0 to disable this limit and to rise some the performance.
ru: Установить в 0 для отключения данного лимита и некоторого повышения производительности.
uk: Встановити у 0 для вимкнення обмеження та деякого підвищення продуктивності.

source: To form time as a string
ru: Формировать время как строка
uk: Формувати час як рядок

source: Only for databases that support such by means of specific data types like "datetime" in MySQL.
ru: Только для БД поддерживающих такое посредством специфических типов данных вроде "datetime" в MySQL.
uk: Тільки для БД які підтримують таке за посередництвом специфічних типів даних на кшталт "datetime" у MySQL.

source: Unique and non duple messages for time and category only
uk: Унікальні та недублюючі повідомлення лише за часом та категорією

source: Otherwise the message field is included to the primary key and is limited in 255 symbols.
uk: Інакше поле повідомлення включається до первинного ключа та його обмежено 255 символами.

source: Mark, time/(10*per)
ru: Метка, time/(10*per)
uk: Мітка, time/(10*per)

source: Grouping limit of the parameters
ru: Ограничение группировки параметров
uk: Обмеження групування параметрів

source: Enables for grouping arhivator's parameters in single table. Set to '0' for one table per parameter.
uk: Включити групування параметрів архіватору у одній таблиці. Встановити '0' для однієї таблиці на параметр.

source: Value
ru: Значение
uk: Значення

source: Archiving time, milliseconds
ru: Время архивирования, миллисекунд

source: Enables for grouping arhivator's parameters into single table. Set to '0' for one table per parameter.
ru: Включение группировки параметров архиватора в одной таблице. Установить в '0' для одной таблицы на параметр.
