Repository: aleax/openscada
Catalog: src/moduls/daq/DAQGate/po/*.po
Languages: de, ru, uk

source: Data sources gate
de: OpenSCADA Datenquellen
ru: Шлюз источников данных
uk: Шлюз джерел даних

source: Roman Savochenko
de: Roman Savotscheko
ru: Роман Савоченко
uk: Роман Савоченко

source: Allows to locate data sources of the remote OpenSCADA stations to local ones.
de: Ermöglicht das Lokalisieren von Datenquellen von Remote-OpenSCADA-Stationen zu lokalen.
ru: Позволяет выполнять шлюзование источников данных удалённых OpenSCADA станций на локальные.
uk: Дозволяє виконувати шлюзування джерел даних віддалених OpenSCADA станцій до локальних.

source: Table of parameters cache
de: Tabelle des Parametercaches
ru: Таблица кеша параметров
uk: Таблиця кешу параметрів

source: Acquisition schedule
de: Planung der Befragung
ru: Планирование сбора
uk: Планування збору

source: Priority of the acquisition task
de: Priorität der Erfassungsaufgabe
ru: Приоритет задачи сбора данных
uk: Пріоритет задачі збору даних

source: Timeout of restore, seconds
de: Timeout der Wiederherstellung, Sekunden
ru: Интервал восстановления, секунд
uk: Час відновлення, секунд

source: Depth time of restore data, hours
de: Tiefe der Wiederherstellungszeit, Stunden
ru: Глубина времени восстановления данных, часов
uk: Глибина часу відновлення даних, годин

source: Asynchronous writing
de: Asynchrones Schreiben
ru: Асинхронная запись
uk: Асинхронний запис

source: Level of requested messages
de: Anzahl der angeforderten Nachrichten
ru: Уровень запрашиваемых сообщений
uk: Рівень запитуваних повідомлень

source: ==Disable==;Debug (0);Information (1[X]);Notice (2[X]);Warning (3[X]);Error (4[X]);Critical (5[X]);Alert (6[X]);Emergency (7[X])
de: ==Deaktivieren==;Debuggen (0);Information (1[X]);Bemerkung (2[X]);Warnung (3[X]);Fehler (4[X]);Kritisch (5[X]);Wach (6[X]);Notfall (7[X])
ru: ==Отключить==;Отладка (0);Информация (1[X]);Замечание (2[X]);Предупреждение (3[X]);Ошибка (4[X]);Критически (5[X]);Тревога (6[X]);Авария (7[X])

source: Synchronization time with the remote station, seconds
de: Synchronisationszeit mit der Gegenstelle, Sekunden
ru: Периодичность синхронизации с удалённой станцией, секунд
uk: Період синхронізації з віддаленою станцією, секунд

source: Remote station
de: Gegenstelle
ru: Удалённая станция
uk: Віддалена станція

source: List of the remote controller objects and parameters
de: Liste der Fernsteuerungsobjekte und Parameter
ru: Список удалённых объектов контроллеров и параметров
uk: Перелік віддалених об'єктів контролерів та параметрів

source: Allow the automatic removal of parameters and attributes
de: Erlaube das automatische Entfernen von Parametern und Attributen
ru: Разрешать автоматическое удаление параметров и атрибутов
uk: Дозволяти автоматичне видалення параметрів та атрибутів

source: Placing different controllers to the separate virtual parameters
de: Platzieren verschiedener Controller für die separaten virtuellen Parameter
ru: Помещение различных контроллеров в отдельные виртуальные параметры
uk: Розташування різних контролерів до окремих віртуальних параметрів

source: Standard
ru: Стандарт
uk: Стандарт

source: Remote parameter address
de: Fernparameteradresse
ru: Адрес удалённого параметра
uk: Адреса віддаленого параметру

source: Attributes configuration cache
de: Attribute-Cache-Konfiguration
ru: Кеш конфигурации атрибутов
uk: Кеш конфігурації атрибутів

source: Presence at the stations
de: Präsenz an Stationen
ru: Присутствие по станциям
uk: Присутність за станціями

source: Sync.
de: Synchronisieren.
ru: Синхронизация.
uk: Синхронізація.

source: Acquisition.
de: Erwerb.
ru: Сбор.
uk: Збір.

source: Acquisition with the period %s.
de: Erwerb mit dem Zeitraum %s.
ru: Сбор с периодом %s.

source: Next acquisition by the cron '%s'.
de: Erwerb nächsten durch cron '%s'.
ru: Следующий сбор по cron '%s'.
uk: Наступний збір за cron '%s'.

source: Spent time %s[%s].
de: Verbrauchte Zeit %s[%s].
ru: Затрачено времени %s[%s].

source: Error '%s', restoring in %.3g s.
ru: Ошибка '%s', восстановление через %.3g с.
uk: Помилка '%s', відновлення через %.3g с.

source: Requests to '%s' - %.6g;
ru: Запросов к '%s' - %.6g;

source: read %g values, %g archive's, %g messages;
de: lesen %g Werte, %g Archivs, %g Nachrichten;
ru: прочитано %g значений, %g архивных, %g сообщений;
uk: прочитано %g значень, %g архівних, %g повідомлень;

source: wrote %g values, %g messages, in the buffer %d.
ru: записано %g значений, %g сообщений, в буфере %d.

source: Enabling: station '%s' processing item '%s' for parameters %d.
de: Aktivieren: Stationen '%s' Verarbeitung Elemente '%s' für Parameter %d.
ru: Включение: станция '%s' обрабатывает элемент '%s' для параметров %d.
uk: Включення: станція '%s' опрацьовує елемент '%s' на предмет параметрів %d.

source: Error deleting parameter '%s' but it is not present on the configuration or remote station.
de: Fehler beim Löschen des Parameters '%s', aber nicht in der Konfiguration oder der Gegenstelle.
ru: Ошибка удаления параметра '%s' поскольку он отсутствует в конфигурации или на удалённой станции.
uk: Помилка видалення параметру '%s' оскільки він відсутній у конфігурації або на віддаленій станції.

source: Connection to the data source: %s.
de: Verbindung zur Datenquelle: %s.
ru: Подключение к источнику данных: %s.
uk: Підключення до джерела даних: %s.

source: STOP
ru: ОСТАНОВЛЕН
uk: ЗУПИНЕНО

source: 10:Data not available.
de: 10:Keine Daten verfügbar.
ru: 10:Данные не доступны.
uk: 10:Дані не доступні.

source: OK
ru: НОРМА
uk: НОРМА

source: Connection to the data source '%s': %s.
ru: Подключение к источнику данных '%s': %s.
uk: Підключення до джерела даних '%s': %s.

source: Station missed '%s'.
de: Station verpasst '%s'.
ru: Станция отсутствует '%s'.
uk: Станція відсутня '%s'.

source: Manual restart of the enabled controller object causes the force resync at the sync period >= 0. Restart to refresh the removed source data configuration.
de: Ein manueller Neustart des freigegebenen Controller-Objekts bewirkt das Force-Resync bei der Sync-Periode >= 0. Starten Sie neu, um die entfernte Quelldatenkonfiguration zu aktualisieren.
ru: Ручной перезапуск включенного объекта контроллера вызывает принудительную пересинхронизацию при периоде синхронизации >= 0. Перезапустите чтобы освежить конфигурацию уделённого источника.
uk: Ручний перезапуск ввімкненого об'єкту контролеру викликає примусову пересинхронізацію за періодом синхронізації >= 0. Перезапустіть щоб освіжити конфігурацію даних віддаленого джерела.

source: Zero to disable the access to the remote archive.
de: Null, um den Zugriff auf das Remote-Archiv zu deaktivieren.
ru: Ноль для отключения доступа к удалённому архиву.
uk: Нуль для вимкнення доступу до віддаленого архіву.

source: Enables of writing in the common acquisition cycle for the buffer of accumulated values, by one request. Useful for slow and not reliable networks-connections since the writing buffer stores data before the connection restore and the real writing.
de: Ermöglicht das Schreiben im gemeinsamen Erfassungszyklus für den Puffer der akkumulierten Werte durch eine Anforderung. Nützlich für langsame und nicht zuverlässige Netzwerkverbindungen, da der Schreibpuffer Daten vor der Verbindungswiederherstellung und dem eigentlichen Schreiben speichert.
ru: Включает запись в общем цикле опроса для буфера накопленных значений, одним запросом. Полезно для медленных и ненадёжных сетей-подключений поскольку сохраняет данные до восстановления подключения и реальной записи.
uk: Вмикає запис у загальному циклі опитування щодо буферу накопичених значень, одним запитом. Корисне для повільних та ненадійних мереж-підключень оскільки зберігає дані до відновлення підключення та реального запису.

source: Zero to disable the periodic sync and -1 for the sync disabling at the start also.
de: Zero deaktivieren periodische Synchronisation, und -1, um die Synchronisierung auch beim Start zu deaktivieren.
ru: Ноль для отключения периодической синхронизации и -1 также для отключения синхронизации при запуске.
uk: Нуль для виключення періодичної синхронізації та -1 також для виключення синхронізації при запуску.

source: List of remote OpenSCADA station IDs used in this controller.
de: Liste der Remote-OpenSCADA-Stations-IDs, die in diesem Controller verwendet werden.
ru: Список идентификаторов удалённых OpenSCADA станций, используемых в этом контроллере.
uk: Перелік ідентифікаторів віддалених OpenSCADA станцій використаних у цьому контролері.

source: Go to configuration of the remote stations list
de: Wechseln Sie zur Konfiguration der Liste der entfernten Stationen
ru: Переход к конфигурации перечня удалённых станций
uk: Перехід до конфігурації переліку віддалених станцій

source: List of remote OpenSCADA full controller objects or individual controller parameters. Address example: System.AutoDA - for a controller object; System.AutoDA.UpTimeStation - for a controller parameter.
de: Liste von Remote-OpenSCADA-Voll-Controller-Objekten oder einzelnen Controller-Parametern. Adressbeispiel: System.AutoDA - für ein Controller-Objekt; System.AutoDA.UpTimeStation - für einen Controller-Parameter.
ru: Список удалённых OpenSCADA полных объектов контроллеров или отдельных параметров контроллеров. Пример адреса: System.AutoDA - для объекта контроллера; System.AutoDA.UpTimeStation - для параметра контроллера.
uk: Перелік віддалених OpenSCADA повних об'єктів контролерів або окремих параметрів контролерів. Приклад адреси: System.AutoDA - для об'єкту контролеру System.AutoDA.UpTimeStation - для параметру контролеру.

source: Parameters tree
de: Parameter Baum
ru: Дерево параметров
uk: Дерево параметрів

source: <<Append current>>
de: <<Anhängen aktuellen>>
ru: <<Добавить текущий>>
uk: <<Додати поточний>>

source: Parameter
ru: Параметр
uk: Параметр

source: State
ru: Состояние
uk: Стан

source: Type
de: Typ
ru: Тип
uk: Тип

source: Enabled
de: Aktiviert
ru: Включен
uk: Ввімкнено

source: Identifier
de: Identifikator
ru: Идентификатор
uk: Ідентифікатор

source: Name
ru: Имя
uk: Ім'я

source: Configuration
de: Konfiguration
ru: Конфигурация
uk: Конфігурація

source: Remote station configuration
ru: Конфигурация удалённой станции
uk: Конфігурація віддаленої станції

source: Controller is not started!
de: Controller ist nicht gestartet!
ru: Контроллер не запущен!
uk: Контролер не запущено!

source: ==Disable==;Debug (0);Information (1);Notice (2);Warning (3);Error (4);Critical (5);Alert (6);Emergency (7)
uk: ==Вимкнути==;Налагодження (0);Інформація (1);Зауваження (2);Попередження (3);Помилка (4);Критично (5);Тривога (6);Аварія (7)

source: Acquisition with the period: %s.
uk: Збір з періодом: %s.

source: Spent time: %s[%s].
uk: Витрачено часу: %s[%s].

source: Requests to '%s': %.6g;
uk: Запитів до '%s': %.6g;

source: wrote %g values, in the buffer %d.
uk: записано %g значень, у буфері %d.

source: Station '%s' - ERROR, restoring in %.3g s.
de: Station '%s' - FEHLER, Wiederherstellung in %.3g s.

source: Station '%s' - requests %.6g;
de: Station '%s' - Anfragen %.6g;

source: wrote %g values, %g messages.
de: schrieb %g Werte, %g Nachrichten.

source: To write %d.
de: Schreiben von %d.

source: State of the local representative parameter
de: Status des lokalen repräsentativen Parameters

source: Stations
de: Stationen

source: Address in remote source
de: Adresse in entfernter Quelle

source: Configuration of the remote parameter
de: Konfiguration des Remote-Parameters
