Repository: aleax/openscada
Catalog: src/moduls/transport/Sockets/po/*.po
Languages: de, ru, uk

source: Error reading (select): %s
de: Fehler beim Lesen (Auswählen): %s
ru: Ошибка чтения (select): %s
uk: Помилка читання (select): %s

source: Error reading '%s (%d)'
de: Fehler beim Lesen '%s (%d)'
ru: Ошибка чтения '%s (%d)'

source: No data, the connection seems closed
de: Keine Daten, die Verbindung scheint geschlossen zu sein
ru: Нет данных, подключение похоже закрыто

source: Error reading: %s
de: Fehler beim Lesen: %s
ru: Ошибка чтения: %s
uk: Помилка читання: %s

source: Read %s.
de: Lesen Sie %s.
ru: Прочитано %s.
uk: Прочитано %s.

source: Received from
ru: Получено
uk: Отримано

source: Timings
de: Zeitabstände
ru: Временные интервалы
uk: Інтервали часу

source: Attempts
de: Versuche
ru: Попыток
uk: Спроб

source: %d:> Transmitted directly to '%s'
de: %d:> Direkt zu '%s' übertragen

source: %d:< Received from '%s'
de: %d:< Empfangen von '%s'

source: %d:> Transmitted to '%s'
de: %d:> Übertragen in '%s'

source: > Transmitted to
de: > Übertragen an

source: < Received from
de: < Empfangen von

source: Started
uk: Запущено

source: Stopped
uk: Зупинено

source: Restart due to lack of input activity to '%s'.
uk: Перевантаження через відсутність вхідної активності на '%s'.

source: Error starting: %s
uk: Помилка запуску: %s

source: Transport is not started!
uk: Транспорт не запущено!

source: No data by: %s (%d)
uk: Немає даних за: %s (%d)
