Repository: aleax/openscada
Catalog: src/moduls/transport/Sockets/po/*.po
Languages: de, ru, uk

source: Sockets
ru: Сокеты
uk: Сокети

source: Roman Savochenko, Maxim Kochetkov
de: Roman Savotschenko, Maxim Kochetkov
ru: Роман Савоченко, Максим Кочетков
uk: Роман Савоченко, Максим Кочетков

source: Provides sockets based transport. Support network and UNIX sockets. Network socket supports TCP, UDP and RAWCAN protocols.
de: Bietet sockelbasierten Transport. Unterstützen Sie Netzwerk- und UNIX-Sockets. Netzwerk-Socket unterstützt TCP-, UDP- und RAWCAN-Protokolle.
ru: Предоставляет транспорт основанный на сокетах. Поддерживаются сетевые и UNIX сокеты. Сетевой сокет поддерживает TCP, UDP и RAWCAN протоколы.
uk: Надає транспорт базований на сокетах. Підтримуються мережеві та UNIX сокети. Мережевий сокет підтримує TCP, UDP та RAWCAN протоколи.

source: Addition parameters
de: Weitere Optionen
ru: Дополнительные параметры
uk: Додаткові параметри

source: Socket's output transport has the address format: [TCP:]{addr}[,{addrN}]:{port} - TCP socket: addr - address with which the connection is made; there may be as the symbolic representation as well as IPv4 "127.0.0.1" or IPv6 "[::1]"; port - network port with which the connection is made; indication of the character name of the port according to /etc/services is available; UDP:{addr}[,{addrN}]:{port} - UDP socket: addr - address with which the connection is made; there may be as the symbolic representation as well as IPv4 "127.0.0.1" or IPv6 "[::1]"; port - network port with which the connection is made; indication of the character name of the port according to /etc/services is available. RAWCAN:{if}:{mask}:{id} - CAN socket: if - interface name; mask - CAN mask; id - CAN id. UNIX:{name} - UNIX socket: name - UNIX-socket's file name.
de: Ausgangstransport Socket hat das Format der Adresse: [TCP:]{addr}[,{addrN}]:{port} - TCP Socket: addr - Adresse, mit der die Verbindung hergestellt wird; Dort kann sowohl die symbolische Darstellung als auch IPv4 "127.0.0.1" oder IPv6 "[::1]" der Adressen sein; port - Netzwerk-Port mit dem die Verbindung hergestellt wird; Angabe des Charakternamens des Ports gemäß /etc/services ist verfügbar; UDP:{addr}[,{addrN}]:{port} - UDP Socket: addr - Adresse, mit der die Verbindung hergestellt wird; Dort kann sowohl die symbolische Darstellung als auch IPv4 "127.0.0.1" oder IPv6 "[::1]" der Adressen sein; port - Netzwerk-Port mit dem die Verbindung hergestellt wird; Angabe des Charakternamens des Ports gemäß /etc/services ist verfügbar; RAWCAN:{if}:{mask}:{id} - CAN socket: if - Schnittstellennamen; mask - CAN-Maske; id - CAN-ID. UNIX:{name} - UNIX Socket: name - Name der Datei des UNIX-Sockets.
ru: Выходной транспорт Socket имеет формат адреса: [TCP:]{addr}[,{addrN}]:{port} - TCP сокет: addr - адрес к которому осуществляется подключение; допускаются как символьное, так и IPv4 "127.0.0.1" или IPv6 "[::1]" представление адреса; port - сетевой порт к которому осуществляется подключение; возможно указание символьного имени порта согласно /etc/services; UDP:{addr}[,{addrN}]:{port} - UDP сокет: addr - адрес к которому осуществляется подключение; допускаются как символьное, так и IPv4 "127.0.0.1" или IPv6 "[::1]" представление адреса; port - сетевой порт к которому осуществляется подключение; возможно указание символьного имени порта согласно /etc/services; RAWCAN:{if}:{mask}:{id} - CAN сокет: if - имя интерфейса; mask - маска CAN; id - идентификатор CAN. UNIX:{name} - UNIX сокет: name - имя файла UNIX-сокета.
uk: Вихідний транспорт Socket має формат адреси: [TCP:]{addr}[,{addrN}]:{port} - TCP сокет: addr - адреса до якої здійснюється підключення; допускається як символьне так й IPv4 "127.0.0.1" або IPv6 "[::1]" представлення адреси; port - мережевий порт до якого здійснюється підключення; можливе вказання символьного ім'я порту відповідно до /etc/services; UDP:{addr}[,{addrN}]:{port} - UDP сокет: addr - адреса до якої здійснюється підключення; допускається як символьне так й IPv4 "127.0.0.1" або IPv6 "[::1]" представлення адреси; port - мережевий порт до якого здійснюється підключення; можливе вказання символьного ім'я порту відповідно до /etc/services; RAWCAN:{if}:{mask}:{id} - CAN сокет: if - ім'я інтерфейсу; mask - маска CAN; id - ідентифікатор CAN. UNIX:{name} - UNIX сокет: name - ім'я файлу UNIX-сокету.

source: Connection timings in the format "{conn}:{next}[:{rep}]", where: conn - maximum time of waiting the connection, in seconds; next - maximum time of waiting for continue the response, in seconds; rep - minimum time of waiting the request repeating, in seconds. Can be prioritatile specified into the address field as the second global argument, as such "localhost:123||5:1".
de: Zeitabschnitte der Verbindung im Format: "{conn}:{next}[:{rep}]". Wo: conn - Maximale Zeit der Erwartung der Antwort der Verbindung, in Sekunden; next - Maximale Zeit der Erwartung der Fortsetzung der Antwort, in Sekunden; rep - Minimum repeate Timeout, in Sekunden. Als zweites globales Argument kann priorityatile im Adressfeld angegeben werden, zB "localhost:123||5:1".
ru: Временные интервалы соединения в формате "{conn}:{next}[:{rep}]", где: conn - максимальное время ожидания ответа соединения, в секундах; next - максимальное время ожидания продолжения ответа, в секундах; rep - минимальный таймаут ожидания повтора запроса, в секундах. Может быть приоритетно определён вторым глобальным аргументом поля адреса, вроде "localhost:123||5:1".
uk: Інтервали часу підключення у форматі "{conn}:{next}[:{rep}]", де: conn - максимальний час очікування відповіді з'єднання, у секундах; next - максимальний час очікування продовження відповіді, у секундах; rep - мінімальний таймаут очікування повтору запиту, у секундах. Може бути пріоритетно визначено другим глобальним аргументом поля адреси, на кшталт "localhost:123||5:1".

source: Attempts of the requesting both for this transport and protocol, for full requests. Can be prioritatile specified into the address field as the third global argument, as such "localhost:123||5:1||3".
de: Versuche des Anforderns sowohl für diesen Transport als auch für das Protokoll, für vollständige Anfragen. Als das dritte globale Argument kann priorityatile in das Adressfeld angegeben werden, zB "localhost:123||5:1||3".
ru: Попыток запроса транспортом и протоколом, для полных запросов. Может быть приоритетно определён третьим глобальным аргументом поля адреса, вроде "localhost:123||5:1||3".
uk: Спроб запиту транспортом та протоколом, для повних запитів. Може бути пріоритетно визначено третім глобальним аргументом поля адреси, на кшталт "localhost:123||5:1||3".

source: Connections %d, opened %d, last %s, closed by the limit %d.
de: Verbindungen %d, geöffnet %d, zuletzt %s, geschlossen durch das Limit %d.
ru: Соединений %d, открыто %d, последнее %s, закрыто по лимиту %d.
uk: Підключень %d, відкрито %d, останне %s, закрито за лімітом %d.

source: %s traffic in %s, out %s.
de: %s Verkehr in %s, aus %s.
ru: %s трафик входной %s, выходной %s.
uk: %s трафік вхідний %s, вихідний %s.

source: Processing time %s[%s].
de: Bearbeitungszeit %s[%s].
ru: Время обработки %s[%s].
uk: Час обробки %s[%s].

source: Error the socket type '%s'!
de: Fehler beim Socket-Typ '%s'!
ru: Ошибка типа сокета '%s'!
uk: Помилка типу сокету '%s'!

source: Error the address '%s': '%s (%d)'
de: Fehler bei der Adresse '%s': '%s (%d)'
ru: Ошибка адреса '%s': '%s (%d)'
uk: Помилка адреси '%s': '%s (%d)'

source: sockaddr to large.
de: sockaddr zu groß.
ru: sockaddr очень большой.
uk: sockaddr дуже великий.

source: Error creating the %s socket: '%s (%d)'!
de: Fehler beim Erstellen des Sockets %s: '%s (%d)'!
ru: Ошибка создания %s сокета: '%s (%d)'!
uk: Помилка створення %s сокету: '%s (%d)'!

source: Error connecting the %s socket: '%s (%d)'!
de: Fehler beim Verbinden des Sockets %s: '%s (%d)'!
ru: Ошибка подключения %s сокета: '%s (%d)'!
uk: Помилка підключення %s сокету: '%s (%d)'!

source: Error binding the %s socket: '%s (%d)'!
de: Fehler beim Binden des Sockets %s: '%s (%d)'!
ru: Ошибка связывания с %s сокетом: '%s (%d)'!
uk: Помилка під'єднання %s сокету: '%s (%d)'!

source: RAWCAN socket binded to '%s'!
de: RAWCAN Socket ist verbunden mit '%s'!
ru: RAWCAN сокет подключен к '%s'!
uk: RAWCAN сокет під'єднався до '%s'!

source: Connected
de: Verbunden
ru: Подключено

source: Disconnected
de: Getrennt
ru: Отключено

source: Reconnect due to lack of input activity to '%s'.
de: Reconnect wegen fehlender Eingabeaktivität für '%s'.
ru: Переподключение из-за отсутствия входной активности на '%s'.

source: Write: wrote %s.
de: Schreiben: schrieb %s.
ru: Запись: записано %s.
uk: Запис: записано %s.

source: Write: the answer is zero byte.
de: Schreiben: Antwort für Null-Bytes.
ru: Запись: ответ ноль байт.
uk: Запис: відповідь ноль байт.

source: Write: error '%s (%d)'!
de: Schreiben: Fehler '%s (%d)'!
ru: Запись: ошибка '%s (%d)'!
uk: Запис: помилка '%s (%d)'!

source: %d:Transmitted directly to '%s'
ru: %d:Прямо передано на '%s'
uk: %d:Прямо передано до '%s'

source: Closing the input transport by the error "%s (%d)"
de: Schließen des Eingabetransports durch den Fehler "%s (%d)"
ru: Закрытие входного транспорта по ошибке "%s (%d)"
uk: Закриття вхідного транспорту за помилкою "%s (%d)"

source: Error creating a thread!
de: Fehler beim Erstellen eines Threads!
ru: Ошибка создания потока!
uk: Помилка створення потоку!

source: Read datagram %s from '%s'!
de: Lesen Datagramm %s aus '%s'!
ru: Прочитано датаграму %s из '%s'!
uk: Прочитано датаграму %s з '%s'!

source: %d:Received from '%s'
ru: %d:Принято из '%s'
uk: %d:Отримано з '%s'

source: Wrote datagram %s to '%s'!
de: Schrieb Datagramm %s auf '%s'!
ru: Записано датаграму %s в '%s'!
uk: Записано датаграму %s до '%s'!

source: %d:Transmitted to '%s'
ru: %d:Передано на '%s'
uk: %d:Передано до '%s'

source: Received CAN frame id:%08X; dlc:%d; data:%02X%02X%02X%02X%02X%02X%02X%02X!
de: Empfangenen CAN-Rahmen id:%08X; dlc:%d; data:%02X%02X%02X%02X%02X%02X%02X%02X!
ru: Получено CAN сообщение id:%08X; dlc:%d; data:%02X%02X%02X%02X%02X%02X%02X%02X!
uk: Отримано CAN повідомлення id:%08X; dlc:%d; data:%02X%02X%02X%02X%02X%02X%02X%02X!

source: stopping client tasks ...
de: Client-Aufgaben stoppen ...
ru: останов клиентских задач ...
uk: зупинка клієнтських задач ...

source: Connected by '%s'!
de: Verbunden mit '%s'!
ru: Подключено '%s'!
uk: Приєднано '%s'!

source: Terminated by the error "%s (%d)"
de: Beendet durch den Fehler "%s (%d)"
ru: Разорвано ошибкой "%s (%d)"
uk: Перервано помилкою "%s (%d)"

source: %d:Terminated by the error "%s (%d)"
de: %d:Beendet durch den Fehler "%s (%d)"
ru: %d:Разорвано ошибкой "%s (%d)"
uk: %d:Перервано помилкою "%s (%d)"

source: %d:Terminated by the reading %d error "%s (%d)"
de: %d:Beendet durch das Lesen %d Fehler "%s (%d)"
ru: %d:Разорвано ошибкой чтения %d: '%s (%d)'
uk: %d:Перервано помилкою читання %d: '%s (%d)'

source: Read message %s from '%s'.
de: Nachricht lesen %s aus '%s'.
ru: Прочитано сообщение %s из '%s'.
uk: Прочитано повідомлення %s від '%s'.

source: Wrote message %s to '%s'.
de: Schrieb Nachricht %s auf '%s'.
ru: Записано сообщение %s на '%s'.
uk: Записано повідомлення %s до '%s'.

source: Write: error '%s (%d)'.
de: Schreiben: Fehler '%s (%d)'.
ru: Запись: ошибка '%s (%d)'.

source: Error transmitting: %s
de: Fehler beim Senden: %s
ru: Ошибка передачи: %s
uk: Помилка передавання: %s

source: Disconnected by '%s'!
de: Getrennt durch '%s'!
ru: Отключено '%s'!
uk: Від'єднано '%s'!

source: Terminated by the execution '%s'
de: Beendet durch die Ausführung '%s'
ru: Разорвано исключением '%s'
uk: Перервано виключенням '%s'

source: %d:Terminated by the execution '%s'
de: %d:Beendet durch die Ausführung '%s'
ru: %d:Разорвано исключением '%s'
uk: %d:Перервано виключенням '%s'

source: The new input protocol's object '%s' is created!
de: Das Objekt des neuen Eingangsprotokolls '%s' wird erstellt!
ru: Создано новый объект входного протокола '%s'!
uk: Створено новий об'єкт вхідного протоколу '%s'!

source: All protocols is wrong for their initialization.
de: Alle Protokolle sind falsch für ihre Initialisierung.
ru: Ошибка инициализации всех протоколов.
uk: Помилка ініціалізації всіх протоколів.

source: The input protocol object '%s' has closed itself!
de: Das Eingangsprotokollobjekt '%s' hat sich selbst geschlossen!
ru: Объект входного протокола '%s' закрылся сам!
uk: Об'єкт вхідного протоколу '%s' закрився сам!

source: Error requesting the protocol.
de: Fehler beim Anfordern des Protokolls.
ru: Ошибка запроса протокола.
uk: Помилка запиту протоколу.

source: New client %d from '%s' connected
de: Neuer Client %d von '%s' verbunden
ru: Подключен новый клиент %d из '%s'
uk: Підключено новий клієнт %d з '%s'

source: Client %d from '%s' disconnected
de: Client %d aus '%s' getrennt
ru: Отключен клиент %d из '%s'
uk: Відключено клієнт %d з %s

source: State
de: Staats
ru: Состояние
uk: Стан

source: Active connections
de: Aktive Verbindungen
ru: Активные подключения
uk: Активні підключення

source: Socket's input transport has the address format: [TCP:]{addr}:{port}:{mode}[:{IDmess}] - TCP socket: addr - address for socket to be opened, empty or "*" address opens socket for all interfaces; there may be as the symbolic representation as well as IPv4 "127.0.0.1" or IPv6 "[::1]"; port - network port on which the socket is opened, indication of the character name of the port, according to /etc/services is available; mode - mode of operation: 0 - break connections; 1(default) - keep alive; 2 - initiative connections; IDmess - identification message of the initiative connection - the mode 2. UDP:{addr}:{port} - UDP socket: addr - address for socket to be opened, empty or "*" address opens socket for all interfaces; there may be as the symbolic representation as well as IPv4 "127.0.0.1" or IPv6 "[::1]"; port - network port on which the socket is opened, indication of the character name of the port, according to /etc/services is available. RAWCAN:{if}:{mask}:{id} - CAN socket: if - interface name; mask - CAN mask; id - CAN id. UNIX:{name}:{mode} - UNIX socket: name - UNIX-socket's file name; mode - mode of operation: 0 - break connections; 1(default) - keep alive; 2 - initiative connections.
de: Eingangstransport Socket hat das Format der Adresse: [TCP:]{addr}:{port}:{mode}[:{IDmess}] - TCP Socket: addr - die Adresse der Eröffnung des Sockets, leere oder "*" Adresse öffnet den Socket für alle Schnittstellen; dort kann sowohl die symbolische Darstellung als auch IPv4 "127.0.0.1" oder IPv6 "[::1]" der Adressen sein; port - Netzwerkanschluss, auf dem der Socket geöffnet ist, Angabe des Charakternamens des Ports gemäß /etc/services ist verfügbar; mode - Arbeitsweise: 0 - die Verbindung brechen; 1(Default) - speichern die Verbidung; 2 - Initiative Verbindung; IDmess - Identifikationsnachricht der Initiativverbindung - der Modus 2. UDP:{addr}:{port} - UDP Socket: addr - die Adresse der Eröffnung des Sockets, leere oder "*" Adresse öffnet den Socket für alle Schnittstellen; dort kann sowohl die symbolische Darstellung als auch IPv4 "127.0.0.1" oder IPv6 "[::1]" der Adressen sein; port - Netzwerkanschluss, auf dem der Socket geöffnet ist, Angabe des Charakternamens des Ports gemäß /etc/services ist verfügbar; RAWCAN:{if}:{mask}:{id} - CAN socket: if - Schnittstellennamen; mask - CAN-Maske; id - CAN-ID. UNIX:{name}:{mode} - UNIX Socket: name - Name der Datei des UNIX-Sockets; mode - Arbeitsweise: 0 - die Verbindung brechen; 1(Default) - speichern die Verbidung; 2 - Initiative Verbindung.
ru: Входной транспорт Socket имеет формат адреса: [TCP:]{addr}:{port}:{mode}[:{IDmess}] - TCP сокет: addr - адрес открытия сокета, пустой адрес или "*" открывает сокет на всех интерфейсах; допускаются как символьное, так и IPv4 "127.0.0.1" или IPv6 "[::1]" представление адреса; port - сетевой порт на котором открывается сокет, возможно указание символьного имени порта согласно /etc/services; mode - режим работы: 0 - разрывать соединение; 1(типовой) - сохранять соединение; 2 - инициативное подключение; IDmess - идентифицирующее сообщение инициативного подключения - режим 2. UDP:{addr}:{port} - UDP сокет: addr - адрес открытия сокета, пустой адрес или "*" открывает сокет на всех интерфейсах; допускаются как символьное, так и IPv4 "127.0.0.1" или IPv6 "[::1]" представление адреса; port - сетевой порт на котором открывается сокет, возможно указание символьного имени порта согласно /etc/services; RAWCAN:{if}:{mask}:{id} - CAN сокет: if - имя интерфейса; mask - маска CAN; id - идентификатор CAN. UNIX:{name}:{mode} - UNIX сокет: name - имя файла UNIX-сокета; mode - режим работы: 0 - разрывать соединение; 1(типовой) - сохранять соединение; 2 - инициативное подключение.
uk: Вхідний транспорт Socket має формат адреси: [TCP:]{addr}:{port}:{mode}[:{IDmess}] - TCP сокет: addr - адреса відкриття сокету, порожня або "*" адреса відкриває сокет на всіх інтерфейсах; допускаються як символьне, так й IPv4 "127.0.0.1" або IPv6 "[::1]" представлення адреси; port - мережевий порт на якому відкривається сокет, можливе вказання символьного ім'я порту відповідно до /etc/services; mode - режим роботи: 0 - розривати з'єднання; 1(типово) - зберігати з'єднання; 2 - ініціативне підключення; IDmess - ідентифікуюче повідомлення ініціативного підключення - режим 2. UDP:{addr}:{port} - UDP сокет: addr - адреса відкриття сокету, порожня або "*" адреса відкриває сокет на всіх інтерфейсах; допускаються як символьне, так й IPv4 "127.0.0.1" або IPv6 "[::1]" представлення адреси; port - мережевий порт на якому відкривається сокет, можливе вказання символьного ім'я порту відповідно до /etc/services; RAWCAN:{if}:{mask}:{id} - CAN сокет: if - ім'я інтерфейсу; mask - маска CAN; id - ідентифікатор CAN. UNIX:{name}:{mode} - UNIX сокет: name - ім'я файлу UNIX-сокета; mode - режим роботи: 0 - розривати з'єднання; 1(типово) - зберігати з'єднання; 2 - ініціативне підключення.

source: Empty value for the protocol selection switchs the transport to a mode of creation associated output transports for each connection to this transport.
de: Ein leerer Wert für die Protokollauswahl schaltet den Transport zu einem Erstellungsmodus zugeordneten Ausgangstransporten für jede Verbindung zu diesem Transport um.
ru: Пустое значение выбора протокола переключает транспорт в режим создания ассоциированного выходного транспорта для каждого подключения на данный входной.
uk: Порожне значення вибору протоколу перемикає транспорт у режим створення асоційованого вихідного транспорту для кожного підключення на цей вхідний.

source: Priority
de: Priorität
ru: Приоритет
uk: Пріоритет

source: Maximum segment size (MSS)
de: Maximale Segmentgröße (MSS)
ru: Максимальный размер сегмента (MSS)
uk: Максимальний розмір сегменту (MSS)

source: Set 0 for the system MSS.
de: Stellen Sie 0 für System MSS.
ru: Установить 0 для системного MSS.
uk: Встановити 0 для системного MSS.

source: Input buffer, KB
de: Eingabepuffer, KB
ru: Входной буфер, кБ
uk: Вхідний буфер, кБ

source: Queue length
de: Reihenlänge
ru: Длина очереди
uk: Довжина черги

source: Maximum number of clients
de: Maximale Anzahl von Clients
ru: Максимальное число клиентов
uk: Максимальна кількість клієнтів

source: Maximum number of clients per host
de: Maximale Anzahl von Clients pro Host
ru: Максимальное число клиентов по хостам
uk: Максимальна кількість клієнтів за хостами

source: Set to 0 to disable this limit.
de: Setzen Sie den Wert auf 0, um dieses Limit zu deaktivieren.
ru: Установить в 0 для отключения ограничения.
uk: Встановити у 0 для вимкнення цього обмеження.

source: Keep alive requests
de: Keep alive Anfragen
ru: Keep alive запросов
uk: Keep alive запитів

source: Closing the connection after the specified requests. Zero value to disable - do not close ever.
de: Schließen Sie die Verbindung nach bestimmten Anfragen. Null-Wert für disable - nicht immer schließen.
ru: Закрытие подключения после указанного количества запросов. Нулевое значение для отключения - не закрывается никогда.
uk: Закриття підключення після визначеної кількості запитів. Нульове значення для відключення - не закривається ніколи.

source: Keep alive timeout, seconds
de: Keep alive Timeout, Sekunden
ru: Keep alive время ожидания, секунд
uk: Keep alive час очікування, секунд

source: Closing the connection after no requests at the specified timeout. Zero value to disable - do not close ever.
de: Schließen Sie die Verbindung nach keine Anfragen zu bestimmten Timeout. Null-Wert für disable - nicht immer schließen.
ru: Закрытие подключения после отсутствия запросов в течении указанного времени. Нулевое значение для отключения - не закрывается никогда.
uk: Закриття підключення після відсутності запитів протягом визначеного часу. Нульове значення для відключення - не закривається ніколи.

source: %s %d(%s): last %s; traffic in %s, out %s;
de: %s %d(%s): letzte %s; eingangstraffik %s, Ausgangs %s;
ru: %s %d(%s): последний %s; трафик входной %s, выходной %s;
uk: %s %d(%s): останній %s; трафік вхідний %s, вихідний %s;

source: processing time %s[%s];
de: Bearbeitungszeit %s[%s];
ru: время обработки %s[%s];
uk: час обробки %s[%s];

source: To the host '%s'.
de: An den Host '%s'.
ru: К хосту '%s'.
uk: До хосту '%s'.

source: Response time %s[%s].
de: Reaktionszeit %s[%s].
ru: Время ответа %s[%s].
uk: Час відповіді %s[%s].

source: We are stopping!
de: Wir hören auf!
ru: Мы останавливаемся!

source: The force socket is deactivated!
de: Der Kraftsockel ist deaktiviert!
ru: Принудительный сокет деактивирован!
uk: Примусовий сокет деактивовано!

source: Error the force socket %d using: '%s (%d)'!
de: Error the force socket %d mit: '%s (%d)'!
ru: Ошибка принудительного использования сокета %d: '%s (%d)'!
uk: Помилка примусового використання сокету %d: '%s (%d)'!

source: Resolving for '%s'
de: Auflösen für '%s'
ru: Разрешение '%s'
uk: Вирішення '%s'

source: Connecting to '%s'
de: Verbindung zu '%s'
ru: Подключение к '%s'
uk: Підключення до '%s'

source: Error connecting during the time %s: '%s (%d)'
de: Fehler beim Verbinden während der Zeit %s: '%s (%d)'
ru: Ошибка подключения в течении времени %s: '%s (%d)'
uk: Помилка підключення протягом часу %s: '%s (%d)'

source: Error connecting to the internet socket '%s:%s' during the timeout, it seems in down or inaccessible: '%s (%d)'!
de: Fehler beim Verbinden mit dem Internet-Socket '%s:%s' während des Timeouts, es scheint nicht aktiv oder erreichbar zu sein: '%s (%d)'!
ru: Ошибка подключения к интернет сокету '%s:%s' в течении таймаута, он похоже отключен или недоступен: '%s (%d)'!
uk: Помилка підключення до інтернет сокету '%s:%s' протягом таймауту, він схоже відключений або недоступний: '%s (%d)'!

source: Error creating the %s socket!
de: Fehler beim Erstellen des %s-Sockets!
ru: Ошибка создания сокета '%s'!
uk: Помилка створення %s сокету!

source: RAWCAN socket doesn't bind to '%s'!
de: RAWCAN Socket ist nicht verbunden mit '%s'!
ru: RAWCAN сокет не подключился к '%s'!
uk: RAWCAN сокет не під'єднався до '%s'!

source: Error connecting: %s
de: Verbindungsfehler: %s
ru: Ошибка подключения: %s

source: Unknown error
de: Unbekannter Fehler
ru: Неизвестная ошибка
uk: Невідома помилка

source: Transport is not connected!
de: Transport ist nicht verbunden!
ru: Транспорт не подключен!

source: Error requesting: %s
de: Fehler beim Anfordern: %s
ru: Ошибка запроса: %s
uk: Помилка запиту: %s

source: Error writing '%s (%d)'
de: Fehler beim Schreiben '%s (%d)'
ru: Ошибка записи '%s (%d)'

source: No data wrote
de: Keine Daten geschrieben
ru: Не записаны данные
uk: Не записано даних

source: Error writing: %s
de: Fehler beim Schreiben: %s
ru: Ошибка записи: %s
uk: Помилка запису: %s

source: Transmitted to
ru: Передано
uk: Передано

source: Wrote %s.
de: Schrieb %s.
ru: Записано %s.
uk: Записано %s.

source: Reading timeouted.
de: Lesezeitüberschreitung.
ru: Время чтения истекло.
uk: Перевищено час читання.
