Repository: aleax/openscada
Catalog: src/moduls/ui/WebCfgD/po/*.po
Languages: de, uk

source: Program configurator (Dynamic WEB)
de: Programmkonfigurator (Dynamischer WEB)
uk: Конфігуратор програми (Динамічний WEB)

source: Roman Savochenko
de: Roman Savotschenko
uk: Роман Савоченко

source: Provides the WEB-based configurator of OpenSCADA. The technologies are used: XHTML, CSS and JavaScript.
de: Bietet den WEB-basierten Konfigurator von OpenSCADA. Die Technologien werden verwendet: XHTML, CSS und JavaScript.
uk: Надає заснований на WEB динамічний конфігуратор OpenSCADA. Використано технології: XHTML, CSS та JavaScript.

source: Manual
de: Handbuch
uk: Підручник

source: About
de: Über...
uk: Про...

source: Drag to resize the Menu
de: Ziehen Sie, um die Größe des Menü
uk: Потягніть для зміни розміру меню

source: Load
de: Laden
uk: Завантажити

source: Save
de: Speichern
uk: Зберегти

source: Up
de: Eine Stufe höher
uk: На рівень вище

source: Back
de: Zurück
uk: Попередня

source: Forward
de: Nach vorne
uk: Наступна

source: Add item
de: Hinzufügen Elements
uk: Додати елемент

source: Delete item
de: Löschen Elements
uk: Видалити елемент

source: Copy item
de: Kopieren Elements
uk: Копіювати елемент

source: Cut item
de: Schneide Elements
uk: Вирізати елемент

source: Paste item
de: Fügen Elements
uk: Вставити елемент

source: Refresh the item and tree
de: Aktualisieren Sie den Artikel und Baum
uk: Оновити елемент та дерево

source: Start the cycled refreshing
de: Starten Sie die zyklische Aktualisierung
uk: Запуск періодичного оновлення

source: Stop the cycled refreshing
de: Stoppen Sie die zyklische Aktualisierung
uk: Зупинка періодичного оновлення

source: Ready
de: Fertig
uk: Готовий

source: Go
de: Übergehen
uk: Перейти

source: Add
de: Addieren
uk: Додати

source: Insert
de: Einsetzen
uk: Вставити

source: Edit
de: Redigieren
uk: Редагувати

source: Delete
de: Löschen
uk: Видалити

source: Item up
de: Item nach oben
uk: Підняти

source: Item down
de: Item nach unten
uk: Опустити

source: Adding an element.
de: Hinzufügen eines Elements.
uk: Додання нового елементу.

source: Inserting an element.
de: Einfügen eines Elements.
uk: Вставлення нового елементу.

source: Renaming the element.
de: Umbenennen des Elements.
uk: Перейменування елементу.

source: Selecting an image file for download to the picture field.
de: Auswählen einer Bilddatei zum Download auf das Bildfeld.
uk: Вибір файлу зображення для завантаження у поле зображення.

source: Add row
de: Die Zeile addieren
uk: Додати строку

source: Insert row
de: Die Zeile einsetzen
uk: Вставити строку

source: Delete row
de: Die Zeile löschen
uk: Видалити строку

source: Up row
de: Zeile nach oben
uk: Підняти строку

source: Down row
de: Zeile nach unten
uk: Опустити строку

source: There is no container for editing.
de: Es gibt keinen Container zum Bearbeiten.
uk: Немає жодного контейнера для редагування.

source: Adding an item to the node '%1'.
de: Hinzufügen eines Elements zum Knoten '%1'.
uk: Додання елементу до вузла '%1'.

source: Item '%1' already exists.
de: Artikel '%1' existiert bereits.
uk: Елемент '%1' вже присутній.

source: Are you sure you want to remove the node '%1'?
de: Möchten Sie den Knoten '%1' wirklich entfernen?
uk: Ви дійсно бажаєте видалити вузол '%1'?

source: Copy is impossible.
de: Kopierung ist unmöglich.
uk: Копіювання неможливе.

source: Selected
de: Gewählt
uk: Обраний

source: Move node '%1' to '%2'.
de: Den Knoten '%1' in '%2' umsetzen.
uk: Переміщення вузлу '%1' до '%2'.

source: Copy node '%1' to '%2'.
de: Kopierung des Knotens '%1' в '%2'.
uk: Копіювання вузлу '%1' до '%2'.

source: Node '%1' already present. Continue?
de: Der Knoten '%1' ist schon vorhanden. Weiter?
uk: Вузол '%1' вже присутній. Продовжити?

source: Element type:
de: Typ des Elements:
uk: Тип елементу:

source: Name:
uk: Ім'я:

source: Ok
de: Annehmen
uk: Прийняти

source: Close
de: Schliessen
uk: Закрити

source: Page loaded.
de: Die Seite ist geladet.
uk: Сторінку завантажено.

source: Selecting node id and/or name
de: Auswahl der Knoten-ID und/oder des Namens
uk: Вибір ідентифікатору та/або назви

source: Setting item name
de: Einstellungselementname
uk: Встановлення назви елементу

source: Setting an image
de: Ein Bild einstellen
uk: Встановлення зображення

source: Adding a node
de: Hinzufügen eines Knotens
uk: Додання елементу

source: Moving or copying the node
de: Verschieben oder Kopieren des Knotens
uk: Переміщення або копіювання вузлу

source: Name:
uk: Ім'я:

source: Description:
de: Beschreibung:
uk: Опис:

source: License:
de: Lizenz:
uk: Ліцензія:

source: Author:
de: Autor:
uk: Автор:

source: Web site:
de: Web Seite:
uk: Web сайт:

source: Unknown command: %s.
de: Unbekanntes Kommando: %s.
uk: Невідома команда: %s.

source: The page/widget '%s' calling command '%s'!
de: Die Seite / das Widget '%s' ruft den Befehl '%s' auf!
uk: Команда виклику сторінки/віджету '%s': '%s'!

source: Error the page '%s': %s
de: Fehler bei der Seite '%s': %s
uk: Помилка сторінки '%s': %s

source: No content.
de: Kein Inhalt.
uk: Немає вмісту.

source: Module options
de: Optionen des Moduls
uk: Опції модуля

source: Go to the configuration of the remote stations list
de: Wechseln Sie zur Konfiguration der Liste der entfernten Stationen
uk: Перейти до конфігурації переліку віддалених станцій
