Repository: aleax/openscada
Catalog: src/moduls/daq/OPC_UA/po/*.po
Languages: de, uk

source: Parameters table
de: Parametertabelle
uk: Таблиця параметрів

source: Logical parameters table
de: Logische Parameter der Tabelle
uk: Таблиця логічних параметрів

source: Acquisition schedule
de: Planung der Befragung
uk: Планування збору

source: Priority of the acquisition task
de: Priorität der Erfassungsaufgabe
uk: Пріоритет задачі збору даних

source: Restore timeout, seconds
de: Zeitüberschreitung bei der Wiederherstellung, Sekunden
uk: Час відновлення, секунд

source: Sync inter remote station period, seconds
de: Periode der Sznchronisierung mit der entfernten Station, Sekunden
uk: Період синхронізації з віддаленою станцією, секунд

source: End point
de: Endknoten
uk: Кінцевий вузол

source: Security policy
de: Politik der Sicherheit
uk: Політика безпеки

source: None;Basic128Rsa15;Basic256
de: Keine;Basic128Rsa15;Basic256
uk: Немає;Basic128Rsa15;Basic256

source: Message security mode
de: Regime der Sicherheit der Nachricht
uk: Режим безпеки повідомлення

source: None;Sign;Sign&Encrypt
de: Keine;Unterschrift;Unterschrift&Kodierung
uk: Немає;Підпис;Підпис&Кодування

source: Certificate (PEM)
de: Zertifikat (PEM)
uk: Сертифікат (PEM)

source: Private key (PEM)
de: Privatschlüssel (PEM)
uk: Приватний ключ (PEM)

source: Auth: user
de: Auth: Benutzer
uk: Аутентиф.: користувач

source: Auth: password
de: Auth: Passwort
uk: Аутентиф.: пароль

source: Use the "Read" function
de: Verwenden Sie die "Read " Funktion
uk: Використовувати функцію "Read"

source: Standard
uk: Стандарт

source: Nodes list
de: Liste von den Knoten
uk: Перелік вузлів

source: Logical
de: Logische
uk: Логічний

source: Parameter template
de: Template-Parameter
uk: Шаблон параметру

source: Parameter ID
de: ID der Parameter
uk: ID параметру

source: Identifier
de: Identifikator
uk: Ідентифікатор

source: Value
de: Wert
uk: Значення

source: Root folder (%d)
de: Wurzeldirektorie (%d)
uk: Коренева тека (%d)

source: Task terminated!
de: Task gekündigt!
uk: Завдання перервано!

source: Error connecting.
de: Fehler beim Verbinden.
uk: Помилка підключення.

source: Restoring in %.6g s.
de: Wiederherstellung in %.6g s.
uk: Відновлення за %.6g с.

source: Acquisition.
de: Erwerb.
uk: Збір.

source: Acquisition with the period: %s.
de: Erwerb mit dem Zeitraum: %s.
uk: Збір з періодом: %s.

source: Next acquisition by the cron '%s'.
de: Erwerb nächsten durch cron '%s'.
uk: Наступний збір за cron '%s'.

source: Spent time: %s[%s]. Requests %.6g.
de: Verbrauchte Zeit: %s[%s]. Anfragen %.6g.
uk: Витрачено часу: %s[%s]. Запитів %.6g.

source: Secure channel %u, token %u, lifetime %s; Request ID %u, handle %u; Session %s.
de: Sicherer Kanal %u, Token %u, Lebensdauer %s; ID anfordern %u, behandeln %u; Sitzung %s.
uk: Канал безпеки %u, токен %u, час життя %s; Запиту ІД %u, тримач %u; Сеанс %s.

source: Subscription %u, publishes %u, keep alive %s; Monitored items %u.
de: Abonnement %u, veröffentlicht %u, am Leben zu erhalten %s; Überwachte Elemente %u.
uk: Підписка %u, публікацій %u, утримання живим %s; Елементів моніторингу %u.

source: OPC UA automatic created transport for '%s' controller.
de: OPC UA automatische erstellt Transportmittel für '%s' Controller.
uk: OPC UA автоматично створений транспорт для контролеру '%s'.

source: Connection to the data source: %s.
de: Verbindung zur Datenquelle: %s.
uk: Підключення до джерела даних: %s.

source: STOP
uk: ЗУПИНЕНО

source: Remote host error
de: Fehler des entfernten Hostes
uk: Помилка віддаленого хосту

source: Error '%s': 0x%x
de: Fehler '%s': 0x%x
uk: Помилка '%s': 0x%x

source: Write error status: %s
de: Fehlerstatus schreiben: %s
uk: Статус помилки запису: %s

source: OK
uk: НОРМА

source: 10:Generic error: %s.
de: 10:Allgemeiner Fehler: %s.
uk: 10:Загальна помилка: %s.

source: Zero for disable periodic sync.
de: Zero deaktivieren periodische Synchronisation.
uk: Нуль для вимкнення періодичної синхронізації.

source: Otherwise there is activated and used the Publish (asynchronous) data acquisition service of the OPC-UA protocol.
de: Andernfalls wird der Publish (asynchronous) Datenerfassungsdienst des OPC-UA-Protokolls aktiviert und verwendet.
uk: Інакше активується та використовується сервіс збору даних Publish (асинхронний) протоколу OPC-UA.

source: Server nodes browser
de: Übersicht der Knoten des Servers
uk: Огляд вузлів серверу

source: Node
de: Knoten
uk: Вузол

source: Attributes
de: Attribute
uk: Атрибути

source: Attribute
de: Attribut
uk: Атрибут

source: Unknown
de: Unbekannt
uk: Невідомий

source: NodeId
de: Knoten ID
uk: Ід.Вузла

source: NodeClass
de: Klasse des Knotens
uk: КласВузла

source: Object
de: Objekt
uk: Об'єкт

source: Variable
uk: Змінна

source: Method
de: Methode
uk: Метод

source: ObjectType
de: ObjektTyp
uk: ТипОб'єкта

source: VariableType
de: Typ der Variable
uk: ТипЗмінної

source: ReferenceType
de: Typ der Verweisung
uk: ТипПосилання

source: DataType
de: DatenTyp
uk: ТипДаних

source: View
de: Form
uk: Вигляд

source: BrowseName
de: ÜbersichtsName
uk: Ім'яОгляду

source: DisplayName
de: AbbildungsName
uk: Ім'яВідображення

source: Description
de: Beschreibung
uk: Опис

source: WriteMask
de: Maske der Einschreibung
uk: МаскаЗапису

source: UserWriteMask
de: Maske der Einschreibung des Nutzers
uk: МаскаЗаписуКорист

source: IsAbstract
de: Abstrakt
uk: Абстрактний

source: Symmetric
de: Symmetrisch
uk: Симетричний

source: InverseName
de: InversName
uk: ІнверснеІм'я

source: ContainsNoLoops
de: EnthältKeineWindungen
uk: НеМіститьКіл

source: EventNotifier
de: Benachrichtigung der Ereignisse
uk: СповіщенняПроДії

source: ValueRank
de: WerteRang
uk: РангЗначення

source: ArrayDimensions
de: DimensionDesMassivs
uk: ВимірМасиву

source: AccessLevel
de: ZugangsNiveau
uk: РівеньДоступу

source: Readable,
de: Lesen,
uk: Читати,

source: Writable,
de: Einschreiben,
uk: Писати,

source: History readable,
de: LesenDesArchivs,
uk: Читати архів,

source: History writable,
de: EinschreibungDesArchivs,
uk: Писати архів,

source: Semantic change,
de: Semantische Veränderungen,
uk: Семантичні зміни,

source: UserAccessLevel
de: ZugangsNiveauDesNutzers
uk: РівеньДоступуКорист

source: MinimumSamplingInterval
de: MinimIntervalBefragung
uk: МінімальнийІнтервалОпитування

source: Historizing
de: Archivierung
uk: Архівація

source: Executable
de: Ausgeübt
uk: Виконуваний

source: UserExecutable
de: AusgeübterNutzer
uk: ВиконуванийКорист

source: Error of the calculation template.
de: Fehler der Berechnungsvorlage.
uk: Помилка обчислення шаблону.

source: 1:Parameter disabled.
de: 1:Parameter abgeschaltet.
uk: 1:Параметр вимкнено.

source: 2:Acquisition stopped.
de: 2:Erwerb ist gestoppt.
uk: 2:Збір зупинено.

source: 10:Error of connection or no response.
de: 10:Verbindungsfehler oder keine Antwort.
uk: 10:Помилка з'єднання або немає відповіді.

source: Variables and it containers (Objects) list. All variables will put into the parameter attributes list. Variables write by separate lines in the form "{ns}:{id}[|[{flg}][|{id}[|{name}]]]". Where: ns - name space, number; zero value can be omitted; id - node identifier by number, string, bytes string and GUID; flg - flags of no requesting the metadata on the server: value type (b-Boolean,i-Integer,f-Float,s-String,o-Object), read/write mode (r-read, w-write); id - identifier of the created attribute; name - name of the created attribute. Example: 84 - root folder; 3:"BasicDevices2"||var - basic devices node in the name space 3 and the string view with the force attribute ID; 4:"61626364"||var|Variable - node in the names space 4 and the byte string view with the force attribute ID and name; 4:{40d95ab0-50d6-46d3-bffd-f55639b853d4}|irw|var|Variable - node in the names space 4 and the GUID view with no requesting the server metadata for RW Integer and the force attribute ID and name.
de: Liste von Variablen und Containern (Objekten). Alle Variablen werden in die Liste von Parameterattributen eingesetzt. Variablen schreiben durch separate Zeilen im Formular "{ns}:{id}[|[{flg}][|{id}[|{name}]]]". Wo: ns - Namenbereich, mit der Zahl; Nullwert kann ausgelassen sein; id - Bezeichner des Knotens, mit der Zahl, der Zeile, der Bytezeile oder dem GUID; flg - Flags für keine Anforderung der Metadaten auf dem Server: Werttyp (b-Boolean,i-Integer,f-Float,s-String,o-Object), Lese-/Schreib-modus (r-read, w-write); id - Bezeichner des gebildeten Attributs; name - Name des gebildeten Attributs. Beispiel: 84 - Wurzeldirektory; 3:"BasicDevices2"||var - Basisgeräte-Knoten im Namensraum 3 und die String-Ansicht mit dem Force-Attribut ID; 4:"61626364"||var|Variable - Knoten im Namensraum 4 und die Byte-String-Ansicht mit der Force-Attribut-ID und dem Namen; 4:{40d95ab0-50d6-46d3-bffd-f55639b853d4}|irw|var|Variable - Knoten im Namensraum 4 und der GUIDE-Ansicht, ohne die Server-Metadaten für RW Integer und die Force-Attribut-ID und den Namen anzufordern.
uk: Перелік змінних та контейнерів (Об'єктів). Всі змінні буде розташовано у переліку атрибутів параметру. Змінні записуються окремими рядками у формі "{ns}:{id}[|[{flg}][|{id}[|{name}]]]". Де: ns - простір імен, числом; нульове значення може бути опущено; id - ідентифікатор вузла, числом, рядком, рядком байт або GUID; flg - прапорці нездійснення запиту цільових даних на сервері: тип значення (b-Логічний,i-Ціле,f-Реальне,s-Рядок,o-Об'єкт), режим запису/читання (r-читати, w-писати); id - ідентифікатор атрибуту що створюється; name - ім'я атрибуту що створюється. Приклад: 84 - коренева тека; 3:"BasicDevices2"||var - вузол базових пристроїв у просторі імен 3 та у вигляді рядка із прямим ІД атрибуту; 4:"61626364"||var|Variable - вузол у просторі імен 4 та у вигляді рядка байт із прямим ІД та назвою атрибуту; 4:{40d95ab0-50d6-46d3-bffd-f55639b853d4}|irw|var|Variable - вузол у просторі імен 4 і у вигляді GUID із нездійсненням запиту цільових даних щодо Цілого Читання-Запису та прямим ІД і назвою атрибуту.

source: Node append
uk: Додати вузол

source: Special address format: OPC-UA node writes in the form "{ns}:{id}", where: ns - name space, number; zero value can be omitted; id - node identifier by number, string, bytes string and GUID. Examples: 84 - root directory; 3:"BasicDevices2" - basic devices node in the name space 3 and the string view; 4:"61626364" - node in the names space 4 and the byte string view; 4:{40d95ab0-50d6-46d3-bffd-f55639b853d4} - node in the names space 4 and the GUID view. Common address format:
de: Spezielles Adressformat: OPC-UA-Knoten schreibt in der Form "{ns}:{id}", wobei: ns - Namenbereich, mit der Zahl; Nullwert kann ausgelassen sein; id - Bezeichner des Knotens, mit der Zahl, der Zeile, der Bytezeile oder dem GUID. Beispiel: 84 - Wurzeldirektory; 3:"BasicDevices2" - Knoten der Basenanlagen im Namenbereich 3 und als eine Zeile; 4:"61626364" - Knoten im Namenbereich 4 und als Bytezeile; 4:{40d95ab0-50d6-46d3-bffd-f55639b853d4} - Knoten im Namenbereich 4 und als GUID. Gemeinsames Adressformat:
uk: Формат спеціальної адреси: OPC-UA вузол записується у формі "{ns}:{id}", де: ns - простір імен, числом; нульове значення може бути опущено; id - ідентифікатор вузла, числом, рядком, рядком байт або GUID. Приклад: 84 - коренева тека; 3:"BasicDevices2" - вузол базових пристроїв у області імен 3 та у вигляді рядка; 4:"61626364" - вузол у просторі імен 4 та у вигляді рядка байт; 4:{40d95ab0-50d6-46d3-bffd-f55639b853d4} - вузол у області імен 4 та у вигляді GUID. Формат загальної адреси:

source: Name
uk: Ім'я

source: To enable
de: Einschalten
uk: Вмикати

source: Serializer type
de: KodierungsTyp
uk: Тип кодування

source: Binary
de: Binär
uk: Бінарний

source: Security policies
de: Sicherheitspolitik
uk: Політика безпеки

source: Server certificate (PEM)
de: Zertifikat des Servers (PEM)
uk: Сертифікат серверу (PEM)

source: Server private key (PEM)
de: Privatschlüssel des Servers (PEM)
uk: Приватний ключ серверу (PEM)

source: Addition parameters
de: Zusatz Parametern
uk: Додаткові параметри

source: Search and create new server error.
de: Fehler der Suche und der Schaffung des neuen Servers.
uk: Помилка пошуку та створення нового серверу.

source: Server
uk: Сервер

source: Active secure channels
de: Aktive sichere Kanäle
uk: Активні канали безпеки

source: End points
de: Endknoten
uk: Кінцеві вузли

source: None
de: Keine
uk: Немає

source: Sign
de: Unterschrift
uk: Підпис

source: Sign&Encrypt
de: Unterschrift&Kodierung
uk: Підпис&Кодування

source: %u(token %u): %s(%s,%s) at %s(live %s); Sequence server %u, client %u; Request ID %u
de: %u(Token %u): %s(%s,%s) bei %s(lebende %s); Sequenzserver %u, Client %u; Anfrage-ID %u
uk: %u(токен %u): %s(%s,%s) від %s(живий %s); Послідовність серверу %u, клієнту %u; ІД Запиту %u

source: Disabled.
de: Ausgeschaltet.
uk: Вимкнено.

source: Enabled.
de: Eingeschaltet.
uk: Ввімкнено.

source: Requests %.4g. Subscription task period %s, time %s[%s].
de: Anfragen %.4g. Abonnement-Task-Zeitraum %s, Zeit %s[%s].
uk: Запитів %.4g. Підписка - період завдання %s, час %s[%s].

source: End point:
de: Endknoten:
uk: Кінцевий вузол:

source: State
de: Zustand
uk: Стан

source: Status
uk: Стан

source: Active sessions
de: Aktive Sitzungen
uk: Активні сеанси

source: Active subscriptions
de: Aktive Abonnements
uk: Активні підписки

source: Enabled
de: Aktiviert
uk: Ввімкнено

source: DB
uk: БД

source: Configuration
de: Konfiguration
uk: Конфігурація

source: Policy
de: Politik
uk: Політика

source: Message mode
de: Regime der Nachricht
uk: Режим повідомлення

source: Data
de: Daten
uk: Дані

source: Limits
uk: Ліміти

source: Subscriptions
de: Abonnements
uk: Підписки

source: Monitored items
de: Überwachte Elemente
uk: Елементи моніторингу

source: Retransmission queue time, sek.
de: Retransmission Warteschlangenzeit, sek.
uk: Час черги повторної передачі, сек.

source: Set to 0 for automatic by cntrKeepAlive*publInterv
de: 0 für die automatische Setzen von cntrKeepAlive*publInterv
uk: Встановити у 0 для автоматичного за cntrKeepAlive*publInterv

source: %d(%s): at %s(live %s), secure channel %u; Publish requests %u
de: %d(%s): bei %s(live %s), sicherer Kanal %u; Anfragen veröffentlichen %u
uk: %d(%s): від %s(живий %s), канал безпеки %u; Запити публікації %u

source: Closed
de: Geschlossen
uk: Закрите

source: Creating
de: Erstellen
uk: Створення

source: Normal
uk: Норма

source: Late
de: Spät
uk: Пізніш

source: KeepAlive
uk: УтриманняЖивим

source: %d: %s, session %d; Publish %s, interval %s, sequence %d, lifetime %d, keep alive %d; Monitored items %u; Retransmission queue %u
de: %d: %s, Sitzung %d; Veröffentlichen %s, Intervall %s, Sequenz %d, Lebensdauer %d, halten %d; Überwachte Elemente %u; Neuübertragungswarteschlange %u
uk: %d: %s, сеанс %d; Публікація %s, інтервал %s, послідовність %d, час життя %d, тримання живим %d; Елементи моніторингу %u; Черга повторного надсилання %u

source: Disabled
de: Deaktiviert
uk: Вимкнено

source: No present selected row.
de: Gewählte Zeile fehlt.
uk: Обраний рядок відсутній.

source: Client OPC-UA
de: Klient OPC-UA
uk: Клієнт OPC-UA

source: Roman Savochenko
de: Roman Savotschenko
uk: Роман Савоченко

source: Provides OPC-UA client service implementation.
de: Bietet OPC-UA Client-Service-Implementierung.
uk: Надає реалізацію OPC-UA клієнтського сервісу.

source: Server OPC-UA
uk: Сервер OPC-UA

source: Provides OPC-UA server service implementation.
de: Bietet OPC-UA Server-Service-Implementierung.
uk: Надає реалізацію OPC-UA сервісу серверу.
