Repository: aleax/openscada
Catalog: src/moduls/ui/VCAEngine/po/*.po
Languages: de, ru, uk

source: Enabled.
de: Aktiviert.
ru: Включен.
uk: Ввімкнено.

source: Disabled.
de: Deaktiviert.
ru: Выключен.
uk: Вимкнено.

source: Used %d.
de: Verwendet %d.
uk: Використано %d.

source: Date of modification %s.
de: Änderungsdatum %s.
uk: Дата модифікації %s.

source: Loading widgets library.
de: Widgetsbibliothek laden.
ru: Загрузка библиотеки виджетов.
uk: Завантаження бібліотеки віджетів.

source: Saving widgets library.
de: Widgetsbibliothek speichern.
ru: Сохранение библиотеки виджетов.
uk: Збереження бібліотеки віджетів.

source: Enabling the widgets library.
de: Widgetsbibliothek einschalten.
uk: Ввімкнення бібліотеки віджетів.

source: Disabling the widgets library.
de: Widgetsbibliothek abschalten.
uk: Вимкнення бібліотеки віджетів.

source: Error enabling/disabling widget '%s': %s.
de: Fehler beim Ein-/Abschaltens des Widgets '%s': %s.
ru: Ошибка включения/отключения виджета '%s': %s.
uk: Помилка ввімкнення/вимкнення віджету '%s': %s.

source: The widget '%s' is already present!
de: Das Widget '%s' ist bereits vorhanden!
ru: Виджет '%s' уже присутствует!
uk: Віджет '%s' вже присутній!

source: Widgets library:
de: Widgetsbibliothek:
ru: Библиотека виджетов:
uk: Бібліотека віджетів:

source: Widget
ru: Виджет
uk: Віджет

source: Library
de: Bibliothek
ru: Библиотека
uk: Бібліотека

source: State
de: Zustand
ru: Состояние
uk: Стан

source: Status
ru: Статус
uk: Статус

source: Enabled
de: Aktiviert
ru: Включен
uk: Включений

source: Library DB
de: Datenbank der Bibliothek
ru: БД библиотеки
uk: БД бібліотеки

source: Storage address in the format "{DB module}.{DB name}.{Table name}". To use the Generic Storage, set '*.*.{Table name}'.
de: Speicheradresse im Format "{DB-Modul}.{DB-Name}.{Table name}". Um den generischen Speicher zu verwenden, legen Sie '*.*.{Table name}' fest.
ru: Адрес хранилища в формате "{Модуль БД}.{Имя БД}.{Имя Таблицы}". Установить '*.*.{Имя Таблицы}' для использования Общего Хранилища.
uk: Адреса сховища у форматі "{Модуль БД}.{Ім'я БД}.{Ім'я Таблиці}". Встановити '*.*.{Ім'я Таблиці}' для використання Загального Сховища.

source: Remove from '%s'
de: Entfernen von '%s'
ru: Удалить из '%s'
uk: Видалити із '%s'

source: Date of modification
de: Änderungsdatum
ru: Дата модификации
uk: Дата модифікації

source: Used
de: Gebraucht
ru: Использован
uk: Використаний

source: Configuration
de: Konfig
ru: Конфигурация
uk: Конфігурація

source: Identifier
de: Identifikator
ru: Идентификатор
uk: Ідентифікатор

source: Name
ru: Имя
uk: Ім'я

source: Description
de: Beschreibung
ru: Описание
uk: Опис

source: Icon
ru: Иконка
uk: Іконка

source: Widgets
ru: Виджет
uk: Віджет

source: Resources
de: Ressourcen
ru: Ресурсы
uk: Ресурси

source: Data
de: Daten
ru: Данные
uk: Дані

source: Calculating procedure -
de: Berechnungsverfahren -
uk: Обчислювальна процедура -

source: !!redefined!!
de: !!neu definiert!!
ru: !!переопределена!!
uk: !!перевизначено!!

source: inherited
de: vererbt
ru: наследована
uk: успадковано

source: presented
de: vorgeführt
ru: представлена
uk: представлено

source: Enabling the widget.
de: Aktivierung des Widgets.
uk: Ввімкнення віджету.

source: Disabling the widget.
de: Deaktivieren des Widgets.
ru: Отключение виджета.
uk: Вимкнення віджету.

source: Widget is not container!
de: Widget ist kein Container!
ru: Виджет не контейнер!
uk: Віджет не контейнер!

source: Restoring '%s' from the base container!
de: Wiederherstellen von '%s' aus dem Basiscontainer!
ru: Восстановление '%s' из базового контейнера!
uk: Відновлення '%s' з базового контейнеру!

source: Library widget:
de: Bibliothekenwidget:
ru: Библиотечный виджет:
uk: Бібліотечний віджет:

source: Error enabling the inheriting widget '%s'.
de: Fehler beim Aktivieren des erbenden Widgets '%s'.
ru: Ошибка включения наследующего виджета '%s'.
uk: Помилка увімкнення наслідувального віджета '%s'.

source: Link to the widget '%s'.
de: Verknüpfen Sie mit dem Widget '%s'.
ru: Ссылка на виджет '%s'.
uk: Посилання на віджет '%s'.

source: Impossible deleting the base primitive-widget.
de: Fehler beim Löschens des Grundprimitivwidgets.
ru: Невозможно удаления базового виджета-примитива.
uk: Неможливе видалення базового віджету-примітиву.

source: Base widget '%s'.
de: Basis Widget '%s'.
ru: Базовый виджет '%s'.
uk: Базовий віджет '%s'.

source: Parent
de: Eltern
ru: Родитель
uk: Батько

source: Elementary figure
de: Elementarfigur
ru: Элементарная фигура
uk: Елементарна фігура

source: Widget of the elementary figure of the finite visualization.
de: Widget der elementaren Figur der endlichen Visualisierung.
ru: Виджет элементарной фигуры конечной визуализации.
uk: Віджет елементарної фігури кінцевої візуалізації.

source: Line: width
de: Linie: Stärke
ru: Линия: ширина
uk: Лінія: ширина

source: Line: color
de: Linie: Farbe
ru: Линия: цвет
uk: Лінія: колір

source: Line: style
de: Linie: Stil
ru: Линия: стиль
uk: Лінія: стиль

source: Solid;Dashed;Dotted
de: Durchgehend;Gestrichelt;Gepunktet
ru: Сплошная;Пунктир;Точечная
uk: Суцільна;Пунктир;Крапкова

source: Border: width
de: Rand: Breite
ru: Граница: ширина
uk: Границя: ширина

source: Border: color
de: Rand: Farbe
ru: Граница: цвет
uk: Границя: колір

source: Fill: color
de: Ausfüllen: Farbe
ru: Заполнение: цвет
uk: Заповнення: колір

source: Fill: image
de: Ausfüllen: Bild
ru: Заполнение: изображение
uk: Заповнення: зображення

source: Orientation angle
de: Drehwinkel
ru: Угол поворота
uk: Кут оберту

source: Mirroring
ru: Отражение
uk: Відображення

source: Elements list
de: Liste von Elementen
ru: Список элементов
uk: Перелік елементів

source: Attributes
de: Attribute
ru: Атрибуты
uk: Атрибути

source: The elements list can contain: line:({x}|{y}):({x}|{y})[:{width}[:{color}[:{bord_w}[:{bord_clr}[:{line_stl}]]]]] line:{p1}:{p2}[:w{n}[:c{n}[:w{n}[:c{n}[:s{n}]]]]] arc:({x}|{y}):({x}|{y}):({x}|{y}):({x}|{y}):({x}|{y})[:{width}[:{color}[:{bord_w}[:{bord_clr}[:{line_stl}]]]]] arc:{p1}:{p2}:{p3}:{p4}:{p5}[:w{n}[:c{n}[:w{n}[:c{n}[:s{n}]]]]] bezier:({x}|{y}):({x}|{y}):({x}|{y}):({x}|{y})[:{width}[:{color}[:{bord_w}[:{bord_clr}[:{line_stl}]]]]] bezier:{p1}:{p2}:{p3}:{p4}[:w{n}[:c{n}[:w{n}[:c{n}[:s{n}]]]]] fill:({x}|{y}):({x}|{y}):...:({x}|{y})[:{fill_clr}[:{fill_img}]] fill:{p1}:{p2}:...:{pN}[:c{n}[:i{n}]] Where: x, y - direct point (x,y), coordinate in float point pixels; p1 ... pN - dynamic point 1...n; width, bord_w - direct line and border width in float point pixels; w{n} - dynamic width 'n'; color, bord_clr, fill_clr - direct line, border and fill color name or 32bit code whith alpha: {name}[-{AAA}], #RRGGBB-AAA; c{n} - dynamic color 'n'; line_stl - direct line style: 0-Solid, 1-Dashed, 2-Dotted; s{n} - dynamic style 'n'; fill_img - direct image of the filling in the form "[{src}:]{name}", where: "src" - image source: file - directly from a local file by the path; res - from table of DB-mime resources. "name" - file path or mime-resource identifier. i{n} - dynamic image of the filling 'n'. For example: line:(50|25):(90.5|25):2:yellow:3:green:2 arc:(25|50):(25|50):1:4:(25|50)::#000000-0 fill:(25|50):(25|50):c2:i2 fill:(50|25):(90.5|25):(90|50):(50|50):#d3d3d3:h_31
de: Die Liste der Elemente enthalten kann: line:({x}|{y}):({x}|{y})[:{width}[:{color}[:{bord_w}[:{bord_clr}[:{line_stl}]]]]] line:{p1}:{p2}[:w{n}[:c{n}[:w{n}[:c{n}[:s{n}]]]]] arc:({x}|{y}):({x}|{y}):({x}|{y}):({x}|{y}):({x}|{y})[:{width}[:{color}[:{bord_w}[:{bord_clr}[:{line_stl}]]]]] arc:{p1}:{p2}:{p3}:{p4}:{p5}[:w{n}[:c{n}[:w{n}[:c{n}[:s{n}]]]]] bezier:({x}|{y}):({x}|{y}):({x}|{y}):({x}|{y})[:{width}[:{color}[:{bord_w}[:{bord_clr}[:{line_stl}]]]]] bezier:{p1}:{p2}:{p3}:{p4}[:w{n}[:c{n}[:w{n}[:c{n}[:s{n}]]]]] fill:({x}|{y}):({x}|{y}):...:({x}|{y})[:{fill_clr}[:{fill_img}]] fill:{p1}:{p2}:...:{pN}[:c{n}[:i{n}]] Wo: x, y - Gerade Punkt (x,y)-Koordinaten des Pixels floating point; p1 ... pN - dynamische Punkt 1 ... n; width, bord_w - linienbreite der Grenze, in Pixel, und schwimmt; w{n} - dynamische Breite 'n'; color, bord_clr, fill_clr - gerade Farbe, Rahmen und Füllung in Form eines Namens oder einer 32-Bit-Code mit alpha {name}[-{AAA}], #RRGGBB-AAA; c{n} - dynamische Farbe 'n'; line_stl - gerade Stil: 0-solid, 1-punktiert, 2-Punkt; s{n} - dynamischen Stil 'n'; fill_img - direktes Bild im Format füllen "[{src}%3A]{name}", wo: "src" - Bildquelle: file - direkt aus einer lokalen Datei auf den Weg; res - Tabelle of mime-Datenbank-Ressourcen. "name" - dateipfad oder Kennung mime-Ressource. i{n} - dynamisches Bild füllen 'n'. Zum Beispiel: line:(50|25):(90.5|25):2:yellow:3:green:2 arc:(25|50):(25|50):1:4:(25|50)::#000000-0 fill:(25|50):(25|50):c2:i2 fill:(50|25):(90.5|25):(90|50):(50|50):#d3d3d3:h_31
ru: Список элементов может содержать: line:({x}|{y}):({x}|{y})[:{width}[:{color}[:{bord_w}[:{bord_clr}[:{line_stl}]]]]] line:{p1}:{p2}[:w{n}[:c{n}[:w{n}[:c{n}[:s{n}]]]]] arc:({x}|{y}):({x}|{y}):({x}|{y}):({x}|{y}):({x}|{y})[:{width}[:{color}[:{bord_w}[:{bord_clr}[:{line_stl}]]]]] arc:{p1}:{p2}:{p3}:{p4}:{p5}[:w{n}[:c{n}[:w{n}[:c{n}[:s{n}]]]]] bezier:({x}|{y}):({x}|{y}):({x}|{y}):({x}|{y})[:{width}[:{color}[:{bord_w}[:{bord_clr}[:{line_stl}]]]]] bezier:{p1}:{p2}:{p3}:{p4}[:w{n}[:c{n}[:w{n}[:c{n}[:s{n}]]]]] fill:({x}|{y}):({x}|{y}):...:({x}|{y})[:{fill_clr}[:{fill_img}]] fill:{p1}:{p2}:...:{pN}[:c{n}[:i{n}]] Где: x, y - прямая точка (x,y), координаты в пикселах с плавающей точкой; p1 ... pN - динамические точки 1...n; width, bord_w - прямая ширина линии и бордюра в пикселах с плавающей точкой; w{n} - динамическая ширина 'n'; color, bord_clr, fill_clr - прямой цвет линии, бордюра и заполнения в виде имени или 32-битового кода с альфа: {имя}[-{AAA}], #RRGGBB-AAA; c{n} - динамический цвет 'n'; line_stl - прямой стиль линии: 0-Сплошная, 1-Пунктирная, 2-Точечная; s{n} - динамический стиль 'n'; fill_img - прямое изображение заполнения в формате "[{src}:]{name}]", где: "src" - источник изображения: file - непосредственно из локального файла по пути; res - из таблицы mime-ресурсов БД. "name" - путь файла или идентификатор mime-ресурса. i{n} - динамическое изображение заполнения 'n'. Например: line:(50|25):(90.5|25):2:yellow:3:green:2 arc:(25|50):(25|50):1:4:(25|50)::#000000-0 fill:(25|50):(25|50):c2:i2 fill:(50|25):(90.5|25):(90|50):(50|50):#d3d3d3:h_31
uk: Перелік елементів може містити: line:({x}|{y}):({x}|{y})[:{width}[:{color}[:{bord_w}[:{bord_clr}[:{line_stl}]]]]] line:{p1}:{p2}[:w{n}[:c{n}[:w{n}[:c{n}[:s{n}]]]]] arc:({x}|{y}):({x}|{y}):({x}|{y}):({x}|{y}):({x}|{y})[:{width}[:{color}[:{bord_w}[:{bord_clr}[:{line_stl}]]]]] arc:{p1}:{p2}:{p3}:{p4}:{p5}[:w{n}[:c{n}[:w{n}[:c{n}[:s{n}]]]]] bezier:({x}|{y}):({x}|{y}):({x}|{y}):({x}|{y})[:{width}[:{color}[:{bord_w}[:{bord_clr}[:{line_stl}]]]]] bezier:{p1}:{p2}:{p3}:{p4}[:w{n}[:c{n}[:w{n}[:c{n}[:s{n}]]]]] fill:({x}|{y}):({x}|{y}):...:({x}|{y})[:{fill_clr}[:{fill_img}]] fill:{p1}:{p2}:...:{pN}[:c{n}[:i{n}]] Де: x, y - пряма точка (x,y), координати у пікселях з плаваючою точкою; p1 ... pN - динамічні точки 1...n; width, bord_w - пряма ширина лінії та бордюру у пікселях з плаваючою точкою; w{n} - динамічна ширина 'n'; color, bord_clr, fill_clr - прямий колір лінії, бордюру та заповнення у вигляді назви або 32-бітного коду з альфа: {назва}[-{AAA}], #RRGGBB-AAA; c{n} - динамічний колір 'n'; line_stl - прямий стиль лінії: 0-Суцільна, 1-Пунктирна, 2-Точкова; s{n} - динамічний стиль 'n'; fill_img - пряме зображення заповнення у форматі "[{src}:]{name}", де: "src" - джерело зображення: file - безпосередньо з локального файлу за шляхом; res - з таблиці mime-ресурсів БД. "name" - шлях файлу або ідентифікатор mime-ресурсу. i{n} - динамічне зображення заповнення 'n'. Наприклад: line:(50|25):(90.5|25):2:yellow:3:green:2 arc:(25|50):(25|50):1:4:(25|50)::#000000-0 fill:(25|50):(25|50):c2:i2 fill:(50|25):(90.5|25):(90|50):(50|50):#d3d3d3:h_31

source: Point
de: Punkt
ru: Точка
uk: Точка

source: Width
de: Breite
ru: Ширина
uk: Ширина

source: Color
de: Farbe
ru: Цвет
uk: Колір

source: Image
de: Bild
ru: Изображение
uk: Зображення

source: Style
de: Stil
ru: Стиль
uk: Стиль

source: Form element
de: Formularelement
ru: Элементы формы
uk: Елемент форми

source: Form element widget of the finite visualization.
de: Formularelement Widget der endlichen Visualisierung.
ru: Виджет элемента формы конечной визуализации.
uk: Віджет елементу форми кінцевої візуалізації.

source: Element type
de: Typ des Elements
ru: Тип элемента
uk: Тип елементу

source: Line edit;Text edit;Check box;Button;Combo box;List;Tree;Table;Slider;Scroll Bar
de: Zeilenbearbeitung;Textbearbeitung;Check Box;Schaltfläche;Combo Box;Liste;Baum;Tabelle;Schieber;Schieberegler
ru: Строка редактирования;Текстовый редактор;Check Box;Кнопка;Combo Box;Список;Дерево;Таблица;Слайдер;Полоса прокрутки
uk: Стрічка редагув.;Текстовий редактор;Check Box;Кнопка;Combo Box;Перелік;Дерево;Таблиця;Слайдер;Стрічка прокрутки

source: Value
de: Wert
ru: Значение
uk: Значення

source: View
de: Ansicht
ru: Вид
uk: Вид

source: Text;Combo;Integer;Real;Time;Date;Date and time;Password
de: Text;Combo;Ganzzahl;Reelle Zahl;Uhrzeit;Datum;Datum und Uhrzeit;Passwort
ru: Текст;Combo;Целое;Вещественное;Время;Дата;Дата и время;Пароль
uk: Текст;Combo;Ціле;Реальне;Час;Дата;Дата та час;Пароль

source: Confirm
de: Bestätigen
ru: Подтверждать
uk: Підтверджувати

source: Font
de: Schrift
ru: Шрифт
uk: Шрифт

source: Word wrap
de: Zeichenumbruch
ru: Перенос слов
uk: Перенесення слів

source: Repeat
de: Wiederholen
ru: Повтор
uk: Повтор

source: Image
de: Bild
ru: Изображение
uk: Зображення

source: Color: button
de: Farbe: Taster
ru: Цвет: кнопка
uk: Колір: кнопка

source: Color: text
de: Farbe: Text
ru: Цвет: текст
uk: Колір: текст

source: Mode
de: Modus
ru: Режим
uk: Режим

source: Standard;Checkable;Menu;Load;Save
de: Standard;Checkable;Menü;Laden;Speichern
ru: Стандарт;Переключатель;Меню;Загрузка;Сохранение
uk: Стандарт;Перемикач;Меню;Завантаження;Збереження

source: Items
de: Elemente
ru: Элементы
uk: Елементи

source: Set value
de: Sollwert
ru: Установл. значение
uk: Встановл. значення

source: Multiple selection
de: Mehrfachauswahl
ru: Множественный выбор
uk: Множинний вибір

source: Check
de: Prüfung
ru: Выбор
uk: Вибір

source: File content
de: Datei-Inhalt
ru: Содержимое файла
uk: Вміст файлу

source: Enter text line by the template with the char items: 'A' - ASCII alphabetic character required. A-Z, a-z. 'a' - ASCII alphabetic character permitted but not required. 'N' - ASCII alphanumeric character required. A-Z, a-z, 0-9. 'n' - ASCII alphanumeric character permitted but not required. 'X' - Any character required. 'x' - Any character permitted but not required. '9' - ASCII digit required. 0-9. '0' - ASCII digit permitted but not required. 'D' - ASCII digit required. 1-9. 'd' - ASCII digit permitted but not required (1-9). '#' - ASCII digit or plus/minus sign permitted but not required. 'H' - Hexadecimal character required. A-F, a-f, 0-9. 'h' - Hexadecimal character permitted but not required. 'B' - Binary character required. 0-1. 'b' - Binary character permitted but not required. '>' - All following alphabetic characters are uppercased. '<' - All following alphabetic characters are lowercased. '!' - Switch off case conversion. '\' - Use to escape the special characters listed above to use them as separators.
de: Geben Sie den Text Zeile Template mit dem char Begriffe: 'A' - ASCII alphabetischen Zeichen erforderlich. Von A-Z, a-z. 'a' - ASCII alphabetischen Zeichen erlaubt, aber nicht erforderlich. 'N' - ASCII alphanumerische Zeichen erforderlich. A-Z, a-z, 0-9. 'n' - ASCII alphanumerische Zeichen erlaubt, aber nicht erforderlich. 'X' - Jedes Zeichen benötigt. 'x' - Jedes Zeichen erlaubt, aber nicht erforderlich. '9' - ASCII Ziffer erforderlich. 0-9. '0' - ASCII Ziffer erlaubt aber nicht erforderlich. 'D' - ASCII Ziffer erforderlich. 1-9. 'd' - ASCII Ziffer erlaubt aber nicht erforderlich (1-9). '#' - ASCII Ziffer oder Vorzeichen zulässig, aber nicht erforderlich. 'H' - Hexadezimale Zeichen erforderlich. A-F, a-f, 0-9. 'h' - Hexadezimale Zeichen erlaubt, aber nicht erforderlich. 'B' - Binärzeichenraten erforderlich. 0-1. 'b' - Binary Charakter erlaubt aber nicht erforderlich. '>' - Alle folgenden Buchstaben sind Großbuchstaben. '<' - Alle folgenden Buchstaben sind kleingeschrieben. '!' - Schalten Sie Groß-/Kleinumschaltung. '\' - Verwenden Sie die Sonderzeichen oben aufgeführten sie als Trennzeichen verwenden zu entkommen.
ru: Ввод строки текста по шаблону с символьными элементами: 'A' - Необходим ASCII алфавитный символ. A-Z, a-z. 'a' - Разрешён но не необходим ASCII алфавитный символ. 'N' - Необходим ASCII алфавитно-цифровой символ. A-Z, a-z, 0-9. 'n' - Разрешён но не необходим ASCII алфавитно-цифровой символ. 'X' - Необходим любой символ. 'x' - Разрешён но не необходим любой символ. '9' - ASCII цифра необходима. 0-9. '0' - ASCII цифра разрешена но не необходима. 'D' - ASCII цифра необходима. 1-9. 'd' - ASCII цифра разрешена но не необходима (1-9). '#' - ASCII цифра или знаки плюс/минус разрешены но не необходимы. 'H' - Необходим символ шестнадцатеричного числа. A-F, a-f, 0-9. 'h' - Разрешён но не необходим символ шестнадцатеричного числа. 'B' - Необходим бинарный символ. 0-1. 'b' - Разрешён но не необходим бинарный символ. '>' - Все следующие алфавитные символы в верхнем регистре. '<' - Все следующие алфавитные символы в нижнем регистре. '!' - Выключение преобразования регистра. '\' - Используйте в разделителях для экранирования специальных символов, которые перечислены.
uk: Ввід рядка тексту за шаблоном з символьними елементами: 'A' - Потрібен ASCII алфавітний символ. A-Z, a-z. 'a' - Дозволено але не потрібно ASCII алфавітний символ. 'N' - Потрібен ASCII алфавітно-цифровий символ. A-Z, a-z, 0-9. 'n' - Дозволено але не потрібно ASCII алфавітно-цифровий символ. 'X' - Потрібен будь який символ. 'x' - Дозволено але не потрібно будь який символ. '9' - Потрібна ASCII цифра. 0-9. '0' - Дозволено але не потрібно ASCII цифра. 'D' - Потрібна ASCII цифра. 1-9. 'd' - Дозволено але не потрібно ASCII цифра (1-9). '#' - Дозволено але не потрібно ASCII цифра або знаки плюс/мінус. 'H' - Потрібно символ шістнадцяткового числа. A-F, a-f, 0-9. 'h' - Дозволено але не потрібно символ шістнадцяткового числа. 'B' - Потрібен бінарний символ. 0-1. 'b' - Дозволено але не потрібно бінарний символ. '>' - Всі наступні алфавітні символи у верхньому регістрі. '<' - Всі наступні алфавітні символи у нижньому регістрі. '!' - Виключення перетворення регістру. '\' - Використовуйте у поділювачах для екранування спеціальних символів, які перелічено вище.

source: List of values the editable combobox by lines.
de: Liste der Werte der bearbeitbaren ComboBox durch Linien.
ru: Список значений редактируемого комбо-бокса по строкам.
uk: Перелік значень комбобоксу для редагування, за рядками.

source: Integer value configuration in the form: "{Min}:{Max}:{ChangeStep}:{Prefix}:{Suffix}".
de: Integer-Wert-Konfiguration in Form: "{Min}:{Max}:{ChangeStep}:{Prefix}:{Suffix}".
ru: Значение целого числа в форме: "{Минимум}:{Максимум}:{ШагИзменения}:{Префикс}:{Суффикс}".
uk: Значення цілого числа у формі: "{Мінімум}:{Максимум}:{КрокЗміни}:{Префікс}:{Суфікс}".

source: Real value configuration in the form: "{Min}:{Max}:{ChangeStep}:{Prefix}:{Suffix}:{SignsAfterDot}".
de: Realer-Wert-Konfiguration in Form: "{Min}:{Max}:{ChangeStep}:{Prefix}:{Suffix}:{SignsAfterDot}".
ru: Значение вещественного числа в форме: "{Минимум}:{Максимум}:{ШагИзменения}:{Префикс}:{Суффикс}:{ЗнаковПослеТочки}".
uk: Значення реального числа у формі: "{Мінімум}:{Максимум}:{КрокЗміни}:{Префікс}:{Суфікс}:{ЗнаківПісляТочки}".

source: Enter date and/or time by the template with the items: "d" - number of the day (1-31); "dd" - number of the day (01-31); "ddd" - acronym of the day ('Mon' ... 'Sun'); "dddd" - the full name of the day ('Monday' ... 'Sunday'); "M" - number of the month (1-12); "MM" - number of the month (01-12); "MMM" - acronym of the month ('Jan' ... 'Dec'); "MMMM" - the full name of the month ('January' ... 'December'); "yy" - the last two digits of the year; "yyyy" - the full year; "h" - hour (0-23); "hh" - hour (00-23); "m" - minutes (0-59); "mm" - minutes (00-59); "s" - seconds (0-59); "ss" - seconds (00-59); "AP,ap" - to display AM/PM or am/pm.
de: Geben Sie Datum und / oder Zeit durch Vorlage mit den Elementen: "d" - Zahl am Tag (1-31); "dd" - Zahl am Tag (01-31); "ddd" - Abkürzung am Tag ('Mo' ... 'Son'); "dddd" - den vollständigen Namen am Tag ('Montag' ... 'Sonntag'); "M" - Zahl im Monat (1-12); "MM" - Zahl im Monat (01-12); "MMM" - Abkürzung im Monat ('Jan ' ... 'Dec '); "MMMM" - der vollständige Name im Monat ('Januar' ... 'Dezember'); "yy" - letzten beiden Ziffern des Jahres; "yyyy" - ganzes Jahr; "h" - Stunde (0-23); "hh" - Stunde (00-23); "m" - Minuten (0-59); "mm" - Minuten (00-59); "s" - Sekunden (0-59); "ss" - Sekunden (00-59); "AP,ap" - auf AM/PM-Anzeige oder am/pm.
ru: Ввод даты и/или времени по шаблону с элементами: "d" - номер дня (1-31); "dd" - номер дня (01-31); "ddd" - сокращённое наименование дня ('Mon' ... 'Sun'); "dddd" - полное наименование дня ('Monday' ... 'Sunday'); "M" - номер месяца (1-12); "MM" - номер месяца (01-12); "MMM" - сокращённое наименование месяца ('Jan' ... 'Dec'); "MMMM" - полное наименование месяца ('January' ... 'December'); "yy" - последние две цифры года; "yyyy" - год полностью; "h" - час (0-23); "hh" - час (00-23); "m" - минуты (0-59); "mm" - минуты (00-59); "s" - секунды (0-59); "ss" - секунды (00-59); "AP,ap" - отображать AM/PM или am/pm.
uk: Ввід дати та/або часу за шаблоном з елементами: "d" - номер дня (1-31); "dd" - номер дня (01-31); "ddd" - скорочене найменування дня ('Mon' ... 'Sun'); "dddd" - повне найменування дня ('Monday' ... 'Sunday'); "M" - номер місяця (1-12); "MM" - номер місяця (01-12); "MMM" - скорочене найменування місяця ('Jan' ... 'Dec'); "MMMM" - повне найменування місяця ('January' ... 'December'); "yy" - останні дві цифри року; "yyyy" - рік повністю; "h" - година (0-23); "hh" - година (00-23); "m" - хвилини (0-59); "mm" - хвилини (00-59); "s" - секунди (0-59); "ss" - секунди (00-59); "AP,ap" - відображати AM/PM або am/pm.
