Repository: aleax/openscada
Catalog: src/moduls/ui/VCAEngine/po/*.po
Languages: de, ru, uk

source: Image name in the form "[{src}:]{name}", where: "src" - image source: file - directly from a local file by the path; res - from table of DB-mime resources. "name" - file path or mime-resource identifier. Examples: "res:backLogo" - from the table of DB-mime resources for the ID "backLogo"; "backLogo" - like to the previous; "file:/var/tmp/backLogo.png" - from a local file by the path "/var/tmp/backLogo.png".
de: Bildname in Form "[{src}:]{name}", Wo: "src" - Bildquelle: file - direkt vom lokalen Dateisystem von Pfad; res - von DB Mime Ressourcen-Tabelle. "name" - Dateipfad oder Ressource Mime Id. Beispiele: "res:backLogo" - von DB Mime Ressourcen-Tabelle für Id "backLogo"; "backLogo" - wie frühere; "file:/var/tmp/backLogo.png" - von der lokalen Datei-Pfad "/var/tmp/backLogo.png".
ru: Имя изображения в форме "[{src}:]{name}", где: "src" - источник изображения: file - прямо из локального файла по пути; res - из таблицы mime-ресурсов БД. "name" - путь файла или идентификатор mime-ресурса. Примеры: "res:backLogo" - из таблицы mime-ресурсов БД для идентификатора "backLogo"; "backLogo" - как и предыдущий; "file:/var/tmp/backLogo.png" - из локального файла по пути "/var/tmp/backLogo.png".
uk: Ім'я зображення у формі "[{src}:]{name}", де: "src" - джерело зображення: file - безпосередньо з локального файлу за шляхом; res - з таблиці mime-ресурсів БД. "name" - шлях файлу або ідентифікатор mime-ресурсу. Приклади: "res:backLogo" - з таблиці mime-ресурсів БД для ідентифікатору "backLogo"; "backLogo" - як і попередній; "file:/var/tmp/backLogo.png" - з локального файлу за шляхом "/var/tmp/backLogo.png".

source: Color name in the form "{color}[-{alpha}]", where: "color" - standard color name or its numeric representation "#RRGGBB"; "alpha" - alpha-channel level [0...255], where 0 - fully transparent. Examples: "red" - solid red color; "#FF0000" - solid red color by the numeric representation; "red-127" - half transparent red color.
de: Nennen Sie die Farben in der Form "{color}[-{alpha}]", wo: "color" - Standardfarbname oder seine numerische Darstellung "#RRGGBB"; "alpha" - die Höhe der alpha [0...255], wobei 0 - Voll transparent. Beispiele: "red" - die durchgezogene rote Farbe; "#FF0000" - die durchgezogene rote Farbe in digitaler Form; "red-127" - durchscheinend rot.
ru: Имя цвета в виде "{color}[-{alpha}]", где: "color" - стандартное имя цвета или числовое представление "#RRGGBB"; "alpha" - уровень альфа-канала [0...255], где 0 - полностью прозрачный. Примеры: "red" - сплошной красный цвет; "#FF0000" - сплошной красный цвет в числовом коде; "red-127" - полупрозрачный красный цвет.
uk: Назва кольору у вигляді "{color}[-{alpha}]", де: "color" - стандартна назва кольору або його чисельне представлення "#RRGGBB"; "alpha" - рівень альфа-каналу [0...255], де 0 - повністю прозорий. Приклади: "red" - суцільний червоний колір; "#FF0000" - суцільний червоний колір у чисельному вигляді; "red-127" - напівпрозорий червоний колір.

source: Font name in the form "{family} {size} {bold} {italic} {underline} {strike}", where: "family" - font family, for spaces use symbol '_', like to: "Arial", "Courier", "Times_New_Roman"; "size" - font size in pixels; "bold" - font bold (0 or 1); "italic" - font italic (0 or 1); "underline" - font underlined (0 or 1); "strike" - font striked (0 or 1). Examples: "Arial 10 1 0 0 0" - Arial font, size 10 pixels and bolded.
de: Der Name der Schrift in Form von "{family} {size} {bold} {italic} {underline} {strike}", wo: "family" - Die Schriftfamilie, die Lücken nutzen '_' Symbol, z. B.: "Arial", "Courier", "Times_New_Roman"; "size" - Schriftgröße in Pixel; "bold" - Erhöhung der Schriftgröße (0 oder 1); "italic" - Kursivschrift (0 oder 1); "underline" - Unterstreichen font (0 oder 1); "strike" - Durchgestrichener Schrift (0 oder 1). Beispiele: "Arial 10 1 0 0 0" - Arial Schrift größe 10 Pixel und verstärkt.
ru: Имя шрифта в виде "{family} {size} {bold} {italic} {underline} {strike}", где: "family" - семейство шрифта, для пробелов используйте символ '_', вроде: "Arial", "Courier", "Times_New_Roman"; "size" - размер шрифта в пикселах; "bold" - усиление шрифта (0 или 1); "italic" - наклонность шрифта (0 или 1); "underline" - подчёркивание шрифта (0 или 1); "strike" - перечёркивание шрифта (0 или 1). Примеры: "Arial 10 1 0 0 0" - Arial шрифт, размером 10 пикселов и усиленный.
uk: Назва шрифту у формі "{family} {size} {bold} {italic} {underline} {strike}", де: "family" - родина шрифту, для відступів використовуйте символ '_', типу: "Arial", "Courier", "Times_New_Roman"; "size" - розмір шрифту у пікселах; "bold" - підсилення шрифту (0 або 1); "italic" - нахил шрифту (0 або 1); "underline" - підкреслення шрифту (0 або 1); "strike" - перекреслення шрифту (0 або 1). Приклади: "Arial 10 1 0 0 0" - Arial шрифт, розміром 10 пікселів та підсилений.

source: Widget:
ru: Виджет:
uk: Віджет:

source: Go to the parent
de: Gehe zum Elternteil
ru: Перейти к родителю
uk: Перейти до батька

source: Clear the widget changes
de: Zurücksetzen Änderungen
ru: Очистка изменений виджета
uk: Очищення змін віджету

source: Lower down the widget changes to its parent
de: Verringern Sie das Widget nach unten zu seinem übergeordneten Element
ru: Опустить изменения виджета его предку
uk: Опустити зміни віджету до його предка

source: Included widgets
de: Enthaltene Widgets
ru: Вложенные виджеты
uk: Вкладенні віджети

source: Widget '%s' is already present!
de: Widget '%s' ist bereits vorhanden!
ru: Виджет '%s' уже присутствует!
uk: Віджет '%s' вже присутній!

source: Path to the widget.
de: Pfad zum Widget.
ru: Путь к этому виджету.
uk: Шлях до цього віджету.

source: Path to the parent widget.
de: Pfad zum übergeordneten Widget.
ru: Путь к родительскому виджету.
uk: Шлях до батьківського віджету.

source: Owner and groups (separated by ',') of the widget in the form "{owner}:{groups}".
de: Das Widget Eigentümer und die Gruppen (getrennt durch ',') in Form "{owner}:{groups}".
ru: Владелец и группы (разделённые ',') виджета в форме "{владелец}:{группы}".
uk: Власник та групи (поділені ',') віджету у формі "{власник}:{групи}".

source: Widget permission in the form "{user}{group}{other}". Where, "user", "group" and "other" is: "__" - no access; "R_" - read only; "RW" - read and write.
de: Die Erlaubnis, das Widget in Form "{user}{group}{other}". Wo "user", "group" und "other" ist: "__" - keine Zugangsdaten; "R_" - nur lesen; "RW" - lesen und schreiben.
ru: Права доступа к виджету в форме "{польз.}{группа}{другие}". Где "польз.", "группа" и "другие" это: "__" - нет доступа; "R_" - только на чтение; "RW" - чтение и запись.
uk: Права доступу до віджету у формі "{корист.}{група}{інші}". Де "корист.", "група" та "інші" це: "__" - немає доступу; "R_" - тільки для читання; "RW" - читання та запис.

source: Direct events processing for manipulating pages in the form: "{event}:{evSrc}:{com}:{prm}". Where: "event" - waiting event; "evSrc" - event source; "com" - command of the session (open, next, prev); "prm" - command parameter, where used: pg_so - direct name of the desired page, with the prefix; 1 - name of a new page in the common path, without a prefix; * - the page name is taken from the name of the previous open page; $ - indicates the position of the relative selection of the page to open. Examples: ws_BtPress:/prev:prev:/pg_so/*/*/$ ws_BtPress:/next:next:/pg_so/*/*/$ ws_BtPress:/go_mn:open:/pg_so/*/mn/* ws_BtPress:/go_graph:open:/pg_so/*/ggraph
de: Direkte Verarbeitung Ereignisse für Seiten Manipulation in Form: "{event}:{evSrc}:{com}:{prm}". Wo: "event" - Warten Veranstaltung; "evSrc" - Ereignisquelle; "com" - Kommando über eine Sitzung (open, next, prev); "prm" - Befehlsparameter, wo verwendet: pg_so - direkten Namen der gewünschten Seite mit dem Präfix; 1 - Namen einer neuen Seite in allgemeiner Weise, ohne Präfix; * - die Seite ist aus dem Namen einer Seite zurück genommen; $ - Punkte an die Stelle der geöffneten Seite relativ. Beispiele: ws_BtPress:/prev:prev:/pg_so/*/*/$ ws_BtPress:/next:next:/pg_so/*/*/$ ws_BtPress:/go_mn:open:/pg_so/*/mn/* ws_BtPress:/go_graph:open:/pg_so/*/ggraph
ru: Прямая обработка событий для управления страницами в форме: "{event}:{evSrc}:{com}:{prm}". Где: "event" - ожидаемое событие; "evSrc" - источник события; "com" - команда сеанса (open, next, prev); "prm" - параметр команды, где используется: pg_so - прямое имя желаемой страницы, с префиксом; 1 - имя новой страницы в общем пути, без префикса; * - имя страницы берётся из имени предыдущей страницы; $ - указывает на место относительно которого открывается страница. Примеры: ws_BtPress:/prev:prev:/pg_so/*/*/$ ws_BtPress:/next:next:/pg_so/*/*/$ ws_BtPress:/go_mn:open:/pg_so/*/mn/* ws_BtPress:/go_graph:open:/pg_so/*/ggraph
uk: Пряма обробка подій для маніпуляцій сторінками у формі: "{event}:{evSrc}:{com}:{prm}". Де: "event" - очікувана подія; "evSrc" - джерело події; "com" - команда сеансу (open, next, prev); "prm" - параметр команди, де використовується: pg_so - пряме ім'я бажаної сторінки, з префіксом; 1 - ім'я нової сторінки у загальному шляху, без префіксу; * - ім'я сторінки береться з ім'я попередньої відкритої сторінки; $ - вказує на позицію відносного вибору сторінки для відкриття. Приклади: ws_BtPress:/prev:prev:/pg_so/*/*/$ ws_BtPress:/next:next:/pg_so/*/*/$ ws_BtPress:/go_mn:open:/pg_so/*/mn/* ws_BtPress:/go_graph:open:/pg_so/*/ggraph

source: Primitive identifier that underlie the widget.
de: Primitive Kennung, die dem Widget zugrunde liegt.
ru: Идентификатор примитива в основе этого виджета.
uk: Ідентифікатор примітиву у основі віджету.

source: Context menu in the form of the strings list: "{ItName}:{Signal}". Where: "ItName" - item name; "Signal" - signal name, where the result signal name is "usr_{Signal}".
de: Kontextmenü in Form Strings Liste "{ItName}:{Signal}". Wo: "ItName" - Elementnamen; "Signal" - Signal Namen und Ergebnis ist "usr_{Signal}".
ru: Контекстное меню в форме списка строк: "{ItName}:{Signal}". Где: "ItName" - имя элемента; "Signal" - имя сигнала, где результирующее имя сигнала: "usr_{Signal}".
uk: Контекстне меню у формі переліку рядків: "{ItName}:{Signal}". Де: "ItName" - ім'я елементу; "Signal" - ім'я сигналу, де результуюче ім'я сигналу "usr_{Signal}".

source: Links
ru: Связи
uk: Зв'язки

source: Show attributes
de: Attribute anzeigen
ru: Показывать атрибуты
uk: Показувати атрибути

source: Custom
de: Benutzerdefiniert
ru: Раздельно
uk: Розділено

source: Work area
de: Arbeitsbereich
ru: Рабочая область
uk: Робоче середовище

source: Calculation
de: Berechnung
ru: Вычисление
uk: Обчислення

source: Period of the calculating, milliseconds
ru: Период вычисления, миллисекунд
uk: Період обчислення, мілісекунд.

source: Use -1 (< 0) if you want to use the parent widget/page/project calculating period.
ru: Используйте -1 (< 0) если желаете использования родительской периодичности вычисления виджета/страницы/проекта.
uk: Використовуйте -1 (< 0) якщо бажаєте використання батьківського періоду обчислення віджету/сторінки/проєкту.

source: Procedure language
de: Verfahrenssprache
ru: Язык процедуры
uk: Мова процедури

source: Select the blank language to reset the widget procedure and language to the parent widget.
de: Wählen Sie die leere Sprache das Widget Verfahren und Sprache auf das übergeordnete Widget zurückgesetzt werden.
ru: Выберите пустой язык для сброса процедуры и языка виджета к родительскому виджету.
uk: Оберіть порожню мову для скидання процедури та мови віджету до батьківського віджету.

source: Procedure
de: Verfahren
ru: Процедура
uk: Процедура

source: New attribute
de: Neues Attribut
ru: Новый атрибут
uk: Новий атрибут

source: Unable to delete non-user attribute '%s'.
de: Das Nichtbenutzerattribut '%s' konnte nicht gelöscht werden.
ru: Невозможно удаление непользовательского атрибута '%s'.
uk: Неможливе видалення некористувацького атрибуту '%s'.

source: Unable to change non-user attribute '%s'.
de: Das Nichtbenutzerattribut '%s' konnte nicht geändert werden.
ru: Невозможно изменение непользовательского атрибута '%s'.
uk: Неможлива зміна некористувацького атрибуту '%s'.

source: The new attribute identifier is empty!
de: Die neue Attributkennung ist leer!
ru: Новый идентификатор атрибута пуст!
uk: Ідентифікатор нового атрибуту порожній!

source: The new attribute identifier '%s' is already present!
de: Die neue Attributkennung '%s' ist bereits vorhanden!
ru: Новый идентификатор атрибута '%s' уже присутствует!
uk: Новий ідентифікатор атрибуту '%s' вже присутній!

source: Boolean
de: Logisch
ru: Логический
uk: Логічний

source: Integer
de: Ganzzahl
ru: Целый
uk: Цілий

source: Real
de: Reelle Zahl
ru: Вещественный
uk: Реальний

source: String
de: Text
ru: Строка
uk: Рядок

source: String (translate)
de: Zeichenfolge (übersetzen)
ru: Строка (перевод)
uk: Рядок (переклад)

source: Object
de: Objekt
ru: Объект
uk: Об'єкт

source: Integer numbers selection
de: Integer-Zahlen Auswahl
ru: Выбор целых чисел
uk: Вибір цілих чисел

source: Real numbers selection
de: Reelle Zahlen Auswahl
ru: Выбор вещественных чисел
uk: Вибір реальних чисел

source: Strings selection
de: Strings Auswahl
ru: Выбор строк
uk: Вибір рядків

source: Text (translate)
de: Text (übersetzen)
ru: Текст (перевод)
uk: Текст (переклад)

source: DateTime
de: DatumZeit
ru: ДатаВремя
uk: ДатаЧас

source: Address
de: Adresse
ru: Адрес
uk: Адреса

source: No
de: Nein
ru: Нет
uk: Немає

source: Constant
de: Konstante
ru: Постоянная
uk: Стала

source: Input link
de: Eingangslink
ru: Входная связь
uk: Вхідний зв'язок

source: Output link
de: Ausgangslink
ru: Выходная связь
uk: Вихідний зв'язок

source: Full link
de: Voller Link
ru: Полная связь
uk: Повний зв'язок

source: From style
de: Aus dem Stil
ru: Из стиля
uk: Зі стилю

source: Element type is not selective!
de: Elemententyp ist nicht ausgewählt!
ru: Элемент не выборного типа!
uk: Елемент не вибіркового типу!

source: Connects to the attribute '%s' is more than %d!
de: Verbindungen an das Attribut '%s' mehr als %d!
ru: Подключений к атрибуту '%s' более %d!
uk: Підключень до атрибуту '%s' більш за %d!

source: Disconnects from the attribute '%s' more than connections!
de: Entfernen vom Attribut '%s' mehr Verbindungen!
ru: Отключений от атрибута '%s' больше подключений!
uk: Відключень від атрибуту '%s' більш за підключень!

source: Root primitive
de: Ursprungsprimitiv
ru: Корневой примитив
uk: Кореневий примітив

source: Abstract root primitive
de: Abstraktes Ursprungsprimitiv
ru: Абстрактный корневой примитив
uk: Абстрактний кореневий примітив

source: Session user
de: Sitzungsbenutzer
ru: Пользователь сеанса
uk: Користувач сеансу

source: Returns the session user by the session widget path.
de: Gibt Sitzungsbenutzer über Sitzungs Widget Pfad zurück.
ru: Возвращает пользователя сеанса по пути к виджету сеанса.
uk: Повертає користувача сеансу за шляхом віджета сеансу.

source: List
de: Liste
ru: Список
uk: Перелік

source: Widgets list
de: Liste der Widgets
ru: Список виджетов
uk: Перелік віджетів

source: Returns a list of the widgets, into the widgets container, or the child list. If set <pg> then returns the pages list for projects and sessions.
de: Gibt eine Liste der Widgets in den Widgetcontainer oder die untergeordnete Liste zurück. Wenn Sie <pg> festlegen, wird die Seitenliste für Projekte und Sitzungen zurückgegeben.
ru: Возвращает список виджетов, в контейнере виджетов, или дочерних виджетов. Если установлено <pg>, то возвращается список страниц проектов и сеанса.
uk: Повертає перелік віджетів, у контейнері віджетів, або дочірніх віджетів. Якщо встановлено <pg>, то повертається перелік сторінок проєктів та сеансу.

source: Node presence
de: Knotenpräsenz
ru: Присутствие узла
uk: Присутність вузлу

source: Checking for the node presence, including widgets, attributes and other.
de: Überprüfen auf die Knotenpräsenz, einschließlich Widgets, Attribute und andere.
ru: Проверка узла на присутствие, включая виджеты, атрибуты и другие.
uk: Перевірка вузла на присутність, включаючи віджети, атрибути та інше.

source: Not user
de: Nicht Benutzer
ru: Без пользовательских
uk: Без користувацьких

source: Attributes list
de: Attributenliste
ru: Список атрибутов
uk: Перелік атрибутів

source: Returns an attributes list of the widget. If set <noUser> then returns only not user attributes.
de: Gibt die Attributenliste des Widgets zurück. Wenn <noUser> aktiviert ist, werden nur nicht-benutzerdefinierte Attribute zurückgeliefert.
ru: Возвращает список атрибутов виджета. Если установлен <noUser> тогда возвращаются только не пользовательские атрибуты.
uk: Повертає перелік атрибутів віджету. Якщо встановлено <noUser> тоді повертаються тільки атрибути не користувача.

source: Attribute
de: Attribut
ru: Атрибут
uk: Атрибут

source: Get the attribute
de: Holen Sie sich das Attribut
ru: Получить атрибут
uk: Отримати атрибут

source: Getting value of the widget attribute. The request can be done as by indicating the full address of the attribute in <addr>, and by: indicating separately the address of the widget in <addr> and the the attribute identifier in the <attr>.
de: Wert des Widgetattributs ermitteln. Die Anfrage kann erfolgen, indem die vollständige Adresse des Attributs in <addr> angegeben wird, und indem: die Adresse des Widget in <addr> und die Attributkennung in <attr> separat angegeben werden.
ru: Запрос значения атрибута виджета. Запрос может осуществляться как указанием полного адреса атрибута в <addr>, так и: отдельно адрес виджета в <addr> и идентификатор атрибута в <attr>.
uk: Отримання значення атрибуту віджета. Запит може здійснюватися як указанням повної адреси атрибуту у <addr>, так і окремо: адресу віджету у <addr> та ідентифікатор атрибута у <attr>.

source: Set the attribute
de: Legen Sie das Attribut fest
ru: Установить атрибут
uk: Встановити атрибут

source: Setting value of the widget attribute. Setting can be done as by indicating the full address of the attribute in <addr>, and by: indicating separately the address of the widget in <addr> and the the attribute identifier in the <attr>.
de: Einstellwert des Widget-Attributs. Einstellwert kann erfolgen, indem die vollständige Adresse des Attributs in <addr> angegeben wird, und indem: die Adresse des Widget in <addr> und die Attributkennung in <attr> separat angegeben werden.
ru: Установка значения атрибута виджета. Установка может осуществляться как указанием полного адреса атрибута в <addr>, так и: отдельно адрес виджета в <addr> и идентификатор атрибута в <attr>.
uk: Встановлення значення атрибуту віджета. Встановлення може здійснюватися як указанням повної адреси атрибуту у <addr>, так і окремо: адресу віджету у <addr> та ідентифікатор атрибута у <attr>.

source: Used: %d.
ru: Использовано: %d.

source: Date of modification: %s.
ru: Дата модификации: %s.

source: Enabling widgets library.
ru: Включение библиотеки виджетов.

source: Disabling widgets library.
ru: Отключение библиотеки виджетов.

source: Calculating procedure:
ru: Вычислительная процедура:

source: Spent time on the branch:
ru: Затрачено времени на ветвь:

source: the item:
ru: элемент:

source: Closing the file %d error '%s (%d)'!
de: Schließen der Datei %d Fehler '%s (%d)'!

source: Closing the pipe %p error '%s (%d)'!
de: Schließen der Pipe %p Fehler '%s (%d)'!

source: Periodic processing %s%s.
de: Periodische Verarbeitung %s%s.

source: DISABLED
de: DEAKTIVIERT

source: , from the procedure
de: , aus dem Verfahren

source: Processing%s.
de: Verarbeitung%s.

source: , no procedure
de: , kein Verfahren

source: Periodic processing, milliseconds
de: Periodische Verarbeitung, Millisekunden

source: Use 0 if you want the session period processing, -1 if you want to use the parent widget/page/project processing period in the cascade, -2 for disable the periodic processing in whole.
de: Verwenden Sie 0, wenn Sie die Verarbeitung des Sitzungszeitraums wünschen, -1, wenn Sie das übergeordnete Widget/Seite/Projekt Bearbeitungszeitraum in der Kaskade verwenden möchten, -2 zum Deaktivieren der periodischen Verarbeitung insgesamt.

source: The name's rows after the first one treat as help.
de: Die Namenszeilen nach der ersten behandeln als Hilfe.
