Repository: aleax/openscada
Catalog: src/moduls/ui/VCAEngine/po/*.po
Languages: de, ru, uk

source: EMPTY and the "main" group is meant of using this page as the Root-main page, so such ones will replace other Root-main pages. The "fl" group is meant of using in the "fly" windows which are suitable for multiple open and must not be traced for doubles. All other are meant for including to the containers-boxes or single opening, so they forced in checking for doubles when the last one will be opened and the previous ones be closed.
de: EMPTY und die Gruppe "main" sollen diese Seite als Root-Hauptseite verwenden, sodass diese andere Root-Hauptseiten ersetzen. Die "fl" Gruppe ist für die Verwendung in den "fly"-Fenstern gedacht, die für mehrfaches Öffnen geeignet sind und nicht für Doppel verfolgt werden dürfen. Alle anderen sind für die Aufnahme in die Container-Boxen oder Einzelöffnungen gedacht, so dass sie gezwungen sind, auf Doppel zu prüfen, wann die letzte geöffnet und die vorherigen geschlossen werden.
ru: ПУСТАЯ и "main" группа предусматривает использование этой страницы как Корневую-основную страницу, т.е. такая будет заменять другие Корневые-главные страницы. Группа "fl" предназначена для использования во внешних окнах, которые предусмотрены для многоразового одновременного открытия и которые не должны отслеживаться на дубликаты. Остальные предусмотрено для включения в контейнеры-боксы или одноразового одновременного открытия, т.е. они принудительно проверяются на дубликаты, когда последнее открывается, а предыдущие закрываются.
uk: ПОРОЖНЯ та "main" група передбачають використання цієї сторінки як Кореневу-основну сторінку, тож така буде замінювати інші Кореневі-головні сторінки. Група "fl" призначена для використання у зовнішніх вікнах, які передбачено для багаторазового одночасного відкриття та які не мають відстежуватися на дублікати. Решта передбачено для включення у контейнери-бокси або одноразового одночасного відкриття, тож вони примусово перевіряються на дублікати, коли останнє відкривається, а попередні закриваються.

source: The project '%s' is used now by %d sessions!
de: Das Projekt '%s' wird jetzt von %d Sitzungen verwendet!
ru: Проект '%s' используется %d сеансами!
uk: Проєкт '%s' використовується %d сеансами!

source: Loading the project.
de: Projekt laden.
ru: Загрузка проекта.
uk: Завантаження проєкту.

source: Enabling the project.
de: Projekt einschalten.
ru: Включение проекта.
uk: Увімкнення проєкту.

source: Disabling the project.
de: Projekt abschalten.
ru: Отключение проекта.
uk: Вимкнення проєкту.

source: The page '%s' is already present!
de: Die Seite '%s' ist bereits vorhanden!
ru: Страница '%s' уже присутствует!
uk: Сторінка '%s' вже присутня!

source: Project:
de: Projekt:
ru: Проект:
uk: Проєкт:

source: Page
de: Seite
ru: Страница
uk: Сторінка

source: Project
de: Projekt
ru: Проект
uk: Проєкт

source: Project DB
de: Datenbank des Projekts
ru: БД проекта
uk: БД проєкту

source: Owner and group
de: Besitzer und Gruppe
ru: Владелец и группа
uk: Власник та група

source: Access
de: Berechtigung
ru: Доступ
uk: Доступ

source: No access;View;View and control
de: Kein Zugriff;Ansicht;Ansicht und Bedienung
ru: Нет доступа;Обзор;Обзор и управление
uk: Немає доступу;Огляд;Огляд та керування

source: Period of calculation
de: Zeitraum der Berechnung
ru: Период вычисления
uk: Період обчислення

source: Project's session calculate period on milliseconds.
de: Rechenzeit der Projektsitzung in Millisek.
ru: Период вычисления сессии проекта в миллисекундах.
uk: Період обчислення сеансу проєкту у мілісекундах.

source: Enable as needed
de: Befähigen von Notwendigkeit
ru: Включать по надобности
uk: Вмикати за потреби

source: Pages
de: Seiten
ru: Страницы
uk: Сторінка

source: Number
de: Anzahl
ru: Количество
uk: Кількість

source: Styles
de: Stile
ru: Стили
uk: Стилі

source: Style
de: Stil
ru: Стиль
uk: Стиль

source: Properties
de: Beschaffenheiten
ru: Свойства
uk: Властивості

source: Delete
de: Löschen
ru: Удалить
uk: Видалити

source: Diagnostics
de: Diagnostik
ru: Диагностика
uk: Діагностика

source: Time
de: Zeit
ru: Время
uk: Час

source: Messages
de: Nachrichten
ru: Сообщение
uk: Повідомлення

source: mcsec
ru: мксек
uk: мксек

source: Category
de: Kategorie
ru: Категория
uk: Категорія

source: Message
de: Nachricht
ru: Сообщение
uk: Повідомлення

source: All: %d; Enabled: %d
de: Alle: %d; Aktiviert: %d
ru: Всего: %d; Включено: %d
uk: Загалом: %d; Ввімкнено: %d

source: New style
de: Neuer Stil
ru: Новый стиль
uk: Новий стиль

source: <Disabled>
de: <Deaktiviert>
ru: <Выключено>
uk: <Вимкнено>

source: <Create a new style>
de: <Neuen Stil schaffen>
ru: <Создать новый стиль>
uk: <Створити новий стиль>

source: Page: opened
de: Seite: geöffnet
ru: Стр.: открыта
uk: Стор.: відкрита

source: Page: process not opened
de: Seite: Prozess nicht geöffnet
ru: Стр.: обрабатывать не открытой
uk: Стор.: обробляти не відкритою

source: Enabling the project page.
de: Aktivieren der Projektseite.
uk: Ввімкнення сторінки проєкту.

source: Disabling the project page.
de: Deaktivieren der Projektseite.
uk: Вимкнення сторінки проєкту.

source: The target page '%s' of the link is empty or recursive!
de: Die Zielseite '%s' des Links ist leer oder rekursiv!
ru: Целевая страница '%s' связи пуста или рекурсивна!
uk: Цільова сторінка '%s' зв'язку порожня або рекурсивна!

source: As a page, only a box based widget can be used!
de: Für Seiten kann nur das Box-basierte Widget benutzt werden!
ru: Для страниц может быть использован только основанный на Боксе виджет!
uk: У якості сторінок може бути використано тільки віджет, базований на боксі!

source: The widget is not a container!
de: Widget ist kein Container!
ru: Виджет не контейнер!
uk: Віджет не контейнер!

source: Page is not a container or a template!
de: Seite ist kein Container oder eine Vorlage!
ru: Страница не контейнер или шаблон!
uk: Сторінка не є контейнером або шаблоном!

source: Project page:
de: Seite des Projekts:
ru: Страница проекта:
uk: Сторінка проєкту:

source: Page type
de: Typ der Seite
ru: Тип страницы
uk: Тип сторінки

source: Consider to remove included pages linked to this page as a template due to it is not the template more!
de: Erwägen Sie, enthaltene Seiten, die mit dieser Seite als Vorlage verknüpft sind, zu entfernen, da es sich nicht um die Vorlage mehr handelt!
uk: Розгляньте видалення вкладених сторінок прив'язаних до цієї сторінки як шаблону, оскільки це більше не шаблон!

source: Consider to remove included pages due to this page is not a container more!
de: Erwägen Sie, enthaltene Seiten zu entfernen, da diese Seite kein Container mehr ist!
uk: Розгляньте видалення вкладених сторінок, оскільки це більше не контейнер!

source: Standard
ru: Стандарт
uk: Стандарт

source: Container
ru: Контейнер
uk: Контейнер

source: Logical container
de: Logischer Container
ru: Логический контейнер
uk: Логічний контейнер

source: Container and template
de: Container und Vorlage
ru: Контейнер и шаблон
uk: Контейнер та шаблон

source: Link
ru: Связь
uk: Зв'язок

source: The variable is not a link
de: Die Variable ist kein Lnk
ru: Переменная не является связью
uk: Змінна не є зв'язком

source: val:Constant value
de: val:Konstante
ru: val:Постоянная
uk: val:Стала

source: === Pages ===
de: === Seite ===
ru: === Страницы ===
uk: === Сторінки ===

source: === Widgets ===
ru: === Виджеты ===
uk: === Віджети ===

source: === Attributes ===
de: === Attribute ===
ru: === Атрибуты ===
uk: === Атрибути ===

source: Widget link:
ru: Виджет ссылка:
uk: Віджет посилання:

source: Enabling the session.
de: Einschalten der Session.
ru: Включение сеанса.
uk: Включення сеансу.

source: Time of the previous style loading: %f ms.
de: Ladezeit des vorherigen Styles: %f ms.
ru: Время загрузки предыдущего стиля: %f мс.
uk: Час завантаження попереднього стилю: %f мс.

source: Time of the root pages creating: %f ms.
de: Zeit, um die Root-Seite erstellen: %f ms.
ru: Время создания корневых страниц: %f мс.
uk: Час створення кореневих сторінок: %f мс.

source: Time of the root pages enabling: %f ms.
de: Zeit, um die Root-Seite erstellen: %f ms.
ru: Время включения корневых страниц: %f мс.
uk: Час увімкнення кореневих сторінок: %f мс.

source: Disabling the session.
de: Abschalten der Session.
ru: Отключение сеанса.
uk: Вимкнення сеансу.

source: Starting the session.
de: Start der Session.
ru: Запуск сеанса.
uk: Запуск сеансу.

source: Time of the styles loading from the project: %f ms.
de: Download-Zeit Blatt des Projekts: %f ms.
ru: Время загрузки стилей из проекта: %f мс.
uk: Час завантаження стилів з проєкту: %f мс.

source: Time of the processing all the root pages: %f ms.
de: Schließzeit in der Behandlung für alle Root-Seiten: %f ms.
ru: Время включения в обработку для всех корневых страниц: %f мс.
uk: Час включення у обробку всіх кореневих сторінок: %f мс.

source: Time of the processing task starting: %f ms.
de: Uhrzeit des Beginns der Verarbeitungstask: %f ms.
ru: Время запуска задачи обработки: %f мс.
uk: Час запуску задачі обробки: %f мс.

source: Stopping the session.
de: Stoppen der Sitzung.
ru: Останов сеанса.
uk: Зупинка сеансу.

source: Registering/opening the page '%s'.
de: Registrieren/Öffnen der Seite '%s'.
ru: Регистрация/открытие страницы '%s'.
uk: Реєстрація/відкриття сторінки '%s'.

source: Unregistering/closing the page '%s'.
de: Aufheben der Registrierung/Schließen der Seite '%s'.
ru: Дерегистрация/закрытие страницы '%s'.
uk: Дереєстрація/закриття сторінки '%s'.

source: Error calculating the session '%s'.
de: Fehler beim Berechnen der Sitzung '%s'.
ru: Ошибка вычисления сессии '%s'.
uk: Помилка обчислення сеансу '%s'.

source: Unregistered connection %d on the session.
de: Unregistrierte Verbindung %d auf der Sitzung.
ru: Незарегистрированное подключение %d на сеансе.
uk: Незареєстроване підключення %d на сеансі.

source: Session:
de: Sitzung:
ru: Сеанс:
uk: Сеанс:

source: Session
de: Sitzung
ru: Сеанс
uk: Сеанс

source: Running
de: Laufen
ru: Исполнение
uk: Виконання

source: User
de: Benutzer
ru: Пользователь
uk: Користувач

source: Owner
de: Besitzer
ru: Владелец
uk: Власник

source: Group
de: Gruppe
ru: Группа
uk: Група

source: Background execution mode
de: Hintergrundmodus der Ausführung
ru: Фоновый режим исполнения
uk: Режим виконання у тлі

source: Counter, time of calculating
de: Zähler, Berechnungszeit
ru: Счётчик, время вычисления
uk: Лічильник, час обчислення

source: Connections counter
de: Verbindungzähler
ru: Счётчик подключений
uk: Лічильник підключень

source: Last request time, user, language
de: Letzte Anfrage Zeit, Benutzer, Sprache
ru: Время, пользователь, язык последн. запроса
uk: Час, користувач, мова останнього запиту

source: Last user action
de: Letzte Benutzeraktion
ru: Последнее действие пользователя
uk: Остання дія користувача

source: Remained to the forced closing, seconds
de: Verblieben zum erzwungenen Schließen, Sekunden
ru: Осталось до принудительного закрытия, секунд
uk: Залишилось до примусового закриття, секунд

source: Period, milliseconds
de: Periode, Millisekunden
ru: Период, миллисекунд
uk: Період, мілісекунд

source: Opened pages
de: Offene Seiten
ru: Открытые страницы
uk: Відкриті сторінки

source: Error function '%s' of the notificator: %s
de: Fehlerfunktion '%s' des Notificators: %s
ru: Ошибка функции уведомителя '%s': %s
uk: Помилка функції сповіщувача '%s': %s

source: Enabled notification
de: Aktivieren Meldung
ru: Уведомление включено
uk: Сповіщення включено

source: Performing the notification
de: Ausführen der Benachrichtigung
ru: Осуществление уведомления
uk: Здійснення сповіщення

source: Making the resource
de: Die Ressource machen
ru: Создание ресурса
uk: Формування ресурсу

source: Resource stream
de: Ressourcen-Stream
ru: Поток ресурса
uk: Потік ресурсу

source: Notification message
de: Benachrichtigung
ru: Сообщение уведомления
uk: Повідомлення сповіщення

source: Language of the notification message
de: Sprache der Benachrichtigung
ru: Язык сообщения уведомления
uk: Мова повідомлення сповіщення

source: Resource stream type
de: Ressourcenstromtyp
ru: Тип потока ресурса
uk: Тип потоку ресурсу

source: Procedure ID
de: Prozedur-ID
ru: ID процедуры
uk: ID процедури

source: Opened.
de: Geöffnet.
ru: Открыто.
uk: Відкрито.

source: Enabling the page.
de: Aktivieren Seite.
ru: Включение страницы.
uk: Увімкнення сторінки.

source: Disabling the page.
de: Deaktivieren Seite.
ru: Отключение страницы.
uk: Вимкнення сторінки.

source: Session page:
de: Sitzungsseite:
ru: Страница сеанса:
uk: Сторінки сеансу:

source: Opened
de: Geöffnet
ru: Открыт
uk: Відкрито

source: Error compiling the function '%s' by the language '%s' for the widget: %s
de: Fehler in der Funktionskompilation '%s' in der Sprache '%s' für Widget: %s
ru: Ошибка компиляции функции '%s' на языке '%s' для виджета: %s
uk: Помилка компіляції функції '%s' на мові '%s' для віджета: %s

source: Modification form %d, fix %d.
de: Änderung bilden %d, fixieren %d.
ru: Модификация формирование %d, фиксация %d.
uk: Модифікація формування %d, фіксація %d.

source: Processing at %s.
ru: Обработка в %s.
uk: Обробка у %s.

source: Spent time on the branch
de: Verbrachte Zeit in der Branche
uk: Витрачено часу на гілку

source: the item
de: der Gegenstand
uk: елемент

source: It is a try of creating a widget in depth bigger to %d!
de: Es ist ein Versuch, ein Widget mit einer Tiefe von bis zu %d zu erstellen!
ru: Попытка создания виджета на глубину более %d!
uk: Спроба створення віджету на глибину більш за %d!

source: Events: %s
de: Ereignisse: %s
ru: События: %s
uk: Події: %s

source: Error calculating the widget. Process is disabled.
de: Fehler der Berechnung des Widgets. Bearbeitung ist abgeschaltet.
ru: Ошибка вычисления виджета. Обработка отключена.
uk: Помилка обчислення віджета. Обробку вимкнено.

source: Focus
de: Fokus
ru: Фокус
uk: Фокус

source: Processing
de: Bearbeitung
ru: Обработка
uk: Обробка

source: Engine of the visual control area
de: Motor der visuellen Kontrollzone
ru: Движок среды визуализации и управления
uk: Рушій середовища візуалізації та керування

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: The main engine of the visual control area.
de: Die Hauptmaschine des visuellen Kontrollbereichs.
ru: Общий движок среды визуализации и управления.
uk: Загальний рушій середовища візуалізації та керування.

source: DB table
de: DB-Tabelle
ru: Таблица БД
uk: Таблиця БД

source: Resource data
de: Ressourcendate
ru: Данные ресурса
uk: Дані ресурсу

source: Parent widget
de: Elternwidget
ru: Родительский виджет
uk: Батьківський віджет

source: Completely translate the procedure
de: Übersetzen Sie das Verfahren vollständig
ru: Полностью переводить процедуру
uk: Повністю перекладати процедуру

source: Procedure text and language
de: Text und Sprache des Programms
ru: Текст и язык программирования процедуры
uk: Текст та мова програмування процедури

source: Period of the procedure calculating
de: Zeitraum der Prozedurberechnung
ru: Период вычисления процедуры
uk: Період обчислення процедури

source: Changed attributes
de: Geänderte Attribute
ru: Изменённые атрибуты
uk: Змінені атрибути

source: Widget identifier
de: Widget-ID
ru: Идентификатор виджета
uk: Ідентифікатор віджету

source: Child ID
de: Tochter-ID
ru: Дочерний ID
uk: ID нащадка

source: Attribute value
de: Wert des Attributs
ru: Значение атрибута
uk: Значення атрибуту

source: Attribute flags
de: Attributflags
ru: Флаги атрибута
uk: Прапорці атрибуту

source: Configuration template
de: Konfigurationsvorlage
ru: Конфигурационный шаблон
uk: Конфігураційний шаблон

source: Configuration value
de: Konfigurationswert
ru: Значение конфигурации
uk: Значення конфігурації

source: Child identifier
de: Kind-ID
ru: Дочерний идентификатор
uk: Дочковий ідентифікатор

source: Attribute generic flags and type
de: Basisschalter und Typ des Attributs
ru: Основные флаги и тип атрибута
uk: Основні прапорці та тип атрибуту

source: Permission
de: Erlaubnis
ru: Права доступа
uk: Права доступу

source: Period of calculating, milliseconds
de: Berechnungszeitraum, Millisekunden
ru: Период вычисления, миллисекунд
uk: Період обчислення, мілісекунд.

source: Work style
de: Arbeitsstil
ru: Рабочий стиль
uk: Робочий стиль

source: Flags
de: Schalter
ru: Флаги
uk: Прапорці

source: Original widgets
ru: Базовые виджеты
uk: Базові віджети

source: Time of the library '%s' loading: %f ms.
de: Zeit Laden der Bibliothek '%s': %f msek.
ru: Время загрузки библиотеки '%s': %f мс.
uk: Час завантаження бібліотеки '%s': %f мс.

source: Error loading the widgets libraries.
de: Fehler beim Laden der Widgetsbibliothek.
ru: Ошибка загрузки библиотеки виджетов.
uk: Помилка завантаження бібліотеки віджетів.

source: Time of the project '%s' loading: %f ms.
de: Zeit Laden des Projekts '%s': %f msek.
ru: Время загрузки проекта '%s': %f мс.
uk: Час завантаження проєкту '%s': %f мс.

source: Error loading the projects.
de: Fehler beim Laden der Projekte.
ru: Ошибка загрузки проектов.
uk: Помилка завантаження проєктів.

source: Time of the library '%s' enabling: %f ms.
de: Zeit der Aktivierung der Bibliothek '%s': %f ms.
ru: Время включения библиотеки '%s': %f мс.
uk: Час включення бібліотеки '%s': %f мс.

source: Time of the project '%s' enabling: %f ms.
de: Zeitpunkt der Aktivierung des Projekts '%s': %f ms.
ru: Время включения проекта '%s': %f мс.
uk: Час включення проєкту '%s': %f мс.

source: The widget library '%s' is already present!
de: Die Widget-Bibliothek '%s' ist bereits vorhanden!
ru: Библиотека виджетов '%s' уже присутствует!
uk: Бібліотека віджетів '%s' вже присутня!

source: The project '%s' is already present!
de: Das Projekt '%s' ist bereits vorhanden!
ru: Проект '%s' уже присутствует!
uk: Проєкт '%s' вже присутній!

source: Connecting to the session is not permitted for '%s'.
de: Die Verbindung zur Sitzung ist für '%s' nicht erlaubt.
ru: Недопустимо подключение к сеансу для пользователя '%s'.
uk: Недозволено підключення до сеансу для користувача '%s'.

source: User was changed to '%s' on the station '%s'.
de: Benutzer wurde auf der Station '%s' in '%s' geändert.
ru: Сменился пользователь на '%s', на станции '%s'.
uk: Змінився користувач у '%s' на станції '%s'.

source: User '%s' has been connected on '%s'.
de: Benutzer '%s' wurde mit '%s' verbunden.
ru: Подключился пользователь '%s', на '%s'.
uk: Під'єднався користувач '%s' на '%s'.

source: Error arguments of the session connecting/creating.
de: Fehlerargumente der Sitzung, die verbindet/erstellt.
ru: Ошибка аргументов подключения/создания сеанса.
uk: Помилка аргументів підключення/створення сеансів.

source: User '%s' has been disconnected on '%s'.
de: Benutzer '%s' wurde bei '%s' getrennt.
ru: Отключился пользователь '%s', на '%s'.
uk: Від'єднався користувач '%s' на '%s'.

source: Widgets library
de: Widgetsbibliothek
ru: Библиотека виджетов
uk: Бібліотека віджетів

source: Functions
de: Funktionen
ru: Функции
uk: Функції

source: Widgets libraries
de: Widgetsbibliotheken
ru: Библиотеки виджетов
uk: Бібліотеки віджетів

source: Sessions
de: Sitzungen
ru: Сеансы
uk: Сеанси

source: Auto created and started
de: Automatisch erstellt und gestartet
ru: Автоматически созданный и запущенный
uk: Автоматично створений та запущений

source: Session '%s' is already present!
de: Sitzung '%s' ist vorhanden!
ru: Сеанс '%s' уже присутствует!
uk: Сеанс '%s' вже присутній!

source: The attribute '%s' is not released. Forced removal!
de: Das Attribut '%s' wird nicht freigegeben. Zwangsräumung!
ru: Атрибут '%s' не освобождён. Принудительное удаление!
uk: Атрибут '%s' не звільнено. Примусове видалення!

source: Path
de: Pfad
ru: Путь
uk: Шлях

source: No access;R_____;R_R___;R_R_R_;RW____;RWR___;RWR_R_;RWRW__;RWRWR_;RWRWRW;Inheritance;Inherit.(R_____);Inherit.(R_R___);Inherit.(R_R_R_);Inherit.(RW____);Inherit.(RWR___);Inherit.(RWR_R_);Inherit.(RWRW__);Inherit.(RWRWR_);Inherit.(RWRWRW)
de: Kein Zugang;R_____;R_R___;R_R_R_;RW____;RWR___;RWR_R_;RWRW__;RWRWR_;RWRWRW;Erbschaft;Erbschaft(R_____);Erbschaft(R_R___);Erbschaft(R_R_R_);Erbschaft(RW____);Erbschaft(RWR___);Erbschaft(RWR_R_);Erbschaft(RWRW__);Erbschaft(RWRWR_);Erbschaft(RWRWRW)
ru: Нет доступа;R_____;R_R___;R_R_R_;RW____;RWR___;RWR_R_;RWRW__;RWRWR_;RWRWRW;Наследование;Наследов.(R_____);Наследов.(R_R___);Наследов.(R_R_R_);Наследов.(RW____);Наследов.(RWR___);Наследов.(RWR_R_);Наследов.(RWRW__);Наследов.(RWRWR_);Наследов.(RWRWRW)
uk: Немає доступу;R_____;R_R___;R_R_R_;RW____;RWR___;RWR_R_;RWRW__;RWRWR_;RWRWRW;Наслідування;Наслідув.(R_____);Наслідув.(R_R___);Наслідув.(R_R_R_);Наслідув.(RW____);Наслідув.(RWR___);Наслідув.(RWR_R_);Наслідув.(RWRW__);Наслідув.(RWRWR_);Наслідув.(RWRWRW)

source: Root
de: Ursprung
ru: Корень
uk: Корінь

source: Active
de: Aktiv
ru: Активный
uk: Активний

source: Geometry: x
de: Geometrie: x
ru: Геометрия: x
uk: Геометрія: x

source: Geometry: y
de: Geometrie: y
ru: Геометрия: y
uk: Геометрія: y

source: Geometry: width
de: Geometrie: Breite
ru: Геометрия: ширина
uk: Геометрія: ширина

source: Geometry: height
de: Geometrie: Höhe
ru: Геометрия: высота
uk: Геометрія: висота

source: Geometry: x scale
de: Geometrie: x Maßstab
ru: Геометрия: x масштаб
uk: Геометрія: x масштаб

source: Geometry: y scale
de: Geometrie: y Maßstab
ru: Геометрия: y масштаб
uk: Геометрія: y масштаб

source: Geometry: z
de: Geometrie: z
ru: Геометрия: z
uk: Геометрія: z

source: Geometry: margin
de: Geometrie: Rand
ru: Геометрия: отступ
uk: Геометрія: відступ

source: Tip: tool
de: Hilfe: Prompt
ru: Помощь: подсказка
uk: Допомога: підказка

source: Tip: status
de: Hilfe: Zustand
ru: Помощь: состояние
uk: Допомога: стан

source: Context menu
de: Kontextmenu
ru: Контекстное меню
uk: Контекстне меню

source: Events processing
de: Ereignisverarbeitung
ru: Обработка событий
uk: Обробка подій

source: Error enabling the widget: %s
de: Fehler beim Aktivieren des Widgets: %s
ru: Ошибка включения виджета: %s
uk: Помилка включення віджета: %s

source: Error disabling the inheriting widget '%s'.
de: Fehler beim Deaktivieren des erbenden Widgets '%s'.
ru: Ошибка отключения наследующего виджета '%s'.
uk: Помилка вимкнення наслідувального віджета '%s'.

source: Error enabling/disabling the child widget '%s'.
de: Fehler beim Aktivieren/Deaktivieren des untergeordneten Widgets '%s'.
ru: Ошибка включения/отключения дочернего виджета '%s'.
uk: Помилка увімкнення/вимкнення дочірнього віджету '%s'.

source: Parent item is empty or equal to itself!
de: Das übergeordnete Element ist leer oder entspricht sich selbst!
ru: Родительский элемент пуст или идентичен себе!
uk: Батьківський елемент порожній або дорівнює собі!

source: Parent is identical to the owner for the link!
de: Das Elternteil ist identisch mit dem Besitzer des Links!
ru: Родитель идентичен владельцу для связи!
uk: Батько ідентичний до власника для посилання!

source: Impossible to lower down the changes of the widget '%s' to '%s' but it has the cyclic inheritance!
de: Es ist nicht möglich, die Änderungen des Widgets '%s' auf '%s' zu reduzieren, aber es hat die zyklische Vererbung!
ru: Невозможно опустить изменения виджета '%s' в '%s' из-за цикличной наследственности!
uk: Неможливо опустити зміни віджета '%s' до '%s' через циклічну спадковість!

source: Adding a new attribute '%s' exceeds the number %d!
de: Hinzufügen eines neuen Attributs '%s' überschreitet die Anzahl %d!
ru: Добавление нового атрибута '%s' превышает количество %d!
uk: Додання нового атрибуту '%s' перевищує кількість %d!

source: Attribute '%s' is not present.
de: Attribut '%s' ist nicht vorhanden.
ru: Атрибут '%s' отсутствует!
uk: Атрибут '%s' відсутній!

source: Deleting attribute '%s' has not been released.
de: Entfernt Attribut '%s' wird nicht veröffentlicht.
ru: Удаляемый атрибут '%s' не освобождён.
uk: Видаляємий атрибут '%s' не було звільнено.
