Repository: aleax/openscada
Catalog: src/moduls/ui/VCAEngine/po/*.po
Languages: de, ru, uk

source: Operation modes of the button: "Standard" - standard button with the ability to repeat the events when hold (the parameters in "value"); "Checkable" - checkable button (the value in "value"); "Menu" - opening menu by click (the list of items in "value"); "Load" - provides user downloading of small files through the visualization interface; at the push of a button, in this mode, the dialog opens the file selection for download, and the content of the selected file is loaded to the attribute "value"; "Save" - provides user saving small files through the interface of visualization; after the contents of the file have been written to the "value" attribute, a dialog will be opened for selecting-defining a file to save, after which the contents of the attribute "value" will be saved to the file and it will be cleared itself.
de: Der Modus des Arbeitsganges der Taste: "Standard" - Standard-Schaltfläche mit der Fähigkeit, die Ereignisse zu wiederholen, wenn sie gehalten werden (die Parameter in "value"); "Checkable" - Checkable Button (der Wert in "value"); "Menu" - Öffnen des Menüs durch Klicken (die Liste der Elemente in "value"); "Load" - bietet Benutzern das Herunterladen von kleinen Dateien über die Visualisierungsoberfläche; auf Knopfdruck öffnet der Dialog in diesem Modus die Dateiauswahl zum Download und der Inhalt der ausgewählten Datei wird in das Attribut "value" geladen; "Save" - bietet dem Benutzer das Speichern von kleinen Dateien über die Schnittstelle der Visualisierung; Nachdem der Inhalt der Datei in das "value" -Attribut geschrieben wurde, wird ein Dialog geöffnet, in dem eine zu speichernde Datei ausgewählt wird. Danach wird der Inhalt des Attributs "value" in der Datei gespeichert und es wird sich selbst klären.
ru: Режим работы кнопки: "Стандарт" - обычная кнопка с возможностью повтора событий при удержании (параметры в "value"); "Переключатель" - кнопка с фиксацией (значение в "value"); "Меню" - открытие меню по нажатию (перечень элементов в "value"); "Загрузка" - организация пользовательской загрузки небольших файлов через интерфейс визуализации; при нажатии кнопки в этом режиме открывается диалог выбора файла для загрузки, а содержимое выбранного файла загружается в атрибут "value"; "Сохранение" - организация пользовательского сохранения небольших файлов через интерфейс визуализации; при записи содержимого файла в атрибут "value" пользователю будет открыт диалог выбора/указания файла для сохранения, после выбора содержимое атрибута "value" сохранится в файл, а "value" очистится.
uk: Режим роботи кнопки: "Стандарт" - звичайна кнопка з можливістю повтору подій при утримані (параметри у "value"); "Перемикач" - кнопка з фіксацією (значення у "value"); "Меню" - відкриття меню за натиском (перелік елементів у "value"); "Завантаження" - надання користувацького завантаження невеликих файлів через інтерфейс візуалізації; при натиску кнопки, у цьому режимі, відкривається діалог обрання файлу для завантаження, а вміст обраного файлу завантажується до атрибуту "value"; "Збереження" - надання користувацького збереження невеликих файлів через інтерфейс візуалізації; після запису вмісту файлу до атрибуту "value" користувачу буде відкрито діалог обрання-визначення файлу для збереження, після обрання якого вміст атрибуту "value" збережеться у файл та він сам буде очищений.

source: Parameters of the repeating of the events at holding the button "{delay}-{interval}", time in milliseconds.
de: Parameter vom Vorgangswiederholen beim Halten "{delay}-{interval}", Zeit in Millisekunden
ru: Параметры повтора событий при удержании "{задержка}-{интервал}", время в миллисекундах.
uk: Параметри повтору подій при утриманні "{затримка}-{інтервал}", час у мілісекундах.

source: Value of the toggle.
de: Wert des Schalters.
ru: Значение переключателя.
uk: Значення перемикача.

source: List of menu items in the form "/grp1/grp2/item1".
de: Die Liste von Elementenadressen-Menu gleich "/grp1/grp2/item1".
ru: Список адресов элементов меню вида "/grp1/grp2/item1".
uk: Перелік адрес елементів меню у вигляді "/grp1/grp2/item1".

source: First line of the descriptor "{FilesTemplate}|{Header}|{FileByDefaultAndLoaded}|{FileMime}" and the loaded file content from the next line. The files template writing like to "Images (*.png *.xpm *.jpg);;CSV-file (*.csv)".
de: Erste Zeile des Deskriptors "{FilesTemplate}|{Header}|{FileByDefaultAndLoaded}|{FileMime}" und der Inhalt der geladenen Datei aus der nächsten Zeile. Die Dateivorlage schreibt sich wie in "Images (*.png *.xpm *.jpg);;CSV-Datei (*.csv)".
ru: Первая строка описания "{ШаблонФайлов}|{Заголовок}|{ФайлПоУмолчаниюИЗагруж}|{MimeФайла}" и содержимое загруженного файла начиная со следующей строки. Шаблон файлов в виде "Изображение (*.png *.xpm *.jpg);;CSV-файл (*.csv)".
uk: Перший рядок опису "{ШаблонФайлів}|{Заголовок}|{ФайлПоЗамовченнюТаЗавант}|{MimeФайлу}" та вміст завантаженого файлу з наступного рядку. Шаблон файлів у вигляді "Зображення (*.png *.xpm *.jpg);;CSV-файл (*.csv)".

source: First line of the descriptor "{FilesTemplate}|{Header}|{FileByDefault}|{FileMime}" and the saving file content from the next line. The files template writing like to "Images (*.png *.xpm *.jpg);;CSV-file (*.csv)".
de: Erste Zeile des Deskriptors "{FilesTemplate}|{Header}|{FileByDefault}|{FileMime}" und der Inhalt der geladenen Datei aus der nächsten Zeile. Die Dateivorlage schreibt sich wie in "Images (*.png *.xpm *.jpg);;CSV-Datei (*.csv)".
ru: Строка описания "{ШаблонФайлов}|{Заголовок}|{ФайлПоУмолчанию}|{MimeФайла}" и содержимое загруженного файла начиная со следующей строки. Шаблон файлов в виде "Изображение (*.png *.xpm *.jpg);;CSV-файл (*.csv)".
uk: Рядок опису "{ШаблонФайлів}|{Заголовок}|{ФайлПоЗамовченню}|{MimeФайлу}" та вміст файлу що зберігається з наступного рядку. Шаблон файлів у вигляді "Зображення (*.png *.xpm *.jpg);;CSV-файл (*.csv)".

source: List of the hierarchical items by the path "/{DIR}/{DIR}/{ITEM}" per line.
de: Liste von hierarchischen Elementen gleich "/{DIR}/{DIR}/{ITEM}" in Zeilen.
ru: Список иерархических элементов в виде пути "/{КАТ}/{КАТ}/{ЭЛЕМ}" по строкам.
uk: Перелік ієрархічних елементів у вигляді шляху "/{ТЕКА}/{ТЕКА}/{ЕЛЕМ}", за рядками.

source: List of items-values by lines.
de: Liste der Werke-Werte durch Linien.
ru: Список элементов-значений по строкам.
uk: Перелік елементів-значень, за рядками.

source: Configuration of the slider in the format: "{VertOrient}:{Min}:{Max}:{SinglStep}:{PageStep}". Where: "VertOrient" - sign of the vertical orientation, the default one is the horizontal orientation; "Min" - minimum value; "Max" - maximum value; "SinglStep" - the size of a single step; "PageStep" - the size of the page step.
de: Konfiguration der Regler im Format: "{VertOrient}:{Min}:{Max}:{SinglStep}:{PageStep}". Wo: "VertOrient" - Zeichen einer vertikalen Ausrichtung, ist die Standardeinstellung der horizontalen Ausrichtung; "Min" - Minimalwert; "Max" - Maximalwert; "SinglStep" - von der Größe eines einzigen Schritt; "PageStep" - die Größe der Seite Schritt.
ru: Конфигурация слайдера в формате: "{ВертОриент}:{Минимум}:{Максимум}:{ОдинШаг}:{СтрШаг}". Где: "ВертОриент" - признак вертикальной ориентации, по умолчанию ориентация горизонтальная; "Минимум" - минимальное значение; "Максимум" - максимальное значение; "ОдинШаг" - размер одного шага; "СтрШаг" - размер страничного шага.
uk: Конфігурація слайдеру у форматі: "{ВертОрієнт}:{Мінімум}:{Максимум}:{ОдинКрок}:{СторКрок}". Де: "ВертОрієнт" - ознака вертикальної орієнтації, по замовченню орієнтація горизонтальна; "Мінімум" - мінімальне значення; "Максимум" - максимальне значення; "ОдинКрок" - розмір одного кроку; "СторКрок" - розмір сторінкового кроку.

source: XML tag "tbl" for the table fill: <tbl> <h><s>{Header1}</s><s>{Header2}</s></h> <r><s>{Row1Column1String}</s><i>{Row1Column1Integer}</i></r> <r><b>{Row2Column1Logical}</b><r>{Row2Column2Real}</r></r> </tbl> Tags: tbl - Table, the properties at all: sel - selection mode of the table items: "row" - by rows, "col" - by columns, "cell" - by cells (by default); keyID - row-column number of the key, for the selection value get; colsWdthFit - fits the columns (in the unfixed size) size to fill the full width of the table; hHdrVis, vHdrVis - visibility of the headers, for horizontal and vertical; sortEn - enables sorting directly by the columns. h - Row of the headers. Possible attributes of the header cell tag for the column as a whole: width - column width, in pixels or percents (10%); edit - allowing to the cells of the row edition (0 or 1), by default - no (0); color - column color as a whole into the color name or code; colorText - color of the column text as a whole into the color name or code; font - font of the column text in the typical OpenSCADA string; prec - value precision of the real type cells in the column; sort - sorting by the column [0 - Descending; 1 - Ascending]; align - alignment the column for: "left", "right" and "center". r - Row of the values. Possible attributes of the row cell tag for the row as a whole: color - row color as a whole into the color name or code; colorText - color of the row text as a whole into the color name or code; font - font of the row text in the typical OpenSCADA string; prec - value precision of the real type cells in the row. s, t, i, r, b - cells of the data types "String", "Text", "Integer", "Real" and "Logical". Possible attributes: color - cell color; colorText - color of the cell text into the color name or code; font - font of the cell text in the typical OpenSCADA string; prec - value precision of the real type cell; img - image of the cell into the form "[{src}:]{name}"; edit - allowing the cell edition (0 or 1), by default - no (0); align - alignment the cell for: "left", "right" and "center".
de: XML-Tag "tbl" für die Tabelle fill: <tbl> <h><s>{Kopfzeile1}</s><s>{Kopfzeile2}</s></h> <r><s>{Zeile1Spalte1Saite}</s><i>{Zeile1Spalte1Integer}</i></r> <r><b>{Zeile2Spalte1Logisch}</b><r>{Zeile2Spalte2Real}</r></r> </tbl> Die Tags: tbl - Tabelle, die Eigenschaften überhaupt: sel - der Auswahlmodus der Tabelle Einzelteile: "row" - durch Reihen, "col" - nach Spalten, "cell" - von Zellen (standardmäßig); keyID - Zeilen-Spalten-Nummer des Schlüssels, bei der Auswahl Wert zu erhalten; colsWdthFit - passen Sie die Spalten (welche Größe nicht fixierte) Größe für volle Breite der Tabelle zu füllen; hHdrVis, vHdrVis - horizontale, vertikale Kopf Sichtbarkeit Satz. sortEn - direkte Sortierung von Spalten ermöglichen. h - Reihe der Überschriften. Mögliche Attribute des Kopfzeilen-Tags für die gesamte Spalte: width - die Spaltenbreite in Pixeln oder Prozent (10%); edit - ermöglicht die Zellen der Reihe edition (0 oder 1), standardmäßig - nicht (0); color - die Spalte Farbe als Ganzes in den Farbnamen oder Code; colorText - die Spalten Textfarbe als Ganzes in den Farbnamen oder Code; font - die Spalten Text Schriftart in typischen OpenSCADA Zeichenfolge; prec - Wertgenauigkeit der Zellen vom Typ Real in der Spalte; sort - Sortierung durch die Spalte [0 - Absteigend; 1 - Aufsteigend]; align - Richten Sie die Spalte aus für: "left", "right" und "center". r - Reihe der Werte. Mögliche Attribute des Zeilenzellen-Tags für die Zeile als Ganzes: color - die Zeilenfarbe als Ganzes in die Farb Name oder Code. colorText - die Zeilenfarbe Textfarbe als Ganzes in den Farbnamen oder Code; font - die Zeilenfarbe Text Schriftart in typischen OpenSCADA Zeichenfolge; prec - Wertgenauigkeit der Zellen vom Typ Real in der Zeile. s, t, i, r, b - Zellen des Datentyps "String", "Text", "Integer", "Real" und "Logical". Erlaubt Attribute: color - Hintergrundfarbe der Zelle; colorText - der Zelle Textfarbe in den Farbnamen oder Code; font - der Zelle Text Schriftart in typischen OpenSCADA Zeichenfolge; prec - Wertgenauigkeit der Zelle vom Realtyp; img - Bild der Zelle in Form "[{src}:]{Name}"; edit - ermöglicht auf die Zelle der Zeile Ausgabe (0 oder 1), standardmäßig - nicht (0); align - Richten Sie die Zelle aus für: "left", "right" und "center".
ru: XML тег "tbl" для заполнения таблицы: <tbl> <h><s>{Заголовок1}</s><s>{Заголовок2}</s></h> <r><s>{Ряд1Колонка1Строка}</s><i>{Ряд1Колонка2Целое}</i></r> <r><b>{Ряд2Колонка1Логическое}</b><r>{Ряд2Колонка2Вещественное}</r></r> </tbl> Теги: tbl - Таблица, свойства таблицы в целом: sel - режим выбора-выделения элементов таблицы: "row" - по строкам, "col" - по колонкам, "cell" - ячейками (по умолчанию); keyID - номер ключевой строки-колонки, для получения значения выбора; colsWdthFit - подстраивать размер колонок (размер которых не фиксирован) под заполнение всей ширины таблицы; hHdrVis, vHdrVis - установка видимости горизонтального, вертикального заголовков; sortEn - включение прямой сортировки по колонкам. h - Строка заголовков. Возможные атрибуты тегов ячеек заголовка для колонки в целом: width - ширина колонки, в пикселах или процентах (10%); edit - возможность редактирования (0 или 1) ячеек колонки, по умолчанию — нет (0); color - цвет колонки в целом, в виде имени цвета или его кода; colorText - цвет текста колонки в целом, в виде имени цвета или его кода; font - шрифт текста колонки в целом, в виде типовой строки OpenSCADA; prec - точность значений ячеек вещественного типа в колонке; sort - сортировка по данной колонке [0 - по убыванию; 1 - по возрастанию]; align - выравнивание колонки на предмет: "left", "right" и "center". r - Ряд значений. Возможные атрибуты тегов ячеек ряда для ряда в целом: color - цвет ряда в целом, в виде имени цвета или его кода; colorText - цвет текста ряда в целом, в виде имени цвета или его кода; font - шрифт текста ряда в целом, в виде типовой строки OpenSCADA; prec - точность значений ячеек вещественного типа в строке. s, t, i, r, b - ячейки типов данных "Строка", "Текст", "Целое", "Вещественное" и "Логическое". Возможные атрибуты: color - цвет фона ячейки; colorText - цвет текста ячейки, в виде имени цвета или его кода; font - шрифт текста ячейки, в виде типовой строки OpenSCADA; prec - точность значений ячейки вещественного типа; img - изображение ячейки в форме "[{src}:]{name}"; edit - возможность редактирования (0 или 1) ячейки колонки, по умолчанию — нет (0); align - выравнивание ячейки на предмет: "left", "right" и "center".
uk: XML тег "tbl" для заповнення таблиці: <tbl> <h><s>{Заголовок1}</s><s>{Заголовок2}</s></h> <r><s>{Рядок1Стовпчик1Рядок}</s><i>{Рядок1Стовпчик2Ціле}</i></r> <r><b>{Рядок2Стовпчик1Логічне}</b><r>{Рядок2Стовпчик2Реальне}</r></r> </tbl> Теги: tbl - Таблиця, загальні властивості: sel - режим обрання-виділення елементів таблиці: "row" - за рядками, "col" - за колонками, "cell" - за клітинками (типово); keyID - номер ключового рядка-колонки, для отримання значення вибору; colsWdthFit - підлаштовувати розмір колонок (розмір яких не фіксовано) під заповнення всієї ширини таблиці; hHdrVis, vHdrVis - встановлення видимості горизонтального, вертикального заголовків; sortEn - включення прямого сортування за стовпчиками. h - Рядок заголовків. Можливі атрибути тегів клітинок заголовку для стовпчика загалом: width - ширина колонки, у пікселах або відсотках (10%); edit - можливість редагування (0 або 1) клітинок колонки, типово — ні (0); color - колір колонки в цілому, у вигляді ім'я кольору та його коду; colorText - колір тексту колонки в цілому, у вигляді ім'я кольору та його коду; font - шрифт тексту колонки в цілому, у вигляді типового рядку OpenSCADA; prec - точність значень клітинок реального типу у стовпчику; sort - сортування за цією колонкою [0 - по убуванню; 1 - по зростанню]; align - вирівнювання стовпчика щодо: "left", "right" та "center". r - Рядок значень. Можливі атрибути тегів клітинок рядку для рядку загалом:: color - колір рядка в цілому, у вигляді назви кольору або його коду; colorText - колір тексту рядка в цілому, у вигляді ім'я кольору та його коду; font - шрифт тексту рядка в цілому, у вигляді типового рядку OpenSCADA; prec - точність значень клітинок реального типу у рядку. s, t, i, r, b - клітинки типів даних "Рядок", "Текст", "Ціле", "Реальне" та "Логічне". Можливі атрибути: color - колір фону клітинки; colorText - колір тексту клітинки, у вигляді ім'я кольору та його коду; font - шрифт тексту клітинки, у вигляді типового рядку OpenSCADA; prec - точність значень клітинки реального типу; img - зображення клітинки у формі "[{src}:]{name}"; edit - можливість редагування (0 або 1) клітинки колонки, типово — ні (0); align - вирівнювання клітинки щодо: "left", "right" та "center".

source: Text field
de: Textfeld
ru: Текстовое поле
uk: Текстове поле

source: Text field widget of the finite visualization.
de: Textfeld Widget der endlichen Visualisierung.
ru: Виджет текстового поля конечной визуализации.
uk: Віджет текстового поля кінцевої візуалізації.

source: Background: color
de: Hintergrund: Farbe
ru: Фон: цвет
uk: Тло: колір

source: Background: image
de: Hintergrund: Bild
ru: Фон: изображение
uk: Тло: зображення

source: Border: style
de: Rand: Stil
ru: Граница: стиль
uk: Границя: стиль

source: None;Dotted;Dashed;Solid;Double;Groove;Ridge;Inset;Outset
de: Keine;Gepunktet;Gestrichelt;Durchgehend;Doppelt;Rille;Grat;Einsatz;Anfang
ru: Нет;Точечный;Пунктирный;Сплошной;Двойной;Канавка;Кромка;Вдавлен;Выступающий
uk: Немає;Крапкова;Пунктирна;Суцільна;Подвійна;Канавка;Кромка;Утиснено;Виступаючий

source: Color
de: Farbe
ru: Цвет
uk: Колір

source: Alignment
de: Ausrichtung
ru: Выравнивание
uk: Вирівнювання

source: Top left;Top right;Top center;Top justify;Bottom left;Bottom right;Bottom center;Bottom justify;V center left;V center right;Center;V center justify
de: Oben links;Oben rechts;Oben Mitte;Oben bündig;Unten links;Unten rechts;Unten Mitte;Unten bündig;Mitte links;Mitte rechts;Mitte;Mitte bündig
ru: Вверху слева;Вверху справа;Вверху в центре;Вверху по ширине;Внизу слева;Внизу справа;Внизу в центре;Внизу по ширине;В центре слева;В центре справа;В центре;В центре по ширине
uk: Зверху ліворуч;Зверху праворуч;Зверху у центрі;Зверху по ширині;Знизу ліворуч;Знизу праворуч;Знизу у центрі;Знизу по ширині;У центрі ліворуч;У центрі праворуч;У центрі;У центрі по ширині

source: In HTML
ru: В HTML
uk: У HTML

source: Text
ru: Текст
uk: Текст

source: Arguments number
de: Anzahl der Argumente
ru: Количество аргументов
uk: Кількість аргументів

source: Argument
ru: Аргумент
uk: Аргумент

source: : type
de: : Typ
ru: : тип
uk: : тип

source: Integer;Real;String
de: Ganzzahl;Reele Zahl;Text
ru: Целый;Вещественный;Строка
uk: Цілий;Реальний;Рядок

source: : value
de: : Wert
ru: : значение
uk: : значення

source: : config
de: : Konfiguration
ru: : конфигурация
uk: : конфігурація

source: Text value in HTML. Use "%{x}" for argument "x" (from 1) value insert.
de: Textwert in HTML. Verwenden Sie "%{n}" die Werte der Argumente "n" (aus 1) zu halten.
ru: Значение текста в HTML. Используйте "%{n}" для помещения значения аргумента "n" (от 1).
uk: Значення тексту у HTML. Використовуйте "%{x}" для розташування значення аргументу "n" (від 1).

source: Text value. Use "%{x}" for argument "x" (from 1) value insert.
de: Textwert. Verwenden Sie "%{n}" die Werte der Argumente "n" (aus 1) zu halten.
ru: Значение текста. Используйте "%{n}" для помещения значения аргумента "n" (от 1).
uk: Значення тексту. Використовуйте "%{x}" для розташування значення аргументу "n" (від 1).

source: Integer value configuration in the form "{len}".
de: Integer-Wert-Konfiguration in Form "{len}".
ru: Конфигурация целого значения в форме "{длина}".
uk: Конфігурація цілого значення у формі "{довжина}".

source: Real value configuration in the form: "{width};{form};{prec}". Where "form" is 'g', 'e' or 'f'.
de: Realer Wert Konfiguration in Form: "{width};{form};{prec}". Wo "Form", die 'g', 'e' oder 'f'.
ru: Конфигурация вещественного значения в форме: "{ширина};{форма};{точность}". Где "форма" это 'g', 'e' или 'f'.
uk: Конфігурація реального значення у формі: "{ширина};{форма};{точність}". Де "форма" це 'g', 'e' або 'f'.

source: String value configuration in the form "{len}".
de: String-Wert-Konfiguration in Form "{len}".
ru: Конфигурация строкового значения в форме "{длина}".
uk: Конфігурація строкового значення у формі "{довжина}".

source: Media
ru: Медиа
uk: Медіа

source: Media widget of the finite visualization.
de: Widget für die Media der Visualisierung.
ru: Медиа виджет конечной визуализации.
uk: Медіа віджет кінцевої візуалізації.

source: Source
de: Quelle
ru: Источник
uk: Джерело

source: Type
de: Typ
ru: Тип
uk: Тип

source: Image;Animation;Video;Audio
de: Bild;Animation;Video;Audio
ru: Изображение;Анимация;Видео;Аудио
uk: Зображення;Анімація;Відео;Аудіо

source: Map areas
de: Kartenbereiche
ru: Области карты
uk: Області карти

source: Fit to the widget size
de: Passen Sie auf die Widgetgröße an
ru: Вписывать в размеры виджета
uk: Вписувати у розміри віджету

source: Play speed
de: Geschwindigkeit der Wiedergabe
ru: Скорость проигрывания
uk: Швидкість програвання

source: Play
de: Abspielen
ru: Играть
uk: Грати

source: Roll play
de: Roll spielen
ru: Завор. проигр.
uk: Заверт. прогр.

source: Pause
ru: Пауза
uk: Пауза

source: Size
de: Größe
ru: Размер
uk: Розмір

source: Seek
de: Suchen
ru: Положение
uk: Положення

source: Volume
de: Volumen
ru: Громкость
uk: Гучність

source: Area
de: Bereich
ru: Область
uk: Область

source: : shape
de: : Gestalt
ru: : образ
uk: : образ

source: Rect;Poly;Circle
de: Quadrat;Poly;Kreis
ru: Квадрат;Полилиния;Окружность
uk: Квадрат;Полілінія;Коло

source: : coordinates
de: : Koordinaten
ru: : координаты
uk: : координати

source: : title
de: : Titel
ru: : заголовок
uk: : заголовок

source: Name of the media source in the form "[{src}:]{name}", where: "src" - source: file - directly from a local file (for visualizator or engine) by the path; res - from table of DB-mime resources; stream - stream URL to play video and audio. "name" - file path or mime-resource identifier. Examples: "res:workMedia" - from the table of DB-mime resources for the ID "workMedia"; "workMedia" - like to the previous; "file:/var/tmp/workMedia.mng" - from a local file by the path "/var/tmp/workMedia.mng"; "stream:http://localhost.localhost:5050" - playing the stream video and audio from the URL.
de: Media Quelle Name in Form "[{src}:]{name}", wo: "src" - Quelle: file - direkt vom lokalen (Visualizer und der Motor) Dateisystem von Pfad; res - von DB Mime Ressourcen-Tabelle; stream - Stream-URL für Video-und Audio-Wiedergabe. "name" - Dateipfad oder Ressource Mime Id. Beispiele: "res:workMedia" - von DB Mime Ressourcen-Tabelle für ID "workMedia"; "workMedia" - wie frühere; "file:/var/tmp/workMedia.mng" - von der lokalen Datei-Pfad "/var/tmp/workMedia.mng"; "stream:http://localhost.localhost:5050" - Video-und Audio-Stream Play-URL aus.
ru: Имя источника медиа в форме "[{src}:]{name}", где: "src" - источник: file - прямо из локального (визуализатор и движок) файла по пути; res - из таблицы mime-ресурсов БД; stream - URL потока проигрывания видео или аудио. "name" - путь файла или идентификатор mime-ресурса. Примеры: "res:workMedia" - из таблицы mime-ресурсов БД для идентификатора "workMedia"; "workMedia" - как и предыдущий; "file:/var/tmp/workMedia.mng" - из локального файла по пути "/var/tmp/workMedia.mng"; "stream:http://localhost.localhost:5050" - проигрывание видео или аудио из URL.
uk: Ім'я зображення у формі "[{src}:]{name}", де: "src" - джерело: file - безпосередньо з локального (візуалізатор або рушій) файлу за шляхом; res - з таблиці mime ресурсів БД; stream - URL потоку для програвання відео та аудіо. "name" - шлях файлу або ідентифікатор mime-ресурсу. Приклади: "res:workMedia" - з таблиці mime ресурсів БД для ідентифікатору "workMedia"; "workMedia" - як і попередній; "file:/var/tmp/workMedia.mng" - з локального файлу за шляхом "/var/tmp/workMedia.mng"; "stream:http://localhost.localhost:5050" - програвання відео та аудіо потоку із URL.
