Repository: aleax/openscada
Catalog: src/moduls/ui/VCAEngine/po/*.po
Languages: de, ru, uk

source: Media type variant: "Image" - raster or vector image, like to: PNG, JPEG, GIF, SVG; "Animation" - simple animation image, like to: GIF, MNG; "Full video" - full video, audio or stream, like to: OGG, OGM, AVI, MKV, MPG, MP3, MP4.
de: Typ der Medien-Option: "Bild" - Raster-oder Vektordaten auf das Bild, wie: PNG, JPEG, GIF, SVG; "Animation" - einfaches animiertes Bild, wie: GIF, MNG; "Full Video" - volle Video, Audio oder Strom, wie: OGG, OGM, AVI, MKV, MPG, MP3, MP4.
ru: Тип медиа, вариант: "Изображение" - растровое или векторное изображение, вроде: PNG, JPEG, GIF, SVG; "Анимация" - простое анимированное изображение, вроде: GIF, MNG; "Полное видео" - полное видео, аудио или поток, вроде: OGG, OGM, AVI, MKV, MPG, MP3, MP4.
uk: Тип медіа, варіант: "Зображення" - растрове або векторне зображення, на зразок: PNG, JPEG, GIF, SVG; "Анімація" - просте анімоване зображення, на зразок: GIF, MNG; "Повне відео" - повне відео, аудіо або потік, на зразок: OGG, OGM, AVI, MKV, MPG, MP3, MP4.

source: Rectangle area in the form "x1,y1,x2,y2".
de: Rechteck Bereich in Form "x1,y1,x2,y2".
ru: Прямоугольная область в форме "x1,y1,x2,y2".
uk: Прямокутна область у формі "x1,y1,x2,y2".

source: Polygon area in the form "x1,y1,x2,y2,xN,yN".
de: Polygon-Bereich in Form "x1,y1,x2,y2,xN,yN".
ru: Полигонная область в форме "x1,y1,x2,y2,xN,yN".
uk: Полігонна область у формі "x1,y1,x2,y2,xN,yN".

source: Circle area in the form "x,y,r".
de: Kreisfläche in Form "x,y,r".
ru: Круговая область в форме "x,y,r".
uk: Кругова область у формі "x,y,r".

source: Diagram
de: Diagramm
ru: Диаграмма
uk: Діаграма

source: Diagram widget of the finite visualization.
de: Widget für das Diagramm der Visualisierung.
ru: Виджет диаграммы конечной визуализации.
uk: Віджет діаграми кінцевої візуалізації.

source: Tracing period, seconds
de: Trackingszeit, Sekunden
ru: Период слежения, секунд
uk: Період стеження, секунд

source: Trend;Spectrum;XY
de: Plan;Spektrum;XY
ru: График;Спектр;XY
uk: Графік;Спектр;XY

source: Cursor: seconds
de: Cursor: Sekunden
ru: Курсор: секунды
uk: Курсор: секунди

source: Cursor: microseconds
de: Cursor: Mikrosekunden
ru: Курсор: микросекунды
uk: Курсор: мікросекунди

source: Cursor: color
de: Cursor: Farbe
ru: Курсор: цвет
uk: Курсор: колір

source: Scale: horizontal grid size, seconds
de: Skala: Horiz. Gitterlinien Größe, Sekunden
ru: Шкала: размер гор. решетки, секунды
uk: Шкала: розмір гор. ґратки, секунди

source: Time: seconds
de: Zeit: Sekunden
ru: Время: секунды
uk: Час: секунди

source: Time: microseconds
de: Zeit: Mikrosekunden
ru: Время: микросекунды
uk: Час: мікросекунди

source: Size, seconds
de: Größe, Sekunden
ru: Размер, секунды
uk: Розмір, секунди

source: Scale: color
de: Skala: Farbe
ru: Шкала: цвет
uk: Шкала: колір

source: Scale: horizontal
de: Skala: waagerecht
ru: Шкала: горизонтальная
uk: Шкала: горизонтальна

source: No draw;Grid;Markers;Grid and markers;Grid (log);Markers (log);Grid and markers (log)
de: Zeichnen nicht;Gitter;Markierung;Gitter und Markierung;Gitter (log);Markierung (log);Gitter und Markierung (log)
ru: Не рисовать;Решетка;Маркеры;Решетка и маркеры;Решетка (лог);Маркеры (лог);Решетка и маркеры (лог)
uk: Не зображувати;Ґратка;Маркери;Ґратка та маркери;Ґратка (лог);Маркери (лог);Ґратка та маркери (лог)

source: Scale: horizontal scale (%)
de: Skala: horizontalen Maßstab (%)
ru: Шкала: гориз. масштаб (%)
uk: Шкала: гориз. масштаб (%)

source: Scale: horizontal scale offset (%)
de: Skala: senkrecht. Maßstab horizontalen (%)
ru: Шкала: смещ. гориз. масштаба (%)
uk: Шкала: зміщ. гориз. масштабу (%)

source: Scale: vertical
de: Skala: senkrecht
ru: Шкала: вертикальная
uk: Шкала: вертикальна

source: Scale: vertical scale (%)
de: Skala: senkrechter Maßstab (%)
ru: Шкала: верт. масштаб (%)
uk: Шкала: верт. масштаб (%)

source: Scale: vertical scale offset (%)
de: Skala: senkrecht. Maßstab verschieben (%)
ru: Шкала: смещ. верт. масштаба (%)
uk: Шкала: зміщ. верт. масштабу (%)

source: Scale: Markers: color
de: Skala: Markierung: Farbe
ru: Шкала: Маркеры: цвет
uk: Шкала: Маркери: колір

source: Scale: Markers: font
de: Skala: Markierung: Schrift
ru: Шкала: Маркеры: шрифт
uk: Шкала: Маркери: шрифт

source: Value archiver
de: Wertarchivierer
ru: Архиватор значений
uk: Архіватор значень

source: Values per pixel
de: Werte pro Pixel
ru: Значений на пиксель
uk: Значень на піксель

source: Parameters number
de: Anzahl der Parameter
ru: Количество параметров
uk: Кількість параметрів

source: Parameter
ru: Параметр
uk: Параметр

source: : address
de: : Adresse
ru: : адрес
uk: : адреса

source: : view border: lower
de: : Sicht Grenze: untere
ru: : граница отображ.: нижняя
uk: : границя відображ.: нижня

source: : view border: upper
de: : Sicht Grenze: obere
ru: : граница отображ.: верхняя
uk: : границя відображ.: верхня

source: : color
de: : Farbe
ru: : цвет
uk: : колір

source: : width
de: : Stärke
ru: : ширина
uk: : ширина

source: : scale
de: : Skale
ru: : шкала
uk: : шкала

source: Global;Markers;Grid and markers;Markers (log);Grid and markers (log)
de: Globally;Markierung;Gitter und Markierung;Markierung (log);Gitter und Markierung (log)
ru: Глобально;Маркеры;Решетка и маркеры;Маркеры (лог);Решетка и маркеры (лог)
uk: Глобально;Маркери;Ґратка та маркери;Маркери (лог);Ґратка та маркери (лог)

source: : properties
de: : Eigenschaften
ru: : свойства
uk: : властивості

source: Value archiver in the form "{ArchMod}.{ArchiverId}".
de: Wertarchivierer im Formular "{ArchMod}.{ArchivatorId}".
ru: Архиватор значений в форме "{МодульАрхивов}.{IdАрхиватора}".
uk: Архіватор значень у формі "{МодульАрхівів}.{IdАрхіватору}".

source: Number of the values per pixel. Increase to enhance the export accuracy at large time intervals.
de: Die Anzahl der Werte pro Pixel. Zoom, um die Genauigkeit der Ausführen in die großen Zeitabständen zu erhöhen.
ru: Количество значений на пиксел. Увеличить для расширения точности экспорта на больших интервалах времени.
uk: Кількість значень на піксель. Збільшити для розширення точності експорту на великих проміжках часу.

source: Full address to the DAQ attribute of the parameter or to the archive. Data installation by the direct prefix is supported: "data:{XMLNodeData}" - drawing from the direct set data; "line:{value}" - drawing horizontal line by the value, no sense have for the type "XY". Example: "/DAQ/System/AutoDA/MemInfo/use" - address to the attribute "use" of the parameter "MemInfo" of the controller "AutoDA" of the DAQ module "System"; "/Archive/va_CPULoad_load" - address to the archive "CPULoad_load"; "data:<d s="1" tm="1369465209" tm_grnd="1369465200" per="1"> 0 3.14 1 3.141 5 3.1415</d> - data for 10 seconds and period in 1 second from "25.05.2013 10:00:00"; in the absence of "tm" and "tm_grnd" they will be set from the range of the diagram, and setting the attribute "s" will allow you to specify the time in seconds; "line:3.14159265" - horizontal line for the value "3.14159265".
de: Vollständige Adresse zu DAQ Attribut eines Parameters oder in ein Archiv. Außerdem unterstützt direkten Montage Daten auf dem Präfix: "data:{XMLNodeData}" - zeichnung direkt aus dem Datensatz; "line:{Wert}" - zeichnung eine horizontale Linie sinnvoll, Keinen Sinn haben für Typ "XY". Beispiel: "/DAQ/System/AutoDA/MemInfo/use" - Adresse Attribut "use" des Parameters "MemInfo" des Controllers "AutoDA" des DAQ-Modul "System"; "/Archive/va_CPULoad_load" - Adresse zu archivieren "CPULoad_load"; "data:<d s="1" tm="1369465209" tm_grnd="1369465200" per="1"> 0 3.14 1 3.141 5 3.1415</d> - 10 Sekunden Daten bei 1 Sekunde von "25.05.2013 10:00:00"; bei Pass "tm" und "tm_grnd" Es wird Sätze Werte aus dem Diagramm-Bereich, und auch von Set Attribute "s" wird es ermöglicht die Zeit in Sekunden eingestellt "line:3.14159265" - eine horizontale Linie auf dem Wert "3.14159265".
ru: Полный адрес к атрибуту параметра DAQ или архиву. Также поддерживается прямая установка данных по префиксу: "data:{XMLNodeData}" - отрисовка из прямо установленных данных; "line:{значение}" - отрисовка горизонтальной линии по значению, не имеет смысла для типа "XY". Пример: "/DAQ/System/AutoDA/MemInfo/use" - адрес к атрибуту "use" параметра "MemInfo" контроллера "AutoDA" DAQ модуля "System"; "/Archive/va_CPULoad_load" - адрес к архиву "CPULoad_load"; "data:<d s="1" tm="1369465209" tm_grnd="1369465200" per="1"> 0 3.14 1 3.141 5 3.1415</d> - 10 секунд данных с периодом 1 секунда от "25.05.2013 10:00:00"; по отсутствию "tm" и "tm_grnd" они будут установлены в диапазон диаграммы, и установка атрибута "s" позволит указывать время в секундах; "line:3.14159265" - горизонтальная линия по значению "3.14159265".
uk: Повна адреса до атрибуту параметру DAQ або до архіву. Підтримується пряме встановлення даних за префіксом: "data:{XMLNodeData}" - побудова з прямо встановлених даних; "line:{значення}" - побудова горизонтальної лінії за значенням, не має сенсу для типу "XY". Приклад: "/DAQ/System/AutoDA/MemInfo/use" - адреса до атрибуту "use" параметру "MemInfo" контролеру "AutoDA" та DAQ модуля "System"; "/Archive/va_CPULoad_load" - адреса до архіву "CPULoad_load"; "data:<d s="1" tm="1369465209" tm_grnd="1369465200" per="1"> 0 3.14 1 3.141 5 3.1415</d> - 10 секунд даних з періодом 1 секунда від "25.05.2013 10:00:00"; за відсутністю "tm" та "tm_grnd" їх буде встановлено із діапазону діаграми, та встановлення атрибуту "s" дозволить вказувати час у секундах; "line:3.14159265" - горизонтальна лінія за значенням "3.14159265".

source: Actual archive properties in the form "{BegArh}:{EndArh}:{DataPeriod}", where: "BegArh", "EndArh", "DataPeriod" - begin, end and period of data of the archive in seconds, it is the real value up to the microseconds deep (1e-6).
de: Die Eigenschaften des echten Archive in Form "{BegArh}:{EndArh}:{DataPeriod}", wo: "BegArh", "EndArh", "DataPeriod" - Anfang, Ende und während der Daten-Archiv in Sekunden, es ist der wahre Wert bis in die Mikrosekunden Tiefe (1e-6).
ru: Свойства актуального архива в виде "{BegArh}:{EndArh}:{DataPeriod}", где: "BegArh", "EndArh", "DataPeriod" - начало, конец и период данных архива в секундах, в реальном представлении глубиной до микросекунд (1e-6).
uk: Властивості актуального архіву у вигляді "{BegArh}:{EndArh}:{DataPeriod}", де: "BegArh", "EndArh", "DataPeriod" - початок, кінець та період даних архіву у секундах, в реальному представлені глибиною до мікросекунд (1e-6).

source: Protocol
de: Protokoll
ru: Протокол
uk: Протокол

source: Protocol widget of the finite visualization.
de: Widget für das Protokoll der Visualisierung.
ru: Виджет формирования протокола конечной визуализации.
uk: Віджет протоколу кінцевої візуалізації.

source: Header visible
de: Titel sichtbar
ru: Заголовок видим
uk: Заголовок видимий

source: Time, seconds
de: Zeit, Sekunden
ru: Время, секунды
uk: Час, секунди

source: Archiver
ru: Архиватор
uk: Архіватор

source: Template
de: Vorlage
ru: Шаблон
uk: Шаблон

source: Level
ru: Уровень
uk: Рівень

source: View order
de: Ordnung der Widerspiegelung
ru: Порядок отображения
uk: Порядок відображення

source: On time;On level;On category;On messages;On time (reverse);On level (reverse);On category (reverse);On messages (reverse)
de: Nach der Zeit;Nach dem Niveau;Nach der Kategorie;Nach der Nachricht;Nach der Zeit;Nach dem Niveau;Nach der Kategorie (reziprok);Nach der Kategorie (reziprok);Nach der Nachricht(reziprok)
ru: По времени;По уровню;По категории;По сообщению;По времени (обратный);По уровню (обратный);По категории (обратный);По сообщению (обратный)
uk: За часом;За рівнем;За категорією;За повідомленням;За часом (обернений);За рівнем (обернений);За категорією (обернений);За повідомленням (обернений)

source: Show columns
de: Spalten anzeigen
ru: Показать колонки
uk: Показати колонки

source: Item properties
de: Eigenschaften des Elements
ru: Свойства элемента
uk: Властивості елемента

source: Item
de: Element
ru: Элемент
uk: Елемент

source: : level
ru: : уровень
uk: : рівень

source: : template
de: : Vorlage
ru: : шаблон
uk: : шаблон

source: : font
de: : Schrift
ru: : шрифт
uk: : шрифт

source: Messages archiver in the form "{ArchMod}.{ArchiverId}".
de: Nachrichten archivieren im Formular "{ArchMod}.{ArchivatorId}".
ru: Архиватор сообщений в форме "{МодульАрхивов}.{IdАрхиватора}".
uk: Архіватор повідомлень у формі "{МодульАрхівів}.{IdАрхіватору}".

source: Set value to "< 0" for get the current alarms.
de: Einstellen der Werte "< 0" für sich aktuelle Meldungen.
ru: Установите значение "< 0" для получения текущих нарушений.
uk: Встановіть значення у "< 0" для отримання поточних порушень.

source: Set value to "0" for get all alarms, for "lev" < 0.
de: Set Wert auf "0" für alle Alarme erhalten, zu "lev" < 0 ist.
ru: Установите значение в "0" для получения всех нарушений, для "lev" < 0.
uk: Встановіть значення у "0" для отримання всіх порушень, для "lev" < 0.

source: Category template or the regular expression "/{re}/". For the template there reserved the special symbols: '*' - any multiply symbols group; '?' - any one symbol; '\' - use to shield the special simbols.
de: Kategorie Vorlage oder reguläre Ausdruck "/{re}/". Die Vorlage für reservierte Zeichen: '*' - alle Symbole multiplizieren Gruppe; '?' - einem Symbol; '\' - Einsatz für spezielle Abschirmung simbols.
ru: Шаблон категории или регулярное выражение "/{re}/". Для шаблона зарезервированы символы: '*' - множество любых - группа символов; '?' - любой - один символ; '\' - используйте для экранирования специальных символов.
uk: Шаблон категорії або регулярний вираз "/{re}/". Для шаблона зарезервовано символи: '*' - множина будь яких - група символів; '?' - будь який - один символ; '\' - використовуйте для екранування спеціальних символів.

source: List of visible and the columns order separated by the symbol ';'. Supported columns: "pos" - row number; "tm" - date and time of the message; "utm" - microseconds part of the message time; "lev" - level of the message; "cat" - category of the message; "mess" - text of the message.
de: Sichtbare und Ordnung Spalten Liste von Symbol getrennt ';'. Unterstützte Spalten: "pos" - Zeilennummer; "tm" - Datum und Uhrzeit der Nachricht; "utm" - Mikrosekunden Teil der Zeit der Meldung; "lev" - Ebene der Nachricht; "cat" - Kategorie der Meldung; "mess" - den Nachrichtentext ein.
ru: Список видимых и порядок колонок, разделённый символом ';'. Поддерживаются колонки: "pos" - номер строки; "tm" - дата и время сообщения; "utm" - микросекундная часть времени сообщения; "lev" - уровень сообщения; "cat" - категория сообщения; "mess" - текст сообщения.
uk: Перелік видимих та порядок рядків, поділених символом ';'. Підтримуються рядки: "pos" - номер рядку; "tm" - дата та час повідомлення; "utm" - мікросекундна частина часу повідомлення; "lev" - рівень повідомлення; "cat" - категорія повідомлення; "mess" - текст повідомлення.

source: Document
de: Dokument
ru: Документ
uk: Документ

source: Document widget of the finite visualization.
de: Widget für das Dokument der Visualisierung.
ru: Виджет формирования документа конечной визуализации.
uk: Віджет формування документу кінцевої візуалізації.

source: Time: begin
de: Zeit: Beginn
ru: Время: начало
uk: Час: початок

source: Time: current
de: Zeit: laufend
ru: Время: текущее
uk: Час: поточний

source: In the process
de: In dem Prozess
ru: В процессе
uk: У процесі

source: Archive size
de: Archivgrösse
ru: Размер архива
uk: Розмір архіву

source: Archive: cursor: view
de: Archiv: Cursor: Aussehen
ru: Архив: курсор: вид
uk: Архів: курсор: перегляд

source: Archive: cursor: current
de: Archiv: Cursor: Strom
ru: Архив: курсор: текущий
uk: Архів: курсор: поточний

source: Archive: current document
de: Archiv: Strom Dokument
ru: Архив: текущий документ
uk: Архів: поточний документ

source: Archive: size
de: Archiv: grösse
ru: Архив: размер
uk: Архів: розмір

source: CSS rules in the rows like to "body { background-color:#818181; }"
de: CSS-Regeln in den Zeilen mögen "body { background-color:#818181; }"
ru: Правила CSS в строках вроде "body { background-color:#818181; }"
uk: CSS правила у рядках на кшталт "body { background-color:#818181; }"

source: Document template in XHTML. Starts from the tag "body" and include the procedures parts: <body docProcLang="JavaLikeCalc.JavaScript"> <h1>Value<?dp return wCod+1.314;?></h1> </body>
de: Dokument der Vorlage in XHTML. Start von Tag "body" und auch Verfahren Teilen: <body docProcLang="JavaLikeCalc.JavaScript"> <h1>Value<?dp return wCod+1.314;?></h1> </body>
ru: Шаблон документа в XHTML. Начинается с тега "body" и включает процедурные вставки: <body docProcLang="JavaLikeCalc.JavaScript"> <h1>Значение<?dp return wCod+1.314;?></h1> </body>
uk: Шаблон документу у XHTML. Починається з тегу "body" та включає процедурні включення: <body docProcLang="JavaLikeCalc.JavaScript"> <h1>Значення<?dp return wCod+1.314;?></h1> </body>

source: Final document in XHTML, starting from the tag "body".
de: Final-Dokument in XHTML, start von Tag "body".
ru: Финальный документ в XHTML, начинается с тега "body".
uk: Результуючий документ в XHTML, починається з тегу "body".

source: Write the time for the document generation from the specified one or zero for regeneration.
de: Schreiben Sie Zeit für Dokumentenerstellung von diesem Punkt aus oder Null für die Regeneration.
ru: Записать время для генерации документа от этой точки или нуль для регенерации.
uk: Записати час для генерації документу з цієї точки або нуль для регенерації.

source: Current archive document in XHTML, starting from the tag "body".
de: Aktuelles Archivdokument in XHTML, beginnend mit dem Tag "Körper".
ru: Текущий документ архива в XHTML, начинается с тега "body".
uk: Поточний документ архіву у XHTML, починається з тегу "body".

source: Error parsing the document: %s.
de: Fehler beim Parsen des Dokuments: %s.
ru: Ошибка разбора документа: %s.
uk: Помилка розбору документа: %s.

source: Result
de: Ergebnis
ru: Результат
uk: Результат

source: Document time
de: Zeit des Dokuments
ru: Время документа
uk: Час документу

source: Document begin time
de: Startzeit des Dokuments
ru: Время начала документа
uk: Час початку документа

source: Last time
de: Das letzte Mal
ru: Последнее время
uk: Останній час

source: Repeat time, seconds
de: Wiederholungszeit, Sekunden
ru: Время повтора, секунд
uk: Час повтору, секунд

source: Repeat time, microseconds
de: Wiederholungszeit, Mikrosekunden
ru: Время повтора, микросекунд
uk: Час повтору, мікросекунд

source: Repeat period
de: Wiederholungsperiode
ru: Период повтора
uk: Період повтору

source: Message time, seconds
de: Nachrichtenzeit, Sekunden
ru: Время сообщения, секунд
uk: Час сповіщення, секунд

source: Message time, microseconds
de: Nachrichtenzeit, Mikrosekunden
ru: Время сообщения, микросекунд
uk: Час сповіщення, мікросекунд

source: Message level
de: Stufe der Nachricht
ru: Уровень сообщения
uk: Рівень повідомлення

source: Message category
de: Kategorie der Nachricht
ru: Категория сообщения
uk: Категорія повідомлення

source: Message value
de: Wert der Nachricht
ru: Значение сообщения
uk: Значення повідомлення

source: Error compiling function for the document: %s
de: Fehler beim Kompilieren der Funktion für das Dokument: %s
ru: Ошибка компиляции функции для документа: %s
uk: Помилка компіляції функції для документа: %s

source: <BODY> <H1>The document is forming now ...</H1> <P>The document is too big for generating into the standard user interface timeout (%ds). And for now the document is into the building. You can wait the forming finish or terminate the process by select lesser time interval for the document.</P> <P>The building progress: <ul id='progress' /> </P> </BODY>
de: <BODY> <H1>Das Dokument wird gebildet ...</H1> <P>Dieses Dokument ist sehr groß für eine Generation in der Standard-Timeout-Benutzeroberfläche (%ds). Nun ist die Dokument gebildet ist. Sie könnten für die Beendigung der Ausbildung warten oder den Vorgang abbrechen, indem Sie einen kleineren Bereich für das Dokument.</P> <P>Fortschritt Bildung: <ul id='progress' /> </P> </BODY>
ru: <BODY> <H1>Документ формируется ...</H1> <P>Этот документ очень большой для генерации в стандартном таймауте пользовательского интерфейса (%dс). Сейчас этот документ формируется. Вы можете подождать завершения формирования или прервать процесс, выбрав меньший интервал для документа.</P> <P>Прогресс формирования: <ul id='progress' /> </P> </BODY>
uk: <BODY> <H1>Документ формується ...</H1> <P>Цей документ дуже великий для генерації у стандартному таймауті користувацького інтерфейсу (%dс). Зараз цей документ формується. Ви можете зачекати завершення формування або перервати процес, обравши менший інтервал для документа.</P> <P>Прогрес формування <ul id='progress' /> </P> </BODY>

source: Error executing instruction '%s': %s
de: Fehler beim Ausführen der Anweisung '%s': %s
ru: Ошибка исполнения инструкции '%s': %s
uk: Помилка виконання інструкції '%s': %s

source: Error code: %s
de: Fehlercode : %s
ru: Код с ошибкой: %s
uk: Код з помилкою: %s

source: Data block %d: %0.2f%% loaded.
de: Datenbaustein %d: %0.2f%% beladen.
ru: Блок данных %d: %0.2f%% загружено.
uk: Блок даних %d: %0.2f%% завантажено.

source: Messages block %d: %0.2f%% loaded.
de: Meldeblock %d: %0.2f%% beladen.
ru: Блок сообщений %d: %0.2f%% загружено.
uk: Блок повідомлень %d: %0.2f%% завантажено.

source: Document generation terminated.
de: Dokumentenerstellung kündigen.
ru: Прервана генерация документа.
uk: Перервано генерацію документа.

source: Built-in function
de: Installierte Funktion
ru: Встроенная функция
uk: Вбудована функція

source: Built-in function widget.
de: Widget für die installierte Funktion
ru: Виджет встроенной функции
uk: Віджет вбудованої функції

source: Group of elements
de: Gruppe von Elementen
ru: Группа элементов
uk: Група елементів

source: Widget of the group of elements of the finite visualization.
de: Widget der Elementgruppe der endlichen Visualisierung.
ru: Виджет группы элементов конечной визуализации.
uk: Віджет групи елементів кінцевої візуалізації.

source: Page: source of the opening
de: Seite: Quelle der Eröffnung
ru: Стр.: источник открытия
uk: Стор.: джерело відриття

source: Page: group
de: Seite: Gruppe
ru: Стр.: группа
uk: Стор.: група
