Repository: aleax/openscada
Catalog: src/moduls/transport/SSL/po/*.po
Languages: de, uk

source: Roman Savochenko
de: Roman Savotschenko
uk: Роман Савоченко

source: Provides transport based on the secure sockets' layer. OpenSSL is used and supported SSL-TLS depending on the library version.
de: Stellt Transport basierend auf der Secure-Sockets-Schicht bereit. Abhängig von der Bibliotheksversion wird OpenSSL verwendet und SSL-TLS unterstützt.
uk: Надає транспорт, заснований на безпечному шарі сокетів. Використано OpenSSL та підтримуються SSL-TLS залежно від версії бібліотеки.

source: State
de: Staats
uk: Стан

source: Server ciphers
de: Serverchiffren
uk: Серверні шифри

source: Client ciphers
de: Client-Chiffren
uk: Клієнтські шифри

source: SSL output transport has the address format "{addr}[,{addrN}]:{port}", where: addr - address with which the connection is made; there may be as the symbolic representation as well as IPv4 "127.0.0.1" or IPv6 "[::1]"; port - network port with which the connection is made; indication of the character name of the port according to /etc/services is available.
de: Der SSL-Ausgabetransport hat das Adressformat "{addr}[,{addrN}]:{port}", wob: addr - Adresse, mit der die Verbindung hergestellt wird; Dort kann sowohl die symbolische Darstellung als auch IPv4 "127.0.0.1" oder IPv6 "[::1]" der Adressen sein; port - Netzwerk-Port mit dem die Verbindung hergestellt wird; Angabe des Charakternamens des Ports gemäß /etc/services ist verfügbar.
uk: Вихідний SSL транспорт має формат адреси "{addr}[,{addrN}]:{port}", де: addr - адреса до якої здійснюється підключення; допускається як символьне так й IPv4 "127.0.0.1" або IPv6 "[::1]" представлення адреси; port - мережевий порт, до якого здійснюється підключення; можливе вказання символьного ім'я порту відповідно до /etc/services.

source: Connection timings in the format "{conn}:{next}", where: conn - maximum time of waiting the connection, in seconds; next - maximum time of waiting for continue the response, in seconds.
de: Die Zeitabstände sind Verbindung in das Format: "{conn}:{next}", wo: conn - maximale Wartezeit Verbindung in Sekunden; next - maximale Wartezeit auf die Antwort in Sekunden weiter.
uk: Таймаути підключення у форматі "{conn}:{next}", де: conn - максимальний час очікування відповіді з'єднання, у секундах; next - максимальний час очікування продовження відповіді, у секундах.

source: Can be prioritatile specified in the address field as the second global argument, as such "localhost:123||5:1".
de: Als zweites globales Argument kann priorityatile im Adressfeld angegeben werden, zB "localhost:123||5:1".
uk: Може бути пріоритетно визначено другим глобальним аргументом поля адреси, на кшталт "localhost:123||5:1".

source: Attempts of the requesting both for this transport and protocol, for full requests.
de: Versuche des Anforderns sowohl für diesen Transport als auch für das Protokoll, für vollständige Anfragen.
uk: Спроб запиту транспортом та протоколом, для повних запитів.

source: Can be prioritatile specified in the address field as the third global argument, as such "localhost:123||5:1||3".
de: Als das dritte globale Argument kann priorityatile in das Adressfeld angegeben werden, zB "localhost:123||5:1||3".
uk: Може бути пріоритетно визначено третім глобальним аргументом поля адреси, на кшталт "localhost:123||5:1||3".

source: Closing the file %d error '%s (%d)'!
de: Schließen der Datei %d Fehler '%s (%d)'!
uk: Помилка закриття файлу %d - '%s (%d)'!

source: Error connecting:
de: Verbindungsfehler:
uk: Помилка під'єднання:

source: The host address '%s'.
uk: Адреса хосту '%s'.

source: Connections %d, opened %d, last %s, closed by the limit %d.
de: Verbindungen %d, geöffnet %d, zuletzt %s, geschlossen durch das Limit %d.
uk: Підключень %d, відкрито %d, останнє %s, закрито з'єднань за лімітом %d.

source: Traffic in %s, out %s.
de: Verkehr in %s, aus %s.
uk: Трафік вхідний %s, вихідний %s.

source: Processing time %s[%s].
de: Bearbeitungszeit %s[%s].
uk: Час обробки %s[%s].

source: Size input buffer %s, MSS %s.
de: Größe Eingabepuffer %s, MSS %s.
uk: Розмір вхідного буферу %s, MSS %s.

source: Shared ciphers: %s.
de: Gemeinsam genutzte Chiffren: %s.
uk: Спільні шифри: %s.

source: Client ciphers: %s.
de: Client-Chiffren: %s.
uk: Клієнтські шифри: %s.

source: Error opening the temporary file '%s': '%s'
de: Fehler beim Öffnen der temporären Datei '%s': '%s'
uk: Помилка відкриття тимчасового файлу '%s': '%s'

source: Error writing the file '%s'.
de: Fehler beim Schreiben der Datei '%s'.
uk: Помилка запису файлу '%s'.

source: Specify a certificate file or directly the certificates and private key with password!
de: Geben Sie eine Zertifikatsdatei oder direkt die Zertifikate und privaten Schlüssel mit Passwort an!
uk: Визначте файл сертифікатів або прямо сертифікати і приватний ключ із паролем!

source: Connected
de: Verbunden
uk: Під'єднано

source: Disconnected
de: Getrennt
uk: Від'єднано

source: The certificate file '%s' was updated, reconnecting the transport...
de: Die Zertifikatsdatei '%s' wurde aktualisiert, die Verbindung zum Transport wird wiederhergestellt...
uk: Файл сертифікатів '%s' оновлено, перепідключення транспорту...

source: Reconnect due to lack of input activity to '%s'.
de: Reconnect wegen fehlender Eingabeaktivität für '%s'.
uk: Перепід'єднання через відсутність вхідної активності на '%s'.

source: The input transport closed by the error: %s
de: Der Eingabetransport wurde geschlossen durch den Fehler: %s
uk: Вхідний транспорт закрито за помилкою: %s

source: Error creating the thread!
de: Fehler beim Erstellen des Threads!
uk: Помилка створення потоку!

source: stopping client tasks ...
de: Client-Aufgaben stoppen ...
uk: зупинка клієнтських задач ...

source: Socket has been connected by '%s'!
de: Socket ist verbunden von '%s'!
uk: Підключення до сокету з '%s'!

source: Socket has been terminated by the error %s
de: Socket wurde beendet mit dem Fehler %s
uk: Сокет було перервано помилкою %s

source: The message is received in size %d.
de: Die Nachricht wird in der Größe %d empfangen.
uk: Отримано повідомлення розміром %d.

source: %d:< Received from '%s'
de: %d:< Empfangen von '%s'
uk: %d:< Отримано з '%s'

source: The reply by the message in size %d.
de: Die Antwort der Nachricht in der Größe %d
uk: Відповідь повідомленням розміром %d.

source: %d:> Transmitted to '%s'
de: %d:> Übertragen in '%s'
uk: %d:> Передано до '%s'

source: Has been disconnected by '%s'!
de: Wurde von abgeklemmt '%s'!
uk: Від'єднано від '%s'!

source: The socket has been terminated by the exception %s
de: Der Socket wurde beendet durch die Ausnahme %s
uk: Сокет було перервано виключенням %s

source: %d:Has been terminated by the exception %s
de: %d:Wurde beendet durch die Ausnahme %s
uk: %d:Перервано виключенням %s

source: The new input protocol's object '%s' is created!
de: Neue Eingangsprotokoll-Objekt '%s' erstellt!
uk: Новий об'єкт вхідного протоколу '%s' створено!

source: All protocols is wrong for their initialization.
de: Alle Protokolle sind falsch für ihre Initialisierung.
uk: Помилка ініціалізації всіх протоколів.

source: The input protocol object '%s' has closed itself!
de: Das Eingabeprotokollobjekt '%s' hat sich selbst geschlossen!
uk: Об'єкт вхідного протоколу '%s' закрився сам!

source: Error requesting the protocol.
de: Fehler der Anfrage ans Protokoll.
uk: Помилка запиту протоколу.

source: New client %d of '%s' connected
de: Ein neuer Kunde %d aus '%s' verbunden
uk: Підключено новий клієнт %d з %s

source: The client %d of '%s' disconnected
de: Client %d aus '%s' getrennt
uk: Відключено клієнт %d з %s

source: Active connections
de: Aktive Verbindungen
uk: Активні підключення

source: Supported ciphers
de: Unterstützte Chiffren
uk: Підтримувані шифри

source: SSL input transport has the address format "{addr}[:{port}[,{port2}[,{portN}]][:{mode}[:{IDmess}]]]", where: addr - address to open SSL, it must be one of the addresses of the host; empty or "*" address opens SSL for all interfaces; there may be as the symbolic representation as well as IPv4 "127.0.0.1" or IPv6 "[::1]"; port, port2, portN - network ports on which SSL is sequential opened (at busy the first ones), indication of the character name of the port, according to /etc/services is available; mode - mode of operation: 0(default) - ordinal connection; 2 - initiative connection; IDmess - identification message of the initiative connection - the mode 2.
uk: Вхідний SSL транспорт має формат адреси "{addr}[:{port}[,{port2}[,{portN}]][:{mode}[:{IDmess}]]]", де: addr - адреса для відкриття SSL, має бути однією з адрес хосту; порожня або "*" адреса відкриває SSL на всіх інтерфейсах; допускаються як символьне, так й IPv4 "127.0.0.1" або IPv6 "[::1]" представлення адреси; port, port2, portN - мережеві порти на яких послідовно відкривається SSL (при зайнятості перших), можливе вказання символьного ім'я порту відповідно до /etc/services; mode - режим функціювання: 0(типово) - звичайне з'єднання; 2 - ініціативне підключення; IDmess - ідентифікуюче повідомлення ініціативного підключення - режим 2.

source: Priority
de: Priorität
uk: Пріоритет

source: Input buffer size, kB
de: Größe Eingabepuffer, KB
uk: Розмір вхідного буферу, кБ

source: Set 0 for the system value.
de: Stellen Sie 0 als Systemwert ein.
uk: Встановити 0 для системного значення.

source: Maximum segment size (MSS), B
de: Maximale Segmentgröße (MSS), B
uk: Максимальний розмір сегменту (MSS), Б

source: PEM-file of the certificates and private key
de: PEM-Datei der Zertifikate und des privaten Schlüssels
uk: PEM-файл сертифікатів та приватного ключа

source: Certificates and private key
de: Zertifikate und Privatschlüssel
uk: Сертифікати та приватний ключ

source: SSL PAM certificates chain and private key.
de: Die Kette von SSL PAM Zertifikaten und Privatschlüssel.
uk: Ланцюг SSL PAM сертифікатів та приватний ключ.

source: Private key password
de: Das Kennwort des Privatschlüssels
uk: Пароль приватного ключа

source: Maximum number of clients
de: Maximale Anzahl von Clients
uk: Максимальна кількість клієнтів

source: Maximum number of clients per host
de: Maximale Anzahl von Clients pro Host
uk: Максимальна кількість клієнтів за хостами

source: Set to 0 to disable this limit.
de: Setzen Sie den Wert auf 0, um dieses Limit zu deaktivieren.
uk: Встановити у 0 для вимкнення цього обмеження.

source: Keep alive requests
de: Keep alive Anfragen
uk: Keep alive запитів

source: Closing the connection after the specified requests. Zero value to disable - do not close ever.
de: Schließen Sie die Verbindung nach bestimmten Anfragen. Null-Wert für disable - nicht immer schließen.
uk: Закриття підключення після визначеної кількості запитів. Нульове значення для відключення - не закривається ніколи.

source: Keep alive timeout, seconds
de: Keep alive Wartezeit, Sekunden
uk: Keep alive час очікування, секунд

source: Closing the connection after no requests at the specified timeout. Zero value to disable - do not close ever.
de: Schließen Sie die Verbindung nach keine Anfragen zu bestimmten Timeout. Null-Wert für disable - nicht immer schließen.
uk: Закриття підключення після відсутності запитів протягом визначеного часу. Нульове значення для відключення - не закривається ніколи.

source: Timeouts, tries
de: Auszeiten, Versuche
uk: Таймаути, спроби

source: ... of the initiative connection and the associated output transports, empty for default and separated by '||'.
de: ... der Initiative-Verbindung und der zugehörigen Ausgabetransporte, standardmäßig leer und durch '||' getrennt.
uk: ... ініціативного підключення і асоційованих вихідних транспортів, порожнє для типового і поділене '||'.

source: %s %d(%s): last %s; traffic in %s, out %s;
de: %s %d(%s): letzte %s; eingangstraffik %s, Ausgangs- %s;
uk: %s %d(%s): останній %s; трафік вхідний %s, вихідний %s;

source: processing time %s[%s];
de: Bearbeitungszeit %s[%s];
uk: час обробки %s[%s];

source: To the host address '%s'.
uk: До адреси хосту '%s'.

source: Response time %s[%s].
de: Reaktionszeit %s[%s].
uk: Час відповіді %s[%s].

source: Error the address '%s': '%s (%d)'
de: Fehler bei der Adresse '%s': '%s (%d)'
uk: Помилка адреси '%s': '%s (%d)'

source: sockaddr to large.
de: sockaddr zu groß.
uk: sockaddr дуже великий.

source: Error creating TCP socket: %s!
de: Fehler Schaffung TCP-Socket: %s!
uk: Помилка створення TCP сокету: %s!

source: Error connecting to the internet socket '%s:%s' during the time %s, it seems in down or inaccessible: '%s (%d)'!
uk: Помилка підключення до інтернет сокету '%s:%s' протягом таймауту %s, він схоже відключений або недоступний: '%s (%d)'!

source: Closing the socket %d error '%s (%d)'!
de: Schließen des Sockets %d Fehler '%s (%d)'!
uk: Помилка закриття сокету %d - '%s (%d)'!

source: We are stopping!
de: Wir hören auf!
uk: Ми зупиняємося!

source: Error connecting: %s
de: Verbindungsfehler: %s
uk: Помилка під'єднання: %s

source: The force socket is deactivated!
de: Der Kraftsockel ist deaktiviert!
uk: Примусовий сокет деактивовано!

source: The force socket is not activated!
de: Die Force-Steckdose ist nicht aktiviert!
uk: Примусовий сокет не активовано!

source: Error the force socket %d using: '%s (%d)'!
de: Fehler beim Force-Socket %d mit: '%s (%d)'!
uk: Помилка використання примусового сокету %d: '%s (%d)'!

source: Unknown error
de: Unbekannter Fehler
uk: Невідома помилка

source: Transport is not connected!
de: Transport ist nicht verbunden!
uk: Транспорт не під'єднано!

source: Error requesting: %s
de: Fehler beim Anfordern: %s
uk: Помилка запиту: %s

source: Error writing: %s
de: Fehler beim Schreiben: %s
uk: Помилка запису: %s

source: Wrote %s.
de: Schrieb %s.
uk: Записано %s.

source: > Transmitted to
de: > Übertragen an
uk: > Передано

source: No data, the connection seems closed
de: Keine Daten, die Verbindung scheint geschlossen zu sein
uk: Немає даних, з'єднання схоже закрите

source: Error reading: %s
de: Fehler beim Lesen: %s
uk: Помилка читання: %s

source: Reading timeouted.
de: Lesen timeouted.
uk: Перевищено час очікування читання.

source: Error reading (select): %s
de: Fehler beim Lesen (Auswählen): %s
uk: Помилка читання (select): %s

source: Read %s.
de: Lesen Sie %s.
uk: Прочитано %s.

source: < Received from
de: < Empfangen von
uk: < Отримано

source: Timings
de: Zeitabstände
uk: Інтервали часу

source: Attempts
de: Versuche
uk: Спроб

source: SSL input transport has the address format "{addr}:{port}[:{mode}[:{IDmess}]]", where: addr - address to open SSL, it must be one of the addresses of the host; empty or "*" address opens SSL for all interfaces; there may be as the symbolic representation as well as IPv4 "127.0.0.1" or IPv6 "[::1]"; port - network port on which the SSL is opened, indication of the character name of the port, according to /etc/services is available; mode - mode of operation: 0(default) - ordinal connection; 2 - initiative connection; IDmess - identification message of the initiative connection - the mode 2.
de: Das Format der Adresse des SSL Eingangstransports "{addr}:{port}[:{mode}[:{IDmess}]]", wo: addr - Adresse, um SSL zu öffnen, muss es eine der Adressen des Hosts sein; leere oder "*" Adresse öffnet den SSL für alle Schnittstellen; dort kann sowohl die symbolische Darstellung als auch IPv4 "127.0.0.1" oder IPv6 "[::1]" der Adressen sein; port - Netzwerkport auf dem das SSL geöffnet ist, Angabe des Charakternamens des Ports gemäß /etc/services ist verfügbar; mode - Arbeitsweise: 0(Default) - Ordinalverbindung; 2 - Initiative Verbindung; IDmess - Identifikationsnachricht der Initiativverbindung - der Modus 2.

source: To the host '%s'.
de: An den Host '%s'.

source: Error connecting to the internet socket '%s:%s' during the timeout, it seems in down or inaccessible: '%s (%d)'!
de: Fehler beim Verbinden mit dem Internet-Socket '%s:%s' während des Timeouts, es scheint nicht aktiv oder erreichbar zu sein: '%s (%d)'!
