Repository: aleax/openscada
Catalog: src/moduls/daq/JavaLikeCalc/po/*.po
Languages: de

source: Internal function inaccessible by offset %d > %d
de: Interne Funktion unzugänglich durch Offset %d > %d

source: Variable '%s' just after variable '%s'
de: Variable '%s' unmittelbar nach der Variable '%s'

source: Variable '%s' is used but undefined
de: Die Variable '%s' wird verwendet, ist aber nicht definiert

source: Error constant after constant
de: Fehler konstant nach konstanter

source: %s, pos: (%d,%d)-(%d,%d).
de: %s, Position: (%d,%d)-(%d,%d).

source: Unexpected end program, expect end string symbol '"',
de: Unerwartetes Programmende, erwarte Endezeichen '"',

source: The next line symbol failed into string,
de: Das Zeichen für das Zeilenende ist in der Zeichenkette,

source: Using namespace is error or empty,
de: Namensbereich ist fehlerhaft oder leer,

source: Internal function declaration error,
de: Interne Funktionsdeklaration Fehler,

source: Internal function '%s' defined early,
de: Interne Funktionen '%s' früh definiert,

source: Do not include declaration of one internal function to other,
de: Nicht Deklaration einer internen Funktion auf andere schließen,

source: Build in function has too much parameters,
de: Installierte Funktion hat zu viel Parameter,

source: Function error,
de: Funktionsfehler,

source: Symbol error,
de: Symbolfehler,

source: Object's properties too long,
de: Eigenschaften des Objekts zu lang,

source: Array has more than 255 elements.
de: Array haben mehr 255 Artikel.

source: RegExp requires one or two parameters.
de: RegExp benötigen einen oder zwei Parameter.

source: Operation code %d is not supported.
de: Operationscode %d wird nicht unterstützt.

source: Number of external functions reached the limit of %d on the function '%s'
de: Externe Funktionen Anzahl überschrittene Grenzen bis %d bei Funktion '%s'

source: More than %d(%d) parameters are specified for the function '%s'
de: Mehr als %d(%d) Parameter sind für die Funktion '%s' angegeben

source: Function '%s' is called, but it does not have the IO-return
de: Funktion ist aufgerufen '%s', sie hat aber keine Rückgabe

source: Function name is longer than 254.
de: Name der Funktion länger bis 254.

source: Object function contains more than 255 parameters.
de: Object-Funktion haben mehr 255 Parameter.

source: Obtaining an object from a non-object register
de: Lade Objekt nicht vom Objektregister

source: Function is interrupted by an error
de: Funktion Ausführung abgebrochen durch Fehler

source: Calculation time has been exceeded %d > %d+%d
de: Berechnungszeit wurde überschritten %d > %d+%d

source: Exception of creating %d items of the array.
de: Ausnahme beim Erstellen von %d Elementen des Arrays.

source: Type %d, which is not supported by the 'Add' operation.
de: Geben Sie %d ein, das von der Operation 'Hinzufügen' nicht unterstützt wird.

source: You have too deep recursion of the internal function call.
de: Sie haben eine zu tiefe Rekursion des internen Funktionsaufrufs.

source: Error operation %c(%xh). Function '%s' stopped.
de: Fehler bei der Operation %c(%xh). Funktion '%s' ist angehalten.

source: Function:
de: Funktion:

source: Date of modification
de: Änderungsdatum

source: Compilation state
de: Kompilierungsstatus

source: Description
de: Beschreibung

source: To start
de: Starten

source: Maximum calculation time, seconds
de: Maximale Zeit der Berechnung, Sekunden

source: Program
de: Programm

source: Identifier
de: Identifikator

source: The name's rows after the first one treat as help.
de: Die Namenszeilen nach der ersten behandeln als Hilfe.

source: Type
de: Typ

source: Real;Integer;Boolean;String;String (translate);Text;Text (translate);Object
de: Reellezahl;Ganzzahl;Logisch;Saite;Saite (übersetzen);Text;Text (übersetzen);Objekt

source: Input;Output;Return
de: Eingang;Ausgang;Rückgabe

source: Hidden
de: Versteckt

source: Default
de: Standard

source: Size source %s, bytecode %s; Registers totally %d, constants %d, internal functions' %d; Functions external %d, internal %d.
de: Größe Quelle %s, Bytecode %s; Register total %d, Konstanten %d, interne Funktionen %d; Funktionen extern %d, intern %d.

source: New IO
de: Neu IO

source: Empty value is not allowed.
de: Leerer Wert ist nicht zulässig.

source: Library of the functions:
de: Bibliothek der Funktionen:

source: Function
de: Funktion

source: Library
de: Bibliothek

source: State
de: Zustand

source: Accessible
de: Zugänglich

source: Library DB
de: Datenbank der Bibliothek

source: Storage address in the format "{DB module}.{DB name}.{Table name}". To use the Generic Storage, set '*.*.{Table name}'.
de: Speicheradresse im Format "{DB-Modul}.{DB-Name}.{Table name}". Um den generischen Speicher zu verwenden, legen Sie '*.*.{Table name}' fest.

source: Remove from '%s'
de: Entfernen von '%s'

source: Configuration
de: Konfiguration

source: Functions
de: Funktionen

source: Calculator on the Java-like language
de: Rechner auf der Java-ähnlichen Sprache

source: Roman Savochenko
de: Roman Savotschenko

source: Provides a calculator and libraries engine on the Java-like language. The user can create and modify functions and their libraries.
de: Bietet einen Rechner und ein Engine-Laufwerk für Bibliotheken in einer Java-ähnlichen Sprache. Der Benutzer kann Features und ihre Bibliotheken erstellen und ändern.

source: Parameters table
de: Tabelle der Parameter

source: Controller function or DAQ-template
de: Controller-Funktion oder DAQ-Vorlage

source: Calculation schedule
de: Berechnung Zeitplan

source: Priority of the calculation task
de: Priorität der Berechnungsaufgabe

source: Number of iterations in single calculation
de: Anzahl der Iterationen in einer einzelnen Berechnung

source: IO value
de: Wert IO

source: Data fields
de: Datenfelder

source: Database
de: Datenbank

source: Maximum calculate time, seconds
de: Maximale Zeit der Berechnung, Sekunden

source: Completely translate the program
de: Übersetzen Sie das Programm vollständig

source: Function ID
de: ID Funktionen

source: Default value
de: Standardwert

source: Hide
de: Unsichtbar

source: Compilation with the help of the program language %s is not supported.
de: Kompilieren mit der Programmierungssprache %s wird nicht unterstützt.

source: Error compiling: %s
de: Fehler beim Kompilieren: %s

source: Error loading for function libraries.
de: Fehler beim Laden von Funktionsbibliotheken.

source: Safety timeout, seconds
de: Sicher Timeout, Sekunden

source: Functions libraries
de: Funktionsbibliothek

source: Libraries
de: Bibliotheken

source: From DAQ template.
de: Aus der DAQ-Vorlage.

source: Calculation.
de: Berechnung.

source: Calculation with the period: %s.
de: Berechnung mit einer Periode: %s.

source: Next calculation by the cron '%s'.
de: Berechnung nächsten durch cron '%s'.

source: Spent time: %s[%s].
de: Verbrauchte Zeit: %s[%s].

source: {NewFunction}
de: {NeueFunktion}

source: Enter your new function name instead '%s'!
de: Geben Sie stattdessen Ihren neuen Funktionsnamen ein '%s'!

source: Function or DAQ template '%s' is not present or empty.
de: Funktions oder DAQ-Vorlage '%s' ist nicht vorhanden oder leer.

source: Creating a new function '%s'.
de: Erstellen einer neuen Funktion '%s'.

source: Error path of the function or DAQ template '%s'.
de: Fehlerpfad der Funktion oder der DAQ-Vorlage '%s'.

source: Error loading function and its IO.
de: Fehler beim Laden der Funktion und ihrer IO.

source: Frequency of calculation of the function, Hz
de: Frequenz der Funktionsberechnung, Hz

source: Function start flag
de: Schalter für das Starten der Funktion

source: Function stop flag
de: Schalter für das Anhalten der Funktion

source: Link to the object of this controller
de: Verknüpfen Sie mit dem Objekt dieses Controllers

source: Error calculating controller function.
de: Controller Berechnungsfehler in der Funktion.

source: Function is missing or not started.
de: Funktion fehlt oder wurde nicht gestartet.

source: Go to the used function
de: Gehe zur verwendeten Funktion

source: Calculation
de: Berechnungen

source: Data
de: Daten

source: Real;Integer;Boolean;String;Text;Object
de: Reellezahl;Ganzzahl;Logisch;Saite;Text;Objekt

source: Attribute mode
de: Modusattribut

source: Read only;Read and Write;Read and Write
de: Read-only;Lesen und Schreiben;Lesen und Schreiben

source: Value
de: Wert

source: Deleting a locked attribute is not allowed.
de: Löschen eines gesperrten Attributs ist nicht erlaubt.

source: Changing the locked attribute is not allowed.
de: Gesperrte Attribut zu ändern ist nicht erlaubt.

source: 2:Calculation is stopped
de: 2:Berechnung wird gestoppt

source: 1:Parameter is disabled
de: 1:Parameter ist abgeschaltet

source: List of configuration of the attributes. List must be written by lines in the format: "{io}[:{aid}[:{anm}]]" Where: io - IO of the computable function; aid - identifier of the created attribute; anm - name of the created attribute. If 'aid' or 'anm' is not set then they will be generated from the selected IO of the function.
de: Liste der Konfiguration der Attribute. Die Liste soll eingeschrieben sein zeilenweise im Format: "{io}[:{aid}[:{anm}]]" Wo: io - IO der berechneten Funktion; aid - Bezeichner des gebildeten Attributs; anm - Name des gebildeten Attributs. Falls 'aid' oder 'anm' nicht bestimmt sind werden sie aus dem gewählten IO der Funktion generiert.
