Repository: aleax/openscada
Catalog: src/moduls/transport/Serial/po/*.po
Languages: de, ru, uk

source: Serial interfaces
de: Serielle Schnittstellen
ru: Последовательный интерфейс
uk: Послідовні інтерфейси

source: Roman Savochenko, Maxim Kochetkov (2016)
de: Roman Savotschenko, Maxim Kochetkov (2016)
ru: Роман Савоченко, Максим Кочетков (2016)
uk: Роман Савоченко, Максим Кочетков (2016)

source: Provides transport based on the serial interfaces. It is used for data exchanging via the serial interfaces of the type RS232, RS485, GSM and similar.
de: Bietet Transport basierend auf den seriellen Schnittstellen. Es dient zum Datenaustausch über die seriellen Schnittstellen vom Typ RS232, RS485, GSM und verwandten.
ru: Предоставляет транспорт основанный на последовательных интерфейсах. Используется для обмена данными через последовательные интерфейсы типа RS232, RS485, GSM и похожие.
uk: Надає транспорт заснований на послідовних інтерфейсах. Використовується для обміну даними через послідовні інтерфейси типу RS232, RS485, GSM та схожі.

source: Addition parameters
de: Zusätzliche Parameter
ru: Дополнительные параметры
uk: Додаткові параметри

source: The serial transport has the address format "{dev}:{speed}:{format}[:{opts}[:{modTel}]]", where: dev - serial device address (/dev/ttyS0); speed - device speed (300, 600, 1200, 2400, 4800, 9600, 19200, 38400, 57600, 115200, 230400, 460800, 500000, 576000 or 921600); format - asynchronous data format '{size}{parity}{stop}' (8N1, 7E1, 5O2); opts - different options, mostly for flow control, separated by ',': '[-]h' - hardware (CRTSCTS); '[-]s' - software (IXON|IXOFF); 'rts' - using of the RTS signal for transferring(false) and checking for echo, for raw RS-485; 'rts1' - using of the RTS signal for transferring(true) and checking for echo, for raw RS-485; 'rtsne' - using of the RTS signal for transferring(false) and without checking for echo, for raw RS-485; 'rts1ne' - using of the RTS signal for transferring(true) and without checking for echo, for raw RS-485; '[-]RS485' - using RS-485 mode, through TIOCSRS485. modTel - modem telephone, the field presence do switch transport to work with modem mode.
de: Der serielle Transport hat das Adressformat "{dev}:{speed}:{format}[:{opts}[:{modTel}]]", wo: dev - serielle Geräteadresse (/dev/ttyS0); speed - Gerätegeschwindigkeit (300, 600, 1200, 2400, 4800, 9600, 19200, 38400, 57600, 115200, 230400, 460800, 500000, 576000 oder 921600); format - asynchrones Datenformat '{Grösse}{Parität}{Stop}' (8N1, 7E1, 5O2). opts - verschiedene Optionen, meist zur Flusskontrolle, getrennt durch ',': '[-]h' - Hardware (CRTSCTS); '[-]s' - Software (IXON|IXOFF); 'rts' - Verwendung des RTS-Signals zum Übertragen (Falsch) und Prüfen auf Echo, für Raw RS-485; 'rts1' - Verwendung des RTS-Signals zum Übertragen (Wahr) und Prüfen auf Echo, für Raw RS-485; 'rtsne' - Verwendung des RTS-Signals zur Übertragung (Falsch) und ohne Überprüfung auf Echo, für Raw RS-485; 'rts1ne' - Verwendung des RTS-Signals zur Übertragung (Wahr) und ohne Überprüfung auf Echo, für rohe RS-485; '[-]RS485' - Verwenden Sie den RS-485-Modus von TIOCSRS485. modTel - Modem-Telefon, das Feld Präsenz wechseln Transport zum Arbeiten mit Modem-Modus.
ru: Последовательный транспорт имеет адрес в формате "{dev}:{speed}:{format}[:{opts}[:{modTel}]]", где: dev - адрес последовательного устройства (/dev/ttyS0); speed - скорость устройства (300, 600, 1200, 2400, 4800, 9600, 19200, 38400, 57600, 115200, 230400, 460800, 500000, 576000 или 921600); format - формат асинхронных данных '{размер}{чётность}{стоп}' (8N1, 7E1, 5O2); opts - различные параметры, в основном для управления потоком, разделённые символом ',': '[-]h' - аппаратное (CRTSCTS); '[-]s' - программное (IXON|IXOFF); 'rts' - использование RTS сигнала для передачи(false) и проверки на эхо, для сырого RS-485; 'rts1' - использование RTS сигнала для передачи(true) и проверки на эхо, для сырого RS-485; 'rtsne' - использование RTS сигнала для передачи(false) без проверки на эхо, для сырого RS-485; 'rts1ne' - использование RTS сигнала для передачи(true) без проверки на эхо, для сырого RS-485; '[-]RS485' - использовать RS-485 режим, посредством TIOCSRS485. modTel - телефон модема, присутствие этого поля переключает транспорт на работу в режиме модема.
uk: Послідовний транспорт має адресу у форматі "{dev}:{speed}:{format}[:{opts}[:{modTel}]]", де: dev - адреса послідовного пристрою (/dev/ttyS0); speed - швидкість пристрою (300, 600, 1200, 2400, 4800, 9600, 19200, 38400, 57600, 115200 230400, 460800, 500000, 576000 або 921600); format - формат асинхронних даних '{розмір}{парність}{стоп}' (8N1, 7E1, 5O2); opts - різноманітні параметри, переважно для керування потоком, поділені символом ',': '[-]h' - апаратне (CRTSCTS); '[-]s' - програмне (IXON|IXOFF); 'rts' - використання RTS сигналу для передачі(false) та перевірки на эхо, для сирого RS-485; 'rts1' - використання RTS сигналу для передачі(true) та перевірки на эхо, для сирого RS-485; 'rtsne' - використання RTS сигналу для передачі(false) без перевірки на эхо, для сирого RS-485; 'rts1ne' - використання RTS сигналу для передачі(true) без перевірки на эхо, для сирого RS-485; '[-]RS485' - використання RS-485 режиму, за посередництвом TIOCSRS485. modTel - телефон модему, наявність цього поля перемикає транспорт у режим роботи з модемом.

source: Connection timings in the format "{conn}:{symbol}[-{NextReqMult}][:{KeepAliveTm}[:{rtsDelay1}:{rtsDelay2}]]", where: conn - maximum time of waiting the connecting response, in milliseconds; symbol - maximum time of one symbol, used for the frame end detection, in milliseconds; NextReqMult - next request's multiplicator to the <symbol> time, 4 by default; KeepAliveTm - keep alive timeout to reconnect the transport, in seconds; use the value < 0 for disconnecting the transport after missing response at each request; rtsDelay1 - delay between the transmitter activation with RTS signal and start up of the transmission, in milliseconds; rtsDelay2 - delay between the transmitting and disconnecting the transmitter with RTS signal, in milliseconds. Can be prioritatile specified in the address field as the second global argument, as such "/dev/rfcomm0:9600||1000:40-20".
de: Verbindungszeiten im Format "{conn}:{symbol}[-{NextReqMult}][:{KeepAliveTm}[:{rtsDelay1}:{rtsDelay2}]]", wo: conn - maximale Wartezeit auf die Verbindungsantwort in Millisekunden; symbol - maximale Zeit eines Symbols, das für die Erkennung des Bildendes verwendet wird, in Millisekunden; NextReqMult - Multiplikator der nächsten Anfrage zur {symbol} Zeit, 4 standardmäßig; KeepAliveTm - Keep-Alive-Timeout den Transport wieder zu verbinden, in Sekunden; Verwenden Sie den Wert < 0, um den Transport nach fehlender Antwort bei jeder Anforderung zu trennen; rtsDelay1 - Verzögerung zwischen Senderaktivierung mit RTS-Signal und Beginn der Übertragung, in Millisekunden; rtsDelay2 - Verzögerung zwischen Senden und Trennen des Senders mit RTS-Signal, in Millisekunden. Als zweites globales Argument kann priorityatile im Adressfeld angegeben werden, zB "/dev/rfcomm0:9600||1000:40-20".

source: Error writing a line.
de: Fehler beim Schreiben einer Zeile.
ru: Ошибка записи строки.
uk: Помилка запису рядка.

source: Sent to the modem %d: '%s'.
de: An das Modem %d: '%s' gesendet.
ru: Отправлено на модем %d: '%s'.
uk: Надіслано до модему %d: '%s'.

source: Error reading from the serial interfaces.
de: Fehler beim Lesen von den seriellen Schnittstellen.
ru: Ошибка чтения последовательного интерфейса.
uk: Помилка читання з послідовного інтерфейсу.

source: Received from the modem %d: '%s'.
de: Empfangen vom Modem %d: '%s'.
ru: Получено из модема %d: '%s'.
uk: Отримано з модему %d: '%s'.

source: No response from the modem %d.
de: Keine Antwort vom Modem %d.
ru: Нет ответа от модема %d.
uk: Немає відповіді з модему %d.

source: No expected response, but receiving from the modem %d: '%s'.
de: Keine erwartete Antwort, aber vom Modem %d: '%s' empfangen.
ru: Нет ожидаемого ответа, но получено из модема %d: '%s'.
uk: Немає очікуваної відповіді, але отримано з модему %d: '%s'.

source: Traffic in %s, out %s. Maximum char timeout %.4g ms.
de: Datenverkehr eingehend %s, ausgehend %s. Maximale Wartezeit für ein Zeichen %.4g msek.
ru: Трафик входной %s, выходной %s. Макс. время ожидания символа %.4g мс.
uk: Трафік вхідний %s, вихідний %s. Максимальний час очікування символу %.4g мс.

source: Processing time %s[%s].
de: Bearbeitungszeit %s[%s].
ru: Время обработки %s[%s].
uk: Час обробки %s[%s].

source: Error the serial port '%s' %s: %s.
de: Fehler beim seriellen Port '%s' %s: %s.
ru: Ошибка последовательного порта '%s' %s: %s.
uk: Помилка послідовного порту '%s' %s: %s.

source: Error the speed '%s'.
de: Fehler die Geschwindigkeit '%s'.
ru: Ошибка скорости '%s'.
uk: Помилкова швидкість '%s'.

source: Error the asynchronous data format '%s'.
de: Fehler beim asynchronen Datenformat '%s'
ru: Ошибка формата асинхронных данных '%s'.
uk: Помилка формату асинхронних даних '%s'.

source: Error char length %d.
de: Fehlerzeichenlänge %d.
ru: Ошибка длины символа %d.
uk: Помилкова довжина %d символу.

source: Error the parity checking mode '%c'.
de: Fehler beim Paritätsprüfungsmodus '%c'.
ru: Ошибка режима проверки чётности '%c'.
uk: Помилка режиму перевірки парності '%c'.

source: Error the stop bits %d.
de: Fehler die Stoppbits %d.
ru: Ошибка количества стоп битов %d.
uk: Помилка кількості стопових бітів %d.

source: No response to the initial request '%s'.
de: Keine Antwort auf die erste Anfrage '%s'.
ru: Нет ответа на запрос инициализации '%s'.
uk: Немає відповіді на запит ініціалізації '%s'.

source: Closing the file %d error '%s (%d)'!
de: Schließen der Datei %d Fehler '%s (%d)'!

source: Connected
de: Verbunden
ru: Подключено
uk: Під'єднано

source: Disconnected
de: Getrennt
ru: Отключено
uk: Від'єднано

source: The serial interface received the message '%d'.
de: Die serielle Schnittstelle hat die Nachricht '%d' erhalten.
ru: Последовательный интерфейс получил сообщение '%d'.
uk: Послідовний інтерфейс отримав повідомлення '%d'.

source: < Received from
de: < Empfangen von
uk: < Отримано

source: Error requesting the protocol.
de: Fehler in der Protokollanfrage.
ru: Ошибка запроса к протоколу.
uk: Помилка запиту до протоколу.

source: The serial interface replied by the message '%d'.
de: Die serielle Schnittstelle wurde mit der Nachricht '%d' beantwortet.
ru: Последовательный интерфейс ответил сообщением '%d'.
uk: Послідовний інтерфейс відповів повідомленням '%d'.

source: Write: the answer is zero byte.
de: Schreiben: Die Antwort ist Nullbyte.
ru: Запись: ответ ноль байт.
uk: Запис: відповідь ноль байт.

source: Write: error '%s (%d)'.
de: Schreiben: Fehler '%s (%d)'.
ru: Запись: ошибка '%s (%d)'.
uk: Запис: помилка '%s (%d)'.

source: > Transmitted to
de: > Übertragen an
uk: > Передано

source: Error closing the protocol.
de: Fehler beim Schließen des Protokolls.
ru: Ошибка закрытия протокола.
uk: Помилка закриття протоколу.

source: The serial transport has the address format "{dev}:{speed}:{format}[:{opts}[:{mdm}]]", where: dev - serial device address (/dev/ttyS0); speed - device speed (300, 600, 1200, 2400, 4800, 9600, 19200, 38400, 57600, 115200, 230400, 460800, 500000, 576000 or 921600); format - asynchronous data format '{size}{parity}{stop}' (8N1, 7E1, 5O2); opts - different options, mostly for flow control, separated by ',': '[-]h' - hardware (CRTSCTS); '[-]s' - software (IXON|IXOFF); 'rts' - using of the RTS signal for transferring(false) and checking for echo, for raw RS-485; 'rts1' - using of the RTS signal for transferring(true) and checking for echo, for raw RS-485; 'rtsne' - using of the RTS signal for transferring(false) and without checking for echo, for raw RS-485; 'rts1ne' - using of the RTS signal for transferring(true) and without checking for echo, for raw RS-485; '[-]RS485' - using RS-485 mode, through TIOCSRS485. mdm - modem mode, listen for 'RING'.
de: Der serielle Transport hat das Adressformat "{dev}:{speed}:{format}[:{opts}[:{mdm}]]", wo: dev - serielle Geräteadresse (/dev/ttyS0); speed - Gerätegeschwindigkeit (300, 600, 1200, 2400, 4800, 9600, 19200, 38400, 57600, 115200, 230400, 460800, 500000, 576000 oder 921600); format - asynchrones Datenformat '{Grösse}{Parität}{Stop}' (8N1, 7E1, 5O2). opts - verschiedene Optionen, meist zur Flusskontrolle, getrennt durch ',': '[-]h' - Hardware (CRTSCTS); '[-]s' - Software (IXON|IXOFF); 'rts' - Verwendung des RTS-Signals zum Übertragen (Falsch) und Prüfen auf Echo, für Raw RS-485; 'rts1' - Verwendung des RTS-Signals zum Übertragen (Wahr) und Prüfen auf Echo, für Raw RS-485; 'rtsne' - Verwendung des RTS-Signals zur Übertragung (Falsch) und ohne Überprüfung auf Echo, für Raw RS-485; 'rts1ne' - Verwendung des RTS-Signals zur Übertragung (Wahr) und ohne Überprüfung auf Echo, für rohe RS-485; '[-]RS485' - Verwenden Sie den RS-485-Modus von TIOCSRS485. mdm - Modem-Modus, achten Sie auf 'RING'.
ru: Последовательный транспорт имеет адрес в формате "{dev}:{speed}:{format}[:{opts}[:{mdm}]]", где: dev - адрес последовательного устройства (/dev/ttyS0); speed - скорость устройства (300, 600, 1200, 2400, 4800, 9600, 19200, 38400, 57600, 115200, 230400, 460800, 500000, 576000 или 921600); format - формат асинхронных данных '{размер}{чётность}{стоп}' (8N1, 7E1, 5O2); opts - различные параметры, в основном для управления потоком, разделённые символом ',': '[-]h' - аппаратное (CRTSCTS); '[-]s' - программное (IXON|IXOFF); 'rts' - использование RTS сигнала для передачи(false) и проверки на эхо, для сырого RS-485; 'rts1' - использование RTS сигнала для передачи(true) и проверки на эхо, для сырого RS-485; 'rtsne' - использование RTS сигнала для передачи(false) без проверки на эхо, для сырого RS-485; 'rts1ne' - использование RTS сигнала для передачи(true) без проверки на эхо, для сырого RS-485; '[-]RS485' - использовать RS-485 режим, посредством TIOCSRS485. mdm - режим модема, ожидание 'RING'.
uk: Послідовний транспорт має адресу у форматі "{dev}:{speed}:{format}[:{opts}[:{mdm}]]", де: dev - адреса послідовного пристрою (/dev/ttyS0); speed - швидкість пристрою (300, 600, 1200, 2400, 4800, 9600, 19200, 38400, 57600, 115200, 230400, 460800, 500000, 576000 або 921600); format - формат асинхронних даних '{розмір}{парність}{стоп}' (8N1, 7E1, 5O2); opts - різноманітні параметри, переважно для керування потоком, поділені символом ',': '[-]h' - апаратне (CRTSCTS); '[-]s' - програмне (IXON|IXOFF); 'rts' - використання RTS сигналу для передачі(false) та перевірки на эхо, для сирого RS-485; 'rts1' - використання RTS сигналу для передачі(true) та перевірки на эхо, для сирого RS-485; 'rtsne' - використання RTS сигналу для передачі(false) без перевірки на эхо, для сирого RS-485; 'rts1ne' - використання RTS сигналу для передачі(true) без перевірки на эхо, для сирого RS-485; '[-]RS485' - використання RS-485 режиму, за посередництвом TIOCSRS485. mdm - режим модему, очікування 'RING'.

source: Timings
de: Zeitabstände
ru: Временные интервалы
uk: Інтервали часу

source: Connection timings in the format "{symbol}:{frm}[::{rtsDelay1}:{rtsDelay2}]", where: symbol - maximum time of one symbol, used for the frame end detection and for timeout of the next request, in milliseconds; frm - maximum frame length, in milliseconds; rtsDelay1 - delay between the transmitter activation with RTS signal and start up of the transmission, in milliseconds; rtsDelay2 - delay between the transmitting and disconnecting the transmitter with RTS signal, in milliseconds.
de: Verbindungszeiten im Format "{symbol}:{frm}[::{rtsDelay1}:{rtsDelay2}]", wo: symbol - maximale Zeit eines Symbols, die für die Erkennung des Frame-Endes und für die Zeitüberschreitung der nächsten Anfrage in Millisekunden verwendet wird; frm - maximale Rahmenlänge, in Millisekunden; rtsDelay1 - Verzögerung zwischen Senderaktivierung mit RTS-Signal und Beginn der Übertragung, in Millisekunden; rtsDelay2 - Verzögerung zwischen Senden und Trennen des Senders mit RTS-Signal, in Millisekunden.
ru: Временные интервалы соединения в формате "{symbol}:{frm}[::{rtsDelay1}:{rtsDelay2}]", где: symbol - максимальное время одного символа, используется для обнаружения окончания фрейма, в миллисекундах; frm - максимальная длина фрейма, в миллисекундах rtsDelay1 - задержка между включением передатчика сигналом RTS и началом передачи, в миллисекундах; rtsDelay2 - задержка между окончанием передачи и отключением передатчика сигналом RTS, в миллисекундах.
uk: Таймаути підключення у форматі "{symbol}:{frm}[::{rtsDelay1}:{rtsDelay2}]", де: symbol - максимальний час одного символу, використовується для виявлення закінчення фрейму, у мілісекундах; frm - максимальний розмір фрейму, у мілісекундах; rtsDelay1 - затримка між включенням передавача сигналом RTS та початком передачі, у мілісекундах; rtsDelay2 - затримка між закінченням передачі та відключенням передавача сигналом RTS, у мілісекундах.

source: Priority
de: Priorität
ru: Приоритет
uk: Пріоритет

source: Timeout, seconds
de: Wartezeit, Sekunden
ru: Время ожидания, секунд
uk: Час очікування, секунд

source: Pre-initial delay, seconds
de: Pre-erste Ausdauer, Sekunden
ru: Выдержка пре-инициализации, секунд
uk: Витримка пре-ініціалізації, секунд

source: Post-initial delay, seconds
de: Aufhalten der Post-erste, Sekunden
ru: Выдержка после-инициализации, секунд
uk: Витримка після-ініціалізації, секунд

source: Initialization string 1
de: Initialisierungszeile 1
ru: Строка инициализации 1
uk: Рядок ініціалізації 1

source: Initialization string 2
de: Initialisierungszeile 2
ru: Строка инициализации 2
uk: Рядок ініціалізації 2

source: Initial response
de: Initialisierung, Ergebnis
ru: Инициализация, результат
uk: Ініціалізація, відповідь

source: Ring request
de: Anfrage des Anrufs.
ru: Запрос звонка
uk: Запит дзвінка

source: Ring answer
de: Ring Antwort
ru: Ответ на звонок
uk: Відповідь на дзвінок

source: Result of the ring answer
de: Ergebnis der Ringantwort
ru: Результат ответа на звонок
uk: Результат відповіді на дзвінок

source: Traffic in %s, out %s.
de: Datenverkehr eingehend %s, ausgehend %s.
ru: Трафик входной %s, выходной %s.
uk: Трафік вхідний %s, вихідний %s.

source: Response time %s[%s:%s/1.5].
de: Reaktionszeit %s[%s:%s/1.5].
ru: Время ответа %s[%s:%s/1.5].
uk: Час відповіді %s[%s:%s/1.5].

source: The device '%s' is using now.
de: Das Gerät '%s' benutzt jetzt.
ru: Устройство '%s' используется сейчас.
uk: Пристрій '%s' на разі зайнятий.

source: Connecting.
de: Anschließen.
ru: Подключение.
uk: Під'єднання.

source: Modem busy
de: Modem ist beschäftigt
ru: Модем занят
uk: Модем зайнятий

source: Modem no carrier
de: Modem, keine Tragende
ru: Модем, нет несущей
uk: Модем, немає несущої

source: Modem no dial tone
de: Modem, kein Signal
ru: Модем, нет гудка
uk: Модем, немає гудку

source: Modem no connected
de: Modem nicht verbunden
ru: Модем не подключился
uk: Модем не підключено

source: Disconnecting.
de: Trennen.
ru: Отключение.
uk: Від'єднання.

source: Unknown error
de: Unbekannter Fehler
ru: Неизвестная ошибка
uk: Невідома помилка

source: Transport is not connected!
de: Transport ist nicht verbunden!
ru: Транспорт не подключен!
uk: Транспорт не під'єднано!

source: Reconnect by KeepAliveTm %gs.
de: Reconnect durch KeepAliveTm %gs.
ru: Переподключение по KeepAliveTm %gс.
uk: Перепід'єднання за KeepAliveTm %gс.

source: No wrote data
de: Keine Daten geschrieben
ru: Не записано данных
uk: Не записано даних

source: Error writing: %s
de: Fehler beim Schreiben: %s
ru: Ошибка записи: %s
uk: Помилка запису: %s

source: Error transmitting: %s
de: Fehler beim Senden: %s
ru: Ошибка передачи: %s
uk: Помилка передавання: %s

source: Wrote %s.
de: Schrieb %s.
ru: Записано %s.
uk: Записано %s.

source: Timeouted!
de: Zeit ist aus!
ru: Время исчерпано!
uk: Час вичерпано!

source: Error reading the echo request.
de: Fehler beim Lesen der Echoanforderung.
ru: Ошибка чтения эхо запроса.
uk: Помилка читання эхо запиту.

source: Reading timeouted.
de: Lesezeitüberschreitung.
ru: Время ожидания чтения истекло.
uk: Перевищено час очікування читання.

source: Reading timeouted
de: Lesezeitüberschreitung
ru: Время ожидания чтения истекло
uk: Перевищено час очікування читання

source: Error reading (select): %s
de: Fehler beim Lesen (select): %s
ru: Ошибка чтения (select): %s
uk: Помилка читання (select): %s

source: No data
de: Keine Daten
ru: Нет данных
uk: Немає даних

source: Error reading: %s
de: Fehler beim Lesen: %s
ru: Ошибка чтения: %s
uk: Помилка читання: %s

source: Read %s.
de: Lesen Sie %s.
ru: Прочитано %s.
uk: Прочитано %s.

source: Do not disconnect at processing
de: Trennen Sie nicht bei Verarbeitung
ru: Не отключать при обработке
uk: Не відключати при обробці

source: Sometime opened device closing can be breakage, on ICP-DAS LP PLC for example, then you are alowed to prevent it by this option.
de: Irgendwann geöffnetes Schließen des Gerätes kann Bruch sein, zum Beispiel auf ICP-DAS LP PLC, dann ist es erlaubt, es durch diese Option zu verhindern.
ru: Иногда закрытие открытого устройства может быть разрушительным, например, на ПЛК LP от ICP-DAS, и Вы можете предотвратить это данной опцией.
uk: Інколи закриття відкритого пристрою може бути руйнівним, наприклад, на ПЛК LP від ICP-DAS, та Ви можете запобігти цьому даною опцією.

source: Life time, seconds
de: Lebenszeit, Sekunden
ru: Время жизни, секунд
uk: Час життя, секунд

source: Dial string
de: Dialzeile
ru: Строка дозвона
uk: Рядок для дзвінка

source: Connect response
de: Anschluss, Ergebnis
ru: Соединение, результат
uk: Підключення, результат

source: Busy response
de: Beschäftigt, Ergebnis
ru: Занят, результат
uk: Зайнято, результат

source: No carrier response
de: Keine Tragende, Ergebnis
ru: Нет несущей, результат
uk: Немає несущої, результат

source: No dial tone response
de: Kein Signal, Ergebnis
ru: Нет гудка, результат
uk: Немає гудка, результат

source: Exit
de: Ausgang
ru: Выход
uk: Вихід

source: Hangup string
de: den Hörer legen
ru: Повесить трубку
uk: Повісити слухавку

source: Hangup response
de: den Hörer legen, Ergebnis
ru: Повесить трубку, результат
uk: Повісити слухавку, результат

source: Received from
ru: Получено

source: Transmitted to
ru: Передано

source: Modem
ru: Модем
uk: Модем
