Repository: aleax/openscada
Catalog: src/moduls/transport/Serial/po/*.po
Languages: de, ru, uk

source: Connection timings in the format "{conn}:{symbol}[-{NextReqMult}][:{KeepAliveTm}[:{rtsDelay1}:{rtsDelay2}]]", where: conn - maximum time of waiting the connecting response, in milliseconds; symbol - maximum time of one symbol, used for the frame end detection, in milliseconds; NextReqMult - next request's multiplicator to the <symbol> time, 4 by default; KeepAliveTm - keep alive timeout to reconnect the transport, in seconds; use the value < 0 for disconnecting the transport after missing response at each request; rtsDelay1 - delay between the transmitter activation with RTS signal and start up of the transmission, in milliseconds; rtsDelay2 - delay between the transmitting and disconnecting the transmitter with RTS signal, in milliseconds.
ru: Временные интервалы соединения в формате "{conn}:{symbol}[-{NextReqMult}][:{KeepAliveTm}[:{rtsDelay1}:{rtsDelay2}]]", где: conn - максимальное время ожидания ответа соединения, в миллисекундах; symbol - максимальное время одного символа, используется для обнаружения окончания фрейма и таймаута следующего запроса, в миллисекундах; NextReqMult - множитель времени следующего запроса к времени символа {symbol}, 4 по умолчанию; KeepAliveTm - таймаут жизни для переподключения транспорта, в секундах; используйте значение < 0 для отключения транспорта после отсутствия ответа на любой запрос; rtsDelay1 - задержка между включением передатчика сигналом RTS и началом передачи, в миллисекундах; rtsDelay2 - задержка между окончанием передачи и отключением передатчика сигналом RTS, в миллисекундах.
uk: Таймаути підключення у форматі "{conn}:{symbol}[-{NextReqMult}][:{KeepAliveTm}[:{rtsDelay1}:{rtsDelay2}]]", де: conn - максимальний час очікування відповіді підключення, у мілісекундах; symbol - максимальний час одного символу, використовується для виявлення закінчення фрейму та таймауту наступного запиту, у мілісекундах; NextReqMult - множник часу наступного запиту до часу символу <symbol>, 4 по замовченню; KeepAliveTm - таймаут життя для перепід'єднання транспорту, у секундах; використовуйте значення < 0 для від'єднання транспорту після відсутності відповіді на будь-який запит; rtsDelay1 - затримка між включенням передавача сигналом RTS та початком передачі, у мілісекундах; rtsDelay2 - затримка між закінченням передачі та відключенням передавача сигналом RTS, у мілісекундах.
