Repository: aleax/openscada
Catalog: src/moduls/bd/LDAP/po/*.po
Languages: de, ru, uk

source: Directory by LDAP
de: Verzeichnis von LDAP
ru: Директория по LDAP
uk: Директорія за LDAP

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: BD module. Provides support of directories by LDAP.
de: BD-Modul. Bietet Unterstützung von Verzeichnissen durch LDAP.
ru: Модуль БД. Предоставляет поддержку директорий посредством LDAP.
uk: Модуль БД. Надає підтримку директорій за посередництвом LDAP.

source: OPT_PROTOCOL_VERSION: set %d error.
de: OPT_PROTOCOL_VERSION: setze %d Fehler.
ru: OPT_PROTOCOL_VERSION: ошибка установки %d.
uk: OPT_PROTOCOL_VERSION: помилка встановлення %d.

source: OPT_TIMEOUT: %g error.
de: OPT_TIMEOUT: %g Fehler.
ru: OPT_TIMEOUT: ошибка в %g.
uk: OPT_TIMEOUT: помилка %g.

source: Error open table '%s'. DB is disabled.
de: Fehler beim Öffnen der Tabelle '%s'. Datenbank ist abgeschaltet.
ru: Ошибка открытия таблицы '%s'. БД отключена.
uk: Помилка відкриття таблиці '%s'. БД вимкнено.

source: OpenTable '%s': missed.
de: OpenTable '%s': verpasst.
ru: ОткрТаблицы '%s': отсутствует.
uk: ВідкрТаблиці '%s': відсутня.

source: Directory server address as "ldap[s]://{host}[:{port}];bdn[;{adn};{pass}[;{tm}]]". Where: host - hostname of the directory service; port - port, default 389; bdn - base DN, an entry which sub-entries means as tables of the database with RDN attribute "ou" presents; adn - Distinguished Name of the auth user, omiting the user and next password will cause to anonymous connection; pass - password of the Distinguished Name of the auth user; tm - network and generic timeout in seconds by real number.
de: Verzeichnis-Server-Adresse als "ldap[s]://{host}[:{port}];bdn[;{adn};{pass}[;{tm}]]". Where: host - Hostname des Verzeichnisdienstes; port - Port, Standard 389; bdn - Basis DN, ein Eintrag, den Untereinträge als Tabellen der Datenbank mit RDN-Attribut "ou" präsentieren; adn - Distinguished Name of the auth user, das Weglassen und das nächste Passwort wird zu einer anonymen Verbindung führen; pass - Distinguished Name des auth Benutzers; tm - Netzwerk und generisches Timeout in Sekunden durch reale Zahl.
ru: Адрес сервера директорий как "ldap[s]://{host}[:{port}];bdn[;{adn};{pass}[;{tm}]]". Где: host - имя хоста сервиса директорий; port - порт, типично 389; bdn - базовый DN записи, подзаписи которой представляют таблицы базы данных, по наличию RDN атрибута "ou"; adn - Определённое Имя (DN) пользователя аутентификации, опускание пользователя и последующего пароля приведёт к анонимному подключению; pass - пароль Определённого Имени (DN) пользователя аутентификации; tm - сетевой и общий таймаут в секундах вещественным числом.
uk: Адреса серверу директорій як "ldap[s]://{host}[:{port}];bdn[;{adn};{pass}[;{tm}]]". Де: host - ім'я хосту сервісу директорій; port - порт, типово 389; bdn - базовий DN запису, підзаписи якого представляють таблиці бази даних, за наявністю RDN атрибуту "ou"; adn - Визначене Ім'я (DN) користувача автентифікації, опускання користувача та подальшого паролю призведе до анонімного підключення; pass - пароль Визначеного Ім'я (DN) користувача автентифікації; tm - мережевий та загальний таймаут у секундах реальним числом.

source: Entry "%s" is not present.
de: Eintrag "%s" ist nicht vorhanden.
ru: Запись "%s" отсутствует.
uk: Запис "%s" відсутній.

source: Get DN of the entry "%s" error.
de: Erhalten Sie DN des Eintrags "%s" Fehler.
ru: Ошибка получения DN записи "%s".
uk: Помилка отримання DN запису "%s".

source: MODIFY: %s
de: ÄNDERN: %s
