Repository: aleax/openscada
Catalog: src/moduls/daq/DCON/po/*.po
Languages: ru, uk

source: DCON client
ru: DCON клиент
uk: DCON клієнт

source: Roman Savochenko, Almaz Karimov
ru: Роман Савоченко, Алмаз Каримов
uk: Роман Савоченко, Алмаз Каримов

source: Allow realization of DCON client service. Supported I-7000 DCON protocol.
ru: Предоставляет реализацию клиентского сервиса протокола DCON. Поддерживается протокол I-7000 DCON.

source: Parameters table
ru: Таблица параметров
uk: Таблиця параметрів

source: Gather data period (s)
ru: Период сбора данных (с)
uk: Період збору даних (с)

source: Acquisition schedule
ru: Планирование опроса
uk: Планування опитування

source: Gather task priority
ru: Уровень приоритета задачи сбора данных
uk: Рівень пріоритету задачі збору даних

source: Serial transport
ru: Последовательный транспорт

source: Request tries
ru: Попыток запроса
uk: Спроб запиту

source: Standard
ru: Стандарт
uk: Стандарт

source: Module address
ru: Адрес модуля
uk: Адреса модуля

source: CRC control
ru: Проверка контрольной суммы
uk: Контроль CRC

source: Host signal
ru: Сигнал главного
uk: Сигнал головного

source: No signal;HostOK
ru: Нет сигнала;Главный в порядке
uk: Немає сигналу;Головний у нормі

source: AI method
ru: AI метод
uk: Метод AI

source: No AI;1AI (#AA);2AI (#AA);3AI (#AA);4AI (#AA);6AI (#AA);8AI (#AA);10AI (#AA);20AI (#AA);16AI (#AA^AA);1AI (#AAN);2AI (#AAN);3AI (#AAN);4AI (#AAN);6AI (#AAN);8AI (#AAN);10AI (#AANN);20AI (#AANN);16AI (#AAN^AAN)
ru: Нет AI;1AI (#AA);2AI (#AA);3AI (#AA);4AI (#AA);6AI (#AA);8AI (#AA);10AI (#AA);20AI (#AA);16AI (#AA^AA);1AI (#AAN);2AI (#AAN);3AI (#AAN);4AI (#AAN);6AI (#AAN);8AI (#AAN);10AI (#AANN);20AI (#AANN);16AI (#AAN^AAN)
uk: Немає AI;1AI (#AA);2AI (#AA);3AI (#AA);4AI (#AA);6AI (#AA);8AI (#AA);10AI (#AA);20AI (#AA);16AI (#AA^AA);1AI (#AAN);2AI (#AAN);3AI (#AAN);4AI (#AAN);6AI (#AAN);8AI (#AAN);10AI (#AANN);20AI (#AANN);16AI (#AAN^AAN)

source: Engineer or percent;Hexadecimal (0000 FFFF);Hexadecimal (8000 7FFF)
ru: Инженерный или процентный;Шестнадцатеричный (0000 FFFF);Шестнадцатеричный (8000 7FFF)
uk: Інженерний або відсотковий;Шістнадцятковий (0000 FFFF);Шістнадцятковий (8000 7FFF)

source: AO method
ru: AO метод
uk: Метод AO

source: No AO;1AO (#AA);2AO (#AAN);4AO (#AAN);4AO (#AACN)
ru: Нет AO;1AO (#AA);2AO (#AAN);4AO (#AAN);4AO (#AACN)
uk: Немає AO;1AO (#AA);2AO (#AAN);4AO (#AAN);4AO (#AACN)

source: Engineer (00.000 20.000);Engineer (04.000 20.000);Engineer (00.000 10.000);Engineer (+00.000 +20.000);Engineer (+04.000 +20.000);Engineer (+00.000 +10.000);Engineer (-10.000 +10.000);Engineer (+00.000 +05.000);Engineer (-05.000 +05.000);Percent (+000.00 +100.00);Hexadecimal (000 FFF)
ru: Инженерный (00.000 20.000);Инженерный (04.000 20.000);Инженерный (00.000 10.000);Инженерный (+00.000 +20.000);Инженерный (+04.000 +20.000);Инженерный (+00.000 +10.000);Инженерный (-10.000 +10.000);Инженерный (+00.000 +05.000);Инженерный (-05.000 +05.000);Инженерный (+000.00 +100.00);Шестнадцатеричный (000 FFF)
uk: Інженерний (00.000 20.000);Інженерний (04.000 20.000);Інженерний (00.000 10.000);Інженерний (+00.000 +20.000);Інженерний (+04.000 +20.000);Інженерний (+00.000 +10.000);Інженерний (-10.000 +10.000);Інженерний (+00.000 +05.000);Інженерний (-05.000 +05.000);Відсотковий (+000.00 +100.00);Шістнадцятковий (000 FFF)

source: DI method
ru: DI метод
uk: Метод DI

source: No DI;3DI ($AA6);4DI ($AA6);7DI ($AA6);8DI ($AA6);14DI ($AA6);16DI ($AA6);1DI (@AADI);8DI ($AA6,FF00)
ru: Нет DI;3DI ($AA6);4DI ($AA6);7DI ($AA6);8DI ($AA6);14DI ($AA6);16DI ($AA6);1DI (@AADI);8DI ($AA6,FF00)
uk: Немає DI;3DI ($AA6);4DI ($AA6);7DI ($AA6);8DI ($AA6);14DI ($AA6);16DI ($AA6);1DI (@AADI);8DI ($AA6,FF00)

source: DO method
ru: DO метод
uk: Метод DO

source: No DO;2DO (@AA,0300);3DO (@AA,7);4DO (@AA,F);5DO (@AA,1F);7DO (@AA,7F);8DO (@AA,FF);12DO (@AA,0FFF);13DO (@AA,1FFF);16DO (@AA,FFFF);2DO (^AADOVVV);3DO (^AADOVVV);2DO (@AADO);4DO (@AADO);6DO (@AADODD);2DO (@AADO0D);4DO (@(^)AADO0D);4DO (@AA,0F00);8DO (@AA,FF00);4DO (#AA000F);8DO (#AA00FF);12DO (#AA000FFF)
ru: Нет DO;2DO (@AA,0300);3DO (@AA,7);4DO (@AA,F);5DO (@AA,1F);7DO (@AA,7F);8DO (@AA,FF);12DO (@AA,0FFF);13DO (@AA,1FFF);16DO (@AA,FFFF);2DO (^AADOVVV);3DO (^AADOVVV);2DO (@AADO);4DO (@AADO);6DO (@AADODD);2DO (@AADO0D);4DO (@(^)AADO0D);4DO (@AA,0F00);8DO (@AA,FF00);4DO (#AA000F);8DO (#AA00FF);12DO (#AA000FFF)
uk: Немає DO;2DO (@AA,0300);3DO (@AA,7);4DO (@AA,F);5DO (@AA,1F);7DO (@AA,7F);8DO (@AA,FF);12DO (@AA,0FFF);13DO (@AA,1FFF);16DO (@AA,FFFF);2DO (^AADOVVV);3DO (^AADOVVV);2DO (@AADO);4DO (@AADO);6DO (@AADODD);2DO (@AADO0D);4DO (@(^)AADO0D);4DO (@AA,0F00);8DO (@AA,FF00);4DO (#AA000F);8DO (#AA00FF);12DO (#AA000FFF)

source: CI method
ru: CI метод
uk: Метод CI

source: No CI;2CI (#AA);3CI (#AA)
ru: Нет CI;2CI (#AA);3CI (#AA)
uk: Немає CI;2CI (#AA);3CI (#AA)

source: Call now.
ru: Вызов сейчас.
uk: Виклик зараз.

source: Call by period: %s.
ru: Вызовы с периодом: %s.
uk: Виклик за періодом: %s.

source: Call next by cron '%s'.
ru: Следующий вызов по cron '%s'.
uk: Наступний виклик за cron '%s'.

source: Spent time: %s.
ru: Затрачено времени: %s.
uk: Витрачено часу: %s.

source: REQ -> '%s'
ru: Запрос -> '%s'
uk: Запит -> '%s'

source: 13:Error respond: Not full.
ru: 13:Ошибка ответа: Не полный.
uk: 13:Помилка відповіді: Не повна.

source: 20:Respond length error.
ru: 20:Ошибка в длине пакета модуля.
uk: 20:Помилка довжини пакету модуля.

source: 21:Invalid module CRC.
ru: 21:Ошибка контрольной суммы модуля.
uk: 21:Помилка контрольної суми.

source: 22:Invalid module response.
ru: 22:Ошибка ответа модуля.
uk: 22:Помилка відповіді модуля.

source: RESP -> '%s'
ru: Ответ -> '%s'
uk: Відпов. -> '%s'

source: 10:Transport error:
ru: 10:Ошибка транспорта.
uk: 10:Помилка транспорту:

source: ERR -> '%s': %s
ru: Ошибка -> '%s': %s
uk: Помилка -> '%s': %s

source: 23:Undefined range
ru: 23:Неопределённый диапазон
uk: 23:Невизначений діапазон

source: 24:Module out of range
ru: 24:Выход за пределы диапазона в модуле
uk: 24:Вихід за межі діапазону у модулі

source: 25:Command ignored (host watchdog).
ru: 25:Команда проигнорирована (сторожевой таймер).
uk: 25:Команду ігноровано (сторожовий таймер).

source: 1:Parameter is disabled.
ru: 1:Параметр отключен
uk: 1:Параметр вимкнено.

source: 2:Acquisition is stopped.
ru: 2:Опрос остановлен.
uk: 2:Збір зупинено.

source: Provides an implementation of DCON-client protocol. Supports I-7000 DCON protocol.
uk: Надає реалізацію клієнтського сервісу DCON. Підтримується I-7000 DCON протокол.

source: Transport
uk: Транспорт
