Repository: aleax/openscada
Catalog: src/po/*.po
Languages: de, ru, uk

source: User directory copy projects
de: Benutzer-Verzeichnis kopieren Projekte
ru: Проекты копий пользов. директории
uk: Проекти копій користув. теки

source: Pre-installed projects
de: Vorinstallierte Projekte
ru: Предустановленные проекты
uk: Передвстановлені проекти

source: Select project for start.
de: Wählen Sie Projekt für den Start.
ru: Выберите проект для старта.
uk: Оберіть проект для запуску.

source: OpenSCADA start
ru: Запуск OpenSCADA!
uk: Запуск OpenSCADA

source: Enter new project ID. Do not use spaces!
de: Geben Sie das neue Projekt ID. Verwenden Sie keine Leerzeichen!
ru: Введите ID нового проекта. Не используйте пробелы!
uk: Введіть ID нового проекту. Не використовуйте простори!

source: No a project set!
de: Nein ein Projekt einstellen!
ru: Ни одного проекта не выбрано!
uk: Жодного проекту не встановлено!

source: Set the project name to:
de: Stellen Sie den Namen des Projekts an:
ru: Имя проекта установлено в:
uk: Встановлено назву проекту у:

source: already started.
de: begonnen.
ru: уже запущен.
uk: вже запущено.

source: Debug (0);Information (1);Notice (2);Warning (3);Error (4);Critical (5);Alert (6);Emergency (7)
de: Debuggen (0);Information (1);Bemerkung (2);Warnung (3);Fehler (4);Kritisch (5);Wach (6);Notfall (7)
uk: Налагодження (0);Інформація (1);Зауваження (2);Попередження (3);Помилка (4);Критично (5);Тривога (6);Аварія (7)

source: Passive;Passive param. attribute;Active param. attribute
de: Passiv;Passives Parameterattribut;Aktives Parameterattribut
uk: Пасивний;Пасивний атрибут параметру;Активний атрибут параметру

source: Debug (0);Information (1);Notice (2);Warning (3);Error (4);Critical (5);Alert (6);Emergency (7);Information (1), ALARMS;Notice (2), ALARMS;Warning (3), ALARMS;Error (4), ALARMS;Critical (5), ALARMS;Alert (6), ALARMS;Emergency (7), ALARMS
de: Debuggen (0);Information (1);Bemerkung (2);Warnung (3);Fehler (4);Kritisch (5);Wach (6);Notfall (7);Information (1), ALARM;Bemerkung (2), ALARM;Warnung (3), ALARM;Fehler (4), ALARM;Kritisch (5), ALARM;Wach (6), ALARM;Notfall (7), ALARM
uk: Налагодження (0);Інформація (1);Зауваження (2);Попередження (3);Помилка (4);Критично (5);Тривога (6);Аварія (7);Інформація (1), ПОРУШЕННЯ;Зауваження (2), ПОРУШЕННЯ;Попередження (3), ПОРУШЕННЯ;Помилка (4), ПОРУШЕННЯ;Критично (5), ПОРУШЕННЯ;Тривога (6), ПОРУШЕННЯ;Аварія (7), ПОРУШЕННЯ

source: ========================= Subsystem "DB" options ======================== ------ Parameters of the section '%s' of the configuration file ------ SYSStPref <0|1> Use the station ID in the common table (SYS). TblLifeTime <seconds> Opened tables lifetime (by default 600 seconds).
de: ========================= Optionen des Subsystems"DB" ========================= ---------- Parameter des Abschnitts '%s' der Konfigurationsdatei ---------- SYSStPref <0|1> Verwenden Sie die Stationskennung in der gemeinsamen Tabelle (SYS). TblLifeTime <Sekunden> Lebensdauer geöffneter Tabellen (standardmäßig 600 Sekunden).
uk: ========================= Опції підсистеми "БД" ========================= ---------- Параметри секції '%s' конфігураційного файлу ---------- SYSStPref <0|1> Використовувати ідентифікатор станції у загальній таблиці (SYS). TblLifeTime <секунд> Час життя відкритих таблиць (по замовченню 600 секунд).

source: Warning element '%s'! %s
de: Element '%s' Warnung! %s
uk: Попередження елементу '%s'! %s

source: DB address in format "{DB module}.{DB name}". Set '*.*' for use the main work DB.
de: Datenbank Parameter im Format "{DB-Modul}.{DB-Name}". Setzen Sie '*.*' Für die Hauptarbeits-DB.
uk: Адреса БД у форматі "{Модуль БД}.{Ім'я БД}". Вставити '*.*' для використання основної робочої БД.

source: Schedule wrotes in seconds periodic form or in the standard CRON form. The seconds periodic form is one real number (1.5, 1e-3). Cron is the standard form "* * * * *". Where items by order: - minutes (0-59); - hours (0-23); - days (1-31); - month (1-12); - week day (0[Sunday]-6). Where an item variants: - "*" - any value; - "1,2,3" - allowed values list; - "1-5" - raw range of allowed values; - "*/2" - range divider for allowed values. Examples: "1e-3" - call with a period of one millisecond; "* * * * *" - each minute; "10 23 * * *" - only at 23 hour and 10 minute for any day and month; "*/2 * * * *" - for minutes: 0,2,4,...,56,58; "* 2-4 * * *" - for any minutes in hours from 2 to 4(include).
de: Spielplan Wird in Sekunden periodische Form oder in Standard-cron-Form Write. Sekunden Form ist eine Realzahl (1.5, 1e-3). Cron ist es Standardform "* * * * *". Wo Artikel bestellen: - Minuten (0-59); - Stunden (0-23); - Tage (1-31); - Monat (1-12); - Wochentag (0 [Sonntag] -6). Wo ein Posten Varianten: - "*" - einen Wert; - "1,2,3" - zulässigen Werte; - "1-5" - Roh Bereich der zulässigen Werte; - "*/2" - Bereich Teiler für die zulässigen Werte. Beispiele: "1e-3" - periodischen rufen von einer Millisekunde; "* * * * *" - jede Minute; "10 23 * * *" - nur 23 Stunden und 10 Minuten für jeden Tag und Monat; "*/2 * * * *" - für Minuten: 0,2,4,..., 56,58; "* 2-4 * * *" - für alle Minuten in Stunden von 2 bis 4 (einschließlich).
uk: Планування записується у формі секундної періодичності або у формі стандарту CRON. Секундна форма це одне реальне число (1.5, 1e-3). Форма стандарту Cron це "* * * * *". Де елементи по черзі: - хвилини (0-59); - години (0-23); - дні (1-31); - місяці (1-12); - дні тижня (0[Неділя]-6). Де варіанти елементу: - "*" - будь яке значення; - "1,2,3" - дозволені значення; - "1-5" - діапазон дозволених значень; - "*/2" - дільник діапазону дозволених значень. Приклади: "1e-3" - періодичний виклик з однією мілісекундою; "* * * * *" - кожна хвилина; "10 23 * * *" - тільки 23я година та 10а хвилина будь якого дня та місяця; "*/2 * * * *" - для хвилин: 0,2,4,...,56,58; "* 2-4 * * *" - для будь якої хвилини у годині від 2 до 4(включно).

source: Real;Integer;Boolean;String;Text;Object;Integer numbers selection;Real numbers selection;Strings selection
uk: Реальний;Цілий;Логічний;Рядок;Текст;Об'єкт;Вибір цілих чисел;Вибір реальних чисел;Вибір рядків

source: Address to the DAQ attribute writes in the form "{Type}.{Cntr}.{Prm}[.{PrmN}].{Attr}", where: Type,Cntr,Prm,Attr - DAQ: type, controller object, parameter and attribute. Link's template, of the column "Value" on the template forming side, writes in the form "{Parameter}|{attribute}", where: Parameter - specifies the parameter's name as the attribute's container; attribute - attributes with the equal value <Parameter> will be grouped and will be appointed only by the indication of the attributes' container, and the individual attributes will be associated with the attributes of the container in accordance with this field. Constant link value writes in the form "val:{Constant}".
de: Adresse an den DAQ schreibt in der Form "{Type}.{Cntr}.{Prm}[.{PrmN}].{Attr}", wobei: Type,Cntr,Prm,Attr - DAQ: Typ, Controller-Objekt, Parameter und Attribut. Link-Vorlage, der Spalte "Value" ist die Vorlage bildende Seite, schreibt in das Formular "{Parameter}|{attribute}", wobei: Parameter - Gibt den Namen des Parameters als Container des Attributs an; attribute - Attribute mit dem gleichen Wert <Parameter> werden gruppiert und nur durch die Angabe des Attributcontainers festgelegt, und die einzelnen Attribute werden entsprechend diesem Feld den Attributen des Containers zugeordnet. Konstanter Linkwert schreibt in der Form "val:{Constant}".
uk: Адреса до DAQ атрибутів записується у формі "{Type}.{Cntr}.{Prm}[.{PrmN}].{Attr}", де: Type,Cntr,Prm,Attr - DAQ: тип, об'єкт контролеру, параметр та атрибут. Шаблон зв'язку, стовпчику "Значення" на боці формування шаблону, записується у формі "{Parameter}|{attribute}", де: Parameter - вказує ім'я параметру як контейнеру атрибутів; attribute - атрибути з однаковим значенням <Parameter> будуть групуватися та дозволять призначатися визначенням тільки контейнеру атрибутів, а окремі атрибути будуть пов'язані з атрибутами контейнеру відповідно до поля <attribute>. Зв'язок на постійне значення записується у формі "val:{Constant}".

source: DB address in format "{DB module}.{DB name}.{Table name}". Set '*.*.{Table name}' for use the main work DB.
de: Datenbank Parameter im Format "{DB-Modul}.{DB-Name}.{Table name}". Für die Hauptdatenbank '*.*.{Table name}' verwenden.
uk: Адреса БД у форматі "{Модуль БД}.{Ім'я БД}.{Ім'я Таблиці}". Вставити '*.*.{Ім'я Таблиці}' для використання основної робочої БД.

source: Administrator (superuser)!!!
de: Administrator (Supernutzer)!!!
uk: Адміністратор (суперкористувач)!!!

source: Simple user.
de: Normaler Benutzer.
uk: Простий користувач.

source: Administrators group.
de: Gruppe von Administratoren.
uk: Група адміністраторів.

source: Users group.
de: Gruppe von Benutzern.
uk: Група користувачів

source: Program counters at the exit time: %s
de: Programmzähler zur Ausgangszeit: %s
uk: Лічильники програми на час завершення: %s

source: *************************************************************************** ********** %s v%s (%s-%s). ********* *************************************************************************** =========================================================================== ==================== Generic options ====================================== =========================================================================== -h, --help This help text about the program command-line options and configuration file parameters. --projName=<name> OpenSCADA project name to switch it. For this feature there also uses an environment variable "OSCADA_ProjName" and the program binary name "openscada_{ProjName}". --projUserDir={dir} Directory of user projects (writeable) of OpenSCADA, "~/.openscada" by default. --projLock={per} Uses the projects locking by creation the "lock" file into the project folder and update it in the period <per>, by default it is enabled and the updating period <per> is 60 seconds. To disable set the updating period <per> to zero. --lang=<LANG> Station language, in the view "en_US.UTF-8". --config=<file> Station configuration file. --station=<id> Station identifier. --statName=<name> Station name. --modDir=<path> Directories with the modules, separated by ';', they can include a files' template at the end. --messLev=<level> Level of the processing messages (0-7). --log=<direct> Direct messages to, by the bitfield: 0x1 - syslogd; 0x2 - stdout; 0x4 - stderr; 0x8 - the messages archive. --consoleCharSet={CharSet} Forcing to the console <CharSet> for the console messages, by default it is system one. --demon, --daemon Run in the daemon mode. --pidFile=<file> File for the program process ID placing here. --noCoreDump Prevents from the core dump creation at crashes - don't set the limit to the unlimited value. --permCrtFiles={perm} Permissions of the created OpenSCADA files, by default it is 0755 (RWXRW_RW_). ----------- Station '%s(%s)' settings in the configuration file ----------- StName <nm> Station name. WorkDB <Type.Name> Working DB (<type> and <name>). WorkDir <path> Working directory. ModDir <path> Directories with the modules, separated by ';', they can include a files' template at the end. IcoDir <path> Icons directory. DocDir <path> Documents directory. MessLev <level> Level of the processing messages (0-7). SelDebCats <list> Debug categories list, separated by ';'. LogTarget <direction> Direct messages to, by the bitfield: 0x1 - syslogd; 0x2 - stdout; 0x4 - stderr; 0x8 - the messages archive. Lang <lang> Station language, in the view "uk_UA.UTF-8". Lang2CodeBase <lang> Base language for variable texts translation, in the two symbols code. MainCPUs <list> Main list of the using CPUs, separated by ':'. TaskInvPhs <n> Number of phases of the task invoking, 1 to disable the phasing. ClockRT <0|1> Sets the clock source to use to REALTIME (otherwise MONOTONIC), which is problematic one at the system clock modification. SaveAtExit <0|1> Save the program at exit. SavePeriod <seconds> Period of the program saving, 0 to disable. ModifCalc <0|1> Set modification for the calculated objects. RdStLevel <lev> Level of the redundancy of the current station. RdTaskPer <seconds> Call period of the redundancy task. RdRestConnTm <seconds> Time to restore connection to "dead" reserve station. RdStList <list> Redundant stations list, separated symbol ';' (st1;st2). RdPrimCmdTr <0|1> Enables the transmission of primary commands to the reserve stations. Global configurable limits: limObjID_SZ [*20..50] ID size of the OpenSCADA objects. WARNING! Big size can cause the key limit error on MySQL like DB! Change that once before use on DBs with the fixed type "char({N})"! limObjNm_SZ [*100...200] NAME size of the OpenSCADA objects. WARNING! Change that once before use on DBs with the fixed type "char({N})"! limArchID_SZ [*50...90] ID size of the value archive objects. WARNING! Increase it only, else you can get problems on Archive.FSArch! Change that once before use on DBs with the fixed type "char({N})"! limUserFile_SZ [1MB...*10MB...1000MB] The files size limit at loading and processing in the userspace and the part size of the big files transferring. limUserIts_N [1000...*1000000...1000000000] The limit on count of creating user items, like to array items. limCacheIts_N [*100...100000] The limit on count of the caching items. Global configurable parameters: prmStrBuf_SZ [1000...*10000...1000000] Length of string buffers, no string class. prmWait_DL [0.001...*0.1...1] Quantum of the waiting time cycles, seconds. prmWait_TM [*5...10] Standard waiting timeout length, seconds. prmInterf_TM [*7...15] Time of waiting for the interface reaction, seconds. prmServTask_PER [1...*10...120] Service task period, seconds.
de: *************************************************************************** ********** %s %s (%s-%s). ********* *************************************************************************** =========================================================================== ====================== Grundoptionen ====================================== =========================================================================== -h, --help Dieser Hilfetext zu den Programmbefehlszeilenoptionen und Konfigurationsdateiparametern. --projName=<name> OpenSCADA-Projektname, um es zu wechseln. Für diese Funktion wird auch eine Umgebungsvariable "OSCADA_ProjName" und der Programmbinärname "openscada{ProjName}" verwendet. --projUserDir={dir} Verzeichnis von Benutzerprojekten (schreibbar) von OpenSCADA, "~/.openscada" standardmäßig. --projLock={per} Verwenden Sie zum Sperren von Projekten die Datei "lock" in den Projektordner und aktualisieren Sie sie in der Periode <per>, Standardmäßig ist sie aktiviert und die Aktualisierungsdauer <per> beträgt 60 Sekunden. Zum Deaktivieren setzen Sie den Aktualisierungszeitraum <per> auf Null. --lang=<LANG> Die Stationssprache, in Sicht "de_DE.UTF-8". --config=<file> Die Station Konfigurationsdatei. --station=<id> Station-ID. --statName=<name> Die Station Name. --modDir=<path> Verzeichnisse mit den Modulen, getrennt durch ';', können am Ende eine Dateivorlage enthalten. --messLev=<Level> Level der Verarbeitungsnachrichten (0-7). --log=<Richtung> Direkte Nachrichten an, von Bit-Feld: 0x1 - Systemlog (syslogd); 0x2 - Standardausgang (stdout); 0x4 - Standardfehlerausgang (stderr); 0x8 - die Meldungen archivieren. --consoleCharSet={CharSet} Erzwingen der Konsole <CharSet> für die Konsolenmeldungen, standardmäßig ist es System eins. --demon, --daemon Führen Sie im Daemon-Modus. --pidFile=<file> Datei für die Programm-Prozess-ID, die hier platziert wird. --noCoreDump Verhindert die Erstellung eines Core-Dumps bei Abstürzen - setzen Sie das Limit nicht auf den unbegrenzten Wert. --permCrtFiles={Rechte} Die Berechtigung zum Erstellen von OpenSCADA-Dateien lautet standardmäßig 0755 (RWXRW_RW_). ---------- Parameter der Station '%s(%s)' in der Konfigurationsdatei ---------- StName <nm> Stationsname. WorkDB <Type.Name> Arbeits-DB (Typ und Name). WorkDir <path> Arbeitsverzeichnis. ModDir <path> Verzeichnisse mit den Modulen, getrennt durch ';', können am Ende eine Dateivorlage enthalten. IcoDir <path> Ikonenverzeichnis. DocDir <path> Documenteverzeichnis. MessLev <level> Level der Verarbeitungsnachrichten (0-7). SelDebCats <Liste> Liste der Debug-Kategorien, getrennt durch ';'. LogTarget <Richtung> Direkte Nachrichten an, von Bit-Feld: 0x1 - Systemlog (syslogd); 0x2 - Standardausgang (stdout); 0x4 - Standardfehlerausgang (stderr); 0x8 - die Meldungen archivieren. Lang <Sprache> Die Stationssprache, in Sicht "de_DE.UTF-8". Lang2CodeBase <Sprache> Basissprache für die Übersetzung von variablen Texten, in den beiden Symbolen. MainCPUs <Liste> Hauptliste der verwendeten CPUs, getrennt durch ':'. TaskInvPhs <n> Anzahl der Phasen des Taskaufrufs, 1 um die Phaseneinstellung zu deaktivieren. ClockRT <0|1> Legt die zu verwendende Taktquelle auf REALTIME (sonst MONOTONIC) fest, was bei der Systemtaktmodifikation problematisch ist. SaveAtExit <0|1> Speichere das Programm beim Beenden. SavePeriod <Sekunden> Zeitraum der Programmspeicherung in Sekunden, 0 zu deaktivieren. ModifCalc <0|1> Legen Sie die Änderung für die berechneten Objekte fest. RdStLevel <lev> Level der Redundanz der aktuellen Station. RdTaskPer <Sekunden> Aufrufdauer der Redundanzaufgabe. RdRestConnTm <Sekunden> Zeit, um die Verbindung zur Reservestation "tot" wiederherzustellen. RdStList <Liste> Liste der redundanten Stationen, getrenntes Symbol ';' (st1;st2). RdPrimCmdTr <0|1> Ermöglicht die Übertragung von Primärbefehlen zu den Reservestationen. Globale konfigurierbare Grenzen: limObjID_SZ [*20..50] ID-Größe der OpenSCADA-Objekte. WARNUNG! Größe kann den Schlüsselbegrenzungsfehler auf MySQL wie DB verursachen! Ändern Sie dies einmal vor der Verwendung in DBs mit dem festen Typ "char({N})"! limObjNm_SZ [*100...200] NAME-Größe der OpenSCADA-Objekte. WARNUNG! Ändern Sie dies einmal vor der Verwendung in DBs mit dem festen Typ "char({N})"! limArchID_SZ [*50...90] ID-Größe der Wertarchivierungsobjekte. WARNUNG! Erhöhen Sie es nur, sonst können Probleme auf Archive.FSArch auftreten! Ändern Sie dies einmal vor der Verwendung in DBs mit dem festen Typ "char({N})"! limUserFile_SZ [1MB...*10MB...1000MB] Die Dateigrößenbeschränkung beim Laden und Verarbeiten im Benutzerbereich und die Teilegröße der übertragenen großen Dateien. limUserIts_N [1000...*1000000...1000000000] Die Anzahl der Benutzer beim Erstellen von Benutzerelementen, beim Anordnen von Elementen. limCacheIts_N [*100...100000] Die Anzahl der zwischengespeicherten Elemente. Globale konfigurierbare Parameter: prmStrBuf_SZ [1000...*10000...1000000] Länge der String-Puffer, keine String-Klasse. prmWait_DL [0.001...*0.1...1] Quantum der Wartezeitzyklen, Sekunden. prmWait_TM [*5...10] Standardwartezeit, Sekunden. prmInterf_TM [*7...15] Wartezeit auf die Schnittstellenreaktion: Sekunden. prmServTask_PER [1...*10...120] Serviceaufgabezeitraum, Sekunden.
uk: *************************************************************************** ********** %s %s (%s-%s). ********* *************************************************************************** =========================================================================== ======================== Основні опції ==================================== =========================================================================== -h, --help Цей текст допомоги за опціями командного рядку та параметрами конфігураційного файлу програми. --projName=<ім'я> Ім'я проекту OpenSCADA для перемикання. Для такої операції також використовується змінна оточення "OSCADA_ProjName" та ім'я бінарної програми "openscada_{ProjName}". --projUserDir={тека} Тека користувацьких проектів OpenSCADA (доступна для запису), по замовченню "~/.openscada". --projLock={per} Використовувати блокування проектів створенням файлу "lock" у теці проекту та його оновлення з періодом <per>, по замовченню включено та період оновлення <per> складає 60 секунд. Для вимкнення встановити період оновлення <per> у нуль. --lang=<LANG> Мова станції, у вигляді "uk_UA.UTF-8". --config=<файл> Конфігураційний файл станції. --station=<ід> Ідентифікатор станції. --statName=<ім'я> Ім'я станції. --modDir=<path> Теки модулів, поділені ';', та можуть містити у кінці шаблон файлів. --messLev=<рівень> Рівень оброблюваних повідомлень (0-7). --log=<напрямок> Спрямування повідомлень до, за бітовим полем: 0x1 - системний логер (syslogd); 0x2 - стандартний вихід (stdout); 0x4 - стандартний вихід помилок (stderr); 0x8 - архів повідомлень. --consoleCharSet={CharSet} Примусово встановити кодовий набір символів консолі у <CharSet>, по замовченню він системний. --demon, --daemon Запуск у режимі демона. --pidFile=<file> файл для розташування ID процесу програми тут. --noCoreDump Запобігати створенню передсмертних дампів - не знімати це обмеження. --permCrtFiles={права} Права створюваних OpenSCADA файлів, по замовченню це 0755 (RWXRW_RW_). ------ Параметри станції '%s(%s)' у конфігураційному файлі -------- StName <ім'я> Ім'я станції. WorkDB <Тип.Ім'я> Робоча БД (ім'я та тип). WorkDir <шлях> Робоча тека. ModDir <path> Теки модулів, поділені ';', та можуть містити у кінці шаблон файлів. IcoDir <path> Тека іконок. DocDir <path> Тека документів. MessLev <рівень> Рівень оброблюваних повідомлень (0-7). SelDebCats <перелік> Перелік категорій налагодження, поділено ';'. LogTarget <напрямок> Спрямування повідомлень до, за бітовим полем: 0x1 - системний логер (syslogd); 0x2 - стандартний вихід (stdout); 0x4 - стандартний вихід помилок (stderr); 0x8 - архів повідомлень. Lang <мова> Мова станції, у вигляді "uk_UA.UTF-8". Lang2CodeBase <мова> Базова мова для перекладу текстових змінних, два символи. MainCPUs <перелік> Основний перелік використаних процесорів, поділено ':'. TaskInvPhs <n> Кількість фаз виклику задач, 1 для вимкнення фазування. ClockRT <0|1> Встановити використання джерела годиннику у REALTIME (інакше MONOTONIC), дещо проблематичне при модифікації системного годинника. SaveAtExit <0|1> Зберігати програму при виході. SavePeriod <секунд> Період збереження програми, 0 для вимкнення. ModifCalc <0|1> Встановлювати модифікацію для обчислювальних об'єктів. RdStLevel <рів> Рівень резервування поточної станції. RdTaskPer <секунд> Період виклику задачі обслуговування резервування. RdRestConnTm <секунд> Час відновлення з'єднання з "мертвою" резервною станцією. RdStList <перелік> Перелік резервних станції, поділено символом ';' (st1;st2). RdPrimCmdTr <0|1> Включення трансляції первинних команд до резервних станцій. Глобальні конфігуровані ліміти: limObjID_SZ [*20..50] Розмір ІД об'єктів OpenSCADA. УВАГА! Великий розмір може викликати помилку розміру ключа на БД схожих на MySQL! Змініть це лише одноразово перед використанням на БД із фіксованим типом "char({N})"! limObjNm_SZ [*100...200] Розмір НАЗВИ об'єктів OpenSCADA. УВАГА! Змініть це лише одноразово перед використанням на БД із фіксованим типом "char({N})"! limArchID_SZ [*50...90] Розмір ІД об'єктів архіву значень. УВАГА! Лише збільшуйте його, інакше можете отримати проблеми у Archive.FSArch! Змініть це лише одноразово перед використанням на БД із фіксованим типом "char({N})"! limUserFile_SZ [1MB...*10MB...1000MB] Обмеження розміру файлів на завантаження та опрацювання у просторі користувача та розміру частин передачі великих файлів. limUserIts_N [1000...*1000000...1000000000] Обмеження на кількість створюваних користувацьких елементів, на кшталт елементів масивів. limCacheIts_N [*100...100000] Обмеження на кількість елементів у кешу. Глобальні конфігуровані параметри: prmStrBuf_SZ [1000...*10000...1000000] Довжина строкових буферів, не строковий клас. prmWait_DL [0.001...*0.1...1] Час кванту циклів очікування, секунд. prmWait_TM [*5...10] Розмір стандартного таймаута очікування, секунд. prmInterf_TM [*7...15] Час очікування реакції інтерфейсу, секунд. prmServTask_PER [1...*10...120] Період сервісного завдання, секунд.
