Repository: aleax/openscada
Catalog: src/po/*.po
Languages: de, ru, uk

source: Task priority level (-1...199), where: -1 - lowest priority batch policy; 0 - standard userspace priority; 1...99 - realtime priority level (round-robin), often allowed only for "root"; 100...199 - realtime priority level (FIFO), often allowed only for "root".
de: Task-Priorität (-1...199), wobei: -1 - Niedrigste Priorität, Hintergrund Politik; 0 - Standard-Benutzer Priorität; 1...99 - Die Prioritätsstufe der Echtzeit-(Round-Robin), oft nur für "root"; 100...199 - Die Prioritätsstufe der Echtzeit-(FIFO), oft nur für "root".
ru: Уровень приоритета задачи (-1...199), где: -1 - минимальный приоритет, фоновая политика; 0 - стандартный пользовательский приоритет; 1...99 - уровень приоритета реального времени (round-robin), часто доступно только для "root"; 100...199 - уровень приоритета реального времени (FIFO), часто доступно только для "root".
uk: Рівень пріоритету задачі (-1...199), де: -1 - мінімальний пріоритет, фонова політика; 0 - стандартний користувацький пріоритет; 1...99 - рівень пріоритету реального часу (round-robin), часто доступно тільки для "root"; 100...199 - рівень пріоритету реального часу (FIFO), часто доступно тільки для "root".

source: Specifies the category of the requested messages. Use template's symbols for group selection: '*' - any substring; '?' - any character. Regular expression enclosed between the symbols '/' (/mod_(System|LogicLev)/).
de: Gibt die Kategorie der angeforderten Nachrichten an. Vorlage verwenden Symbole für Gruppen-Auswahl: '*' - jeder Teilstring; '?' - ein beliebiges Symbol. Regulärer Ausdruck in Symbolen umschlossen '/' (/mod_(System|LogicLev)/).
ru: Указывает категорию запрашиваемых сообщений. Используйте шаблонные символы для группового выбора: '*' - любая подстрока; '?' - любой символ. Регулярное выражение заключается между символами '/' (/mod_(System|LogicLev)/).
uk: Вказує категорію запитуваних повідомлень. Використовуйте символи шаблону для групового вибору: '*' - будь який підрядок; '?' - будь який символ. Регулярний вираз включається між символами '/' (/mod_(System|LogicLev)/).

source: =================== Subsystem "Modules scheduler" options ================= --modPath=<path> Directories with the modules, separated by ';', they can include a files' template at the end. ------ Parameters of the section '%s' of the configuration file ------ ModPath <path> Directories with the modules, separated by ';', they can include a files' template at the end. This is a synonym of the system wide parameter "ModDir" ModAllow <list> List of the shared libraries allowed for the automatic loading, attaching and starting (bd_DBF.so;daq_JavaLikeCalc.so). Uses '*' value to allow all the modules. ModDeny <list> List of the shared libraries denied for the automatic loading, attaching and starting (bd_DBF.so;daq_JavaLikeCalc.so). ChkPer <seconds> Period of the checking for new shared libraries(modules), 0 to disable.
de: =================== Optionen des Subsystems "Modul-Scheduler" ==================== --modPath=<path> Verzeichnisse mit den Modulen, getrennt durch ';', können am Ende eine Dateivorlage enthalten. ---------- Parameter des Abschnitts '%s' der Konfigurationsdatei ---------- ModPath <path> Verzeichnisse mit den Modulen, getrennt durch ';', können am Ende eine Dateivorlage enthalten. Dies ist ein Synonym für den systemweiten Parameter "ModDir" ModAllow <list> Liste der freigegebenen Bibliotheken für das automatische Laden, Anhängen und Starten (bd_DBF.so;daq_JavaLikeCalc.so). Verwendet den Wert '*', um alle Module zuzulassen. ModDeny <list> Liste der freigegebenen Bibliotheken zum automatischen Laden, Anhängen und Starten (bd_DBF.so;daq_JavaLikeCalc.so). ChkPer <Sekunden> Zeitraum der Überprüfung auf neue gemeinsame Bibliotheken (Module), 0 zu deaktivieren.
ru: =================== Опции подсистемы "Планировщик модулей" ==================== --modPath=<путь> Директории модулей, разделённые ';', и в конце могут содержать шаблон файлов. ---------- Параметры секции '%s' конфигурационного файла ---------- ModPath <путь> Директории модулей, разделённые ';', и в конце могут содержать шаблон файлов. Это синоним параметра уровня станции "ModDir". ModAllow <список> Список разделяемых библиотек допустимых для автоматической загрузки, подключения и запуска (bd_DBF.so;daq_JavaLikeCalc.so). Использовать значение '*' для разрешения всех модулей. ModDeny <список> Список разделяемых библиотек запрещённых для автоматической загрузки, подключения и запуска (bd_DBF.so;daq_JavaLikeCalc.so). ChkPer <секунд> Период поиска новых разделяемых библиотек (модулей), 0 для отключения.
uk: ================ Опції підсистеми "Планувальник модулів" ================== --modPath=<шлях> Теки модулів, поділені ';', та можуть містити у кінці шаблон файлів. ---------- Параметри секції '%s' конфігураційного файлу ---------- ModPath <шлях> Теки модулів, поділені ';', та можуть містити у кінці шаблон файлів. Це синонім параметру рівня станції "ModDir". ModAllow <перелік> Перелік поділюваних бібліотек дозволених для автоматичного завантаження, підключення та виконання (bd_DBF.so;daq_JavaLikeCalc.so). Використовувати значення '*' для дозволу всіх модулів. ModDeny <перелік> Перелік поділюваних бібліотек заборонених для автоматичного завантаження, підключення та виконання (bd_DBF.so;daq_JavaLikeCalc.so). ChkPer <секунд> Період пошуку нових поділюваних бібліотек(модулів), 0 - для вимкнення.

source: SO '%s' is missing!
de: SO '%s' ist nicht vorhanden!
ru: SO '%s' отсутствует!
uk: SO '%s' відсутній!

source: SO '%s' is already connected!
de: SO '%s' ist eingeschaltet!
ru: SO '%s' уже подключен!
uk: SO '%s' вже підключений!

source: Error SO '%s': %s
de: Fehler SO '%s': %s
ru: Ошибка SO '%s': %s
uk: Помилка SO '%s': %s

source: %s for type '%s' does not support the version %d of the module!
de: %s für Typ '%s' unterstützt die Version %d des Moduls nicht!
ru: %s для типа '%s' не поддерживает версию модуля: %d!
uk: %s для типу '%s' не підтримує версію модуля: %d!

source: Module '%s' already exists!
de: Modul '%s' existiert bereits!
ru: Модуль '%s' уже присутствует!
uk: Модуль '%s' вже присутній!

source: Error connecting module '%s'!
de: Fehler beim Verbinden des Moduls '%s'!
ru: Ошибка подключения модуля '%s'!
uk: Помилка під'єднання модуля '%s'!

source: Can not detach the library '%s'.
de: Die Bibliothek '%s' kann nicht getrennt werden.
ru: Невозможно отключить библиотеку '%s'.
uk: Неможливо від'єднати бібліотеку '%s'.

source: Path to the shared libraries(modules)
de: Pfad zu den gemeinsam genutzten Bibliotheken (Module)
ru: Путь к разделяемым библиотекам(модулям)
uk: Шлях до поділюваних бібліотек(модулів)

source: Denied modules
de: Nicht erlaubte Module
ru: Запрещённые модули
uk: Заборонені модулі

source: The list of shared libraries (modules) denied for automatic connection. Elements are separated by the symbol ';'.
de: Die Liste der gemeinsam genutzten Bibliotheken (Module) verweigert für die automatische Verbindung. Elemente sind durch das Symbol ';' getrennt.
ru: Список разделяемых библиотек(модулей) запрещённых для автоматического подключения. Элементы разделены символом ';'.
uk: Перелік поділюваних бібліотек(модулів) заборонених для автоматичного підключення. Елементи поділено символом ';'.

source: Allowed modules
de: Erlaubte Module
ru: Разрешённые модули
uk: Дозволені модулі

source: The list of shared libraries (modules) allowed for automatic connection. Elements are separated by the symbol ';'. The value '*' is used to allow all modules.
de: Die Liste der gemeinsam genutzten Bibliotheken (Module) erlaubt die automatische Verbindung. Elemente sind durch das Symbol ';' getrennt. Der Wert '*' wird verwendet, um alle Module zuzulassen.
ru: Список разделяемых библиотек(модулей) разрешённых для автоматического подключения. Элементы разделены символом ';'. Значение '*' используется для разрешения всех модулей.
uk: Перелік поділюваних бібліотек(модулів) дозволених для автоматичного підключення. Елементи поділено символом ';'. Значення '*' використано для дозволу всіх модулів.

source: Period of checking of the modules, seconds
de: Zeitraum der Überprüfung der Module, Sekunden
ru: Период проверки модулей, секунд
uk: Період перевірки модулів, секунд

source: Check the modules now.
de: Überprüfen Sie die Module jetzt.
ru: Проверить модули сейчас.
uk: Перевірити модулі зараз.

source: Shared libraries(modules)
de: Gemeinsame Bibliotheken (Module)
ru: Разделяемые библиотеки(модули)
uk: Поділяємі бібліотеки(модулі)

source: Modules
de: Module
ru: Модули
uk: Модулі

source: Author
de: Autor
ru: Автор
uk: Автор

source: License
de: Lizenz
ru: Лицензия
uk: Ліцензія

source: Features
ru: Свойства

source: Module enabling.
de: Modul aktivieren.
ru: Включение модуля.
uk: Увімкнення модуля.

source: Module disabling.
de: Modul deaktiviert.
ru: Отключение модуля.
uk: Вимкнення модуля.

source: Module starting.
de: Modul startet.
ru: Запуск модуля.
uk: Запуск модуля.

source: Module stopping.
de: Modul stoppt.
ru: Останов модуля.
uk: Зупинка модуля.

source: Function '%s' is not in the module!
de: Funktion '%s' ist nicht im Modul!
ru: Функция '%s' отсутствует в модуле!
uk: Функція '%s' відсутня в модулі!

source: Module:
de: Modul:
ru: Модуль:
uk: Модуль:

source: Module
de: Modul
ru: Модуль
uk: Модуль

source: Module information
de: Modulinformation
ru: Информация о модуле
uk: Інформація про модуль

source: Error adding parameter '%s'.
de: Fehler beim Hinzufügen des Parameters '%s'.
ru: Ошибка добавления параметра '%s'.
uk: Помилка додання параметру '%s'.

source: 1:Parameter disabled.
de: 1:Parameter ist deaktiviert.
ru: 1:Параметр отключен.
uk: 1:Параметр вимкнено.

source: 2:Acquisition stopped.
de: 2:Akquisition wurde gestoppt.
ru: 2:Сбор остановлен.
uk: 2:Збір зупинено.

source: Parameter:
ru: Параметр:
uk: Параметр:

source: The type changing leads to lose some data of the specific configurations.
de: Die Typänderung führt dazu, dass einige Daten der spezifischen Konfigurationen verloren gehen.
ru: Смена типа повлечёт за собой потерю данных специфических конфигураций.
uk: Зміна типу потягне за собою втрату даних специфічних конфігурацій.

source: Inclusion
de: Einbeziehung
ru: Включение
uk: Включення

source: Controller is not running!
de: Controller ist nicht gestartet!
ru: Контроллер не запущен!
uk: Контролер не запущено!

source: Frequency of calculation of the function, Hz
de: Frequenz der Berechnung der Funktion, Hz
ru: Частота обсчёта функции, Гц
uk: Частота обчислення функції, Гц

source: Function start flag
de: Schalter fürs Startens der Funktion
ru: Флаг запуска функции
uk: Прапорець запуску функції

source: Function stop flag
de: Die Flagge fürs Stoppen der Funktion
ru: Флаг останова функции
uk: Прапорець зупинки функції

source: Function error
de: Fehler in der Funktion
ru: Ошибка функции
uk: Помилка функції

source: Template is off.
de: Vorlage ist deaktiviert.
ru: Шаблон отключен.
uk: Шаблон вимкнено.

source: Parameter template:
de: Parametervorlage:
ru: Шаблон параметра:
uk: Шаблон параметра:

source: Template
de: Vorlage
ru: Шаблон
uk: Шаблон

source: Real;Integer;Boolean;String;String (translate);Text;Text (translate);Object;Integer numbers selection;Real numbers selection;Strings selection
de: Reelle Zahl;Ganzzahl;Logisch;Linie;Linie (übersetzen);Text;Text (übersetzen);Objekt;Integer-Zahlen Auswahl;Reelle Zahlen Auswahl;Strings Auswahl
ru: Вещественный;Целый;Логический;Строка;Строка (перевод);Текст;Текст (перевод);Объект;Выбор целых чисел;Выбор вещественных чисел;Выбор строк

source: Input;Output
de: Eingang;Ausgang
ru: Вход;Выход
uk: Вхід;Вихід

source: Attribute
de: Attribut
ru: Атрибут
uk: Атрибут

source: Not attribute;Read only;Full access
de: Nicht Attribut;Nur Lesen;Voller Zugang
ru: Не атрибут;Только чтение;Полный доступ
uk: Не атрибут;Тільки читання;Повний доступ

source: Variable;Constant;Link
de: Variable;Konstante;Verbindung
ru: Переменная;Константа;Связь
uk: Змінна;Константа;Зв'язок

source: Program language
de: Programmsprache
ru: Язык программы
uk: Мова програми

source: New IO
de: Neu IO
ru: Новое IO
uk: Нове IO

source: Deleting a locked attribute is not allowed.
de: Löschen des blockierten Attributs ist nicht zulässig.
ru: Удаление заблокированного атрибута невозможно.
uk: Видалення заблокованого атрибуту неможливе.

source: Changing locked attribute is not allowed.
de: Änderung des blockierten Attributs ist nicht zulässig.
ru: Изменение заблокированного атрибута невозможно.
uk: Зміна заблокованого атрибуту неможлива.

source: Empty value is not allowed.
de: Ein leerer Wert ist nicht erlaubt.
ru: Пустое значение недопустимо.
uk: Порожнє значення недозволене.

source: Error of parameter ID.
de: Fehler der Parameter-ID.
ru: Ошибка ID параметра.
uk: Помилковий ID параметру.

source: Detected of the link recursion.
de: Von der Link-Rekursion erkannt.
ru: Обнаружено рекурсию связей.

source: Template configuration
de: Konfiguration der Vorlage
ru: Конфигурация шаблона
uk: Конфігурація шаблону

source: Show attributes
de: Attribute anzeigen
ru: Показать атрибуты
uk: Показати атрибути

source: Error, recursive linking.
de: Fehler, rekursives Verknüpfen.
ru: Ошибка, рекурсивное подключение.
uk: Помилка, рекурсивне підключення.

source: Error starting the template '%s'.
de: Fehler beim Starten der Vorlage '%s'.
ru: Ошибка запуска шаблона '%s'.
uk: Помилка запуску шаблону '%s'.

source: Error starting some templates.
de: Fehler beim Starten einiger Vorlagen.
ru: Ошибка запуска некоторых шаблонов.
uk: Помилка запуску деяких шаблонів.

source: Parameter templates library:
de: Bibliothek der Parametervorlagen:
ru: Библиотека шаблонов параметров:
uk: Бібліотека шаблонів параметрів:

source: Library
de: Bibliothek
ru: Библиотека
uk: Бібліотека

source: Library DB
de: Bibliothek DB
ru: БД библиотеки
uk: БД бібліотеки

source: Storage address in the format "{DB module}.{DB name}.{Table name}". To use the Generic Storage, set '*.*.{Table name}'.
ru: Адрес хранилища в формате "{Модуль БД}.{Имя БД}.{Имя Таблицы}". Установить '*.*.{Имя Таблицы}' для использования Общего Хранилища.

source: Parameter templates
de: Parametervorlagen
ru: Шаблоны параметров
uk: Шаблони параметрів

source: Templates
de: Vorlagen
ru: Шаблоны
uk: Шаблони

source: =============== Subsystem "Transport Protocols" options =================
de: ============== Optionen des Subsystems "TransportProtokolle" ================
ru: ============== Опции подсистемы "Транспортные Протоколы" ================
uk: =============== Опції підсистеми "Транспортні Протоколи" ================

source: Full name
de: Voller Name
ru: Полное имя
uk: Повне ім'я

source: Password
de: Kennwort
ru: Пароль
uk: Пароль

source: Language
de: Sprache
ru: Язык
uk: Мова

source: User picture
de: Bild des Benutzers
ru: Изображение пользователя
uk: Картинка користувача

source: Users
de: Benutzer
ru: Пользователи
uk: Користувачі

source: System user removal is not possible.
de: Systembenutzerentfernung ist nicht möglich.
ru: Удаление системного пользователя недопустимо.
uk: Видалення системного користувача неможливе.

source: System group removal is not possible.
de: Systemgruppenentfernung ist nicht möglich.
ru: Удаление системной группы недопустимо.
uk: Видалення системної групи неможливе.

source: Error finding and creating new users.
de: Fehler beim Suchen und Erstellen neuer Benutzer.
ru: Ошибка поиска и создания новых пользователей.
uk: Помилка пошуку та створення нових користувачів.

source: Error finding and creating new user groups.
de: Fehler beim Suchen und Erstellen neuer Benutzergruppen.
ru: Ошибка поиска и создания новых групп пользователей.
uk: Помилка пошуку та створення нових груп користувачів.

source: Administrator
ru: Администратор

source: Simple user
ru: Простой пользователь

source: Administrators group
ru: Группа администраторов

source: Users group
ru: Группа пользователей

source: ======================= Subsystem "Security" options ====================
de: ================== Optionen des Subsystems "Sicherheit" =================
ru: ==================== Опции подсистемы "Безопасности" ====================
uk: ======================== Опції підсистеми "Безпеки" =====================

source: User
de: Benutzer
ru: Пользователь
uk: Користувач

source: Group
de: Gruppe
ru: Группа
uk: Група

source: Users and groups
de: Benutzer und Gruppen
ru: Пользователи и группы пользователей
uk: Користувачі та групи користувачів

source: Groups
de: Gruppen
ru: Группы
uk: Групи

source: Error crypt_r(): %s (%d)
de: Fehler crypt_r(): %s (%d)
ru: Ошибка crypt_r(): %s (%d)
uk: Помилка crypt_r(): %s (%d)

source: Error crypt(): %s (%d)
de: Fehler crypt(): %s (%d)
ru: Ошибка crypt(): %s (%d)
uk: Помилка crypt(): %s (%d)

source: User
de: Benutzer:
ru: Пользователь
uk: Користувач:

source: Include
de: Eingeschlossen
ru: Включен
uk: Включено до

source: User DB
de: Datenbank des Benutzers
ru: БД пользователя
uk: БД користувача

source: Group
de: Gruppe
ru: Группа
uk: Група

source: User group DB
de: Datenbank der Benutzergruppe
ru: БД группы пользователей
uk: БД групи користувачів

source: ======================= Subsystem "Specials" options =====================
de: ===================== Optionen des Subsystems "Zusatz" ====================
ru: ===================== Опции подсистемы "Специальные" ====================
uk: ====================== Опції підсистеми "Спеціальні" ====================

source: Special
de: Zusatz
ru: Специальный
uk: Спеціальний

source: Subsystem is not modular!
de: Das Subsystem ist nicht modular!
ru: Подсистема не модульная!
uk: Підсистема не модульна!

source: Module '%s' connecting.
de: Modul '%s' Verbindung.
ru: Подключение модуля '%s'.
uk: Під'єднання модуля '%s'.

source: Module '%s' disconnecting.
de: Modul '%s' wird getrennt.
ru: Отключение модуля '%s'.
uk: Від'єднання модуля '%s'.

source: Subsystem starting.
de: Subsystem startet.
ru: Пуск подсистемы.
uk: Запуск підсистеми.

source: Error starting the module '%s'.
de: Fehler beim Starten des Moduls '%s'.
ru: Ошибка запуска модуля '%s'.
uk: Помилка запуску модуля '%s'.

source: Subsystem stopping.
de: Subsystem stoppt.
ru: Останов подсистемы.
uk: Зупинка підсистеми.

source: Error stopping the module '%s'.
de: Fehler beim Stoppen des Moduls '%s'.
ru: Ошибка останова модуля '%s'.
uk: Помилка зупинки модуля '%s'.

source: Subsystem:
ru: Подсистема:
uk: Підсистема:

source: Initial Station
de: Anfangsstation
ru: Первичная станция
uk: Первинна станція

source: Error changing working directory in '%s': %s. Perhaps the current directory is already correctly set to %s'.
de: Fehler der Veränderung der Arbeitsdirectory in '%s': %s. Wahrscheinlich ist die laufende Directory schon korrekt installiert in '%s'.
ru: Ошибка изменения рабочей директории в '%s': %s. Возможно текущая директория уже корректно установлена в '%s'.
uk: Помилка зміни робочої директорії у '%s': %s. Можливо поточну директорію вже коректно встановлено у %s'.

source: Read-only access to file '%s'.
de: Read-only Zugriff auf Datei '%s'.
ru: Доступ только на чтение к файлу '%s'.
uk: Доступ тільки на читання до файлу '%s'.

source: day
de: Tag
ru: день
uk: день

source: hour
de: Zeit
ru: час
uk: год

source: min
ru: мин
uk: хвил

source: s
ru: с
uk: с

source: ms
ru: мс
uk: мс

source: us
ru: мкс
uk: мкс

source: ns
ru: нс
uk: нс

source: YiB
ru: ЙиБ
uk: ЙіБ

source: ZiB
ru: ЗиБ
uk: ЗіБ

source: EiB
ru: ЭиБ
uk: ЕіБ

source: PiB
ru: ПиБ
uk: ПіБ

source: TiB
ru: ТиБ
uk: ТіБ

source: GiB
ru: ГиБ
uk: ГіБ

source: MiB
ru: МиБ
uk: МіБ

source: KiB
ru: КиБ
uk: КіБ

source: B
ru: Б
uk: Б
