Repository: aleax/openscada
Catalog: src/po/*.po
Languages: de, ru, uk

source: Error opening the semaphore!
de: Fehler beim Öffnen des Semaphors!
ru: Ошибка открытия семафора!
uk: Помилка відкриття семафору!

source: The resource tries to tightly block the thread!
de: Die Ressource versucht den Thread fest zu blockieren!
ru: Ресурс пытается намертво заблокировать поток!
uk: Ресурс намагається намертво заблокувати нитку!

source: Resource is timeouted!
de: Wartezeit der Ressource ist aus
ru: Время ожидания ресурса исчерпано!
uk: Час очікування ресурсу вичерпано!

source: Identifier
de: Identifikator
ru: Идентификатор
uk: Ідентифікатор

source: Module(plugin) name
de: Name des Moduls (plugin)
ru: Имя модуля(плагина)
uk: Ім'я модуля(плагіна)

source: Name
ru: Имя
uk: Ім'я

source: Description
de: Beschreibung
ru: Описание
uk: Опис

source: To start
de: Starten
ru: Запускать
uk: Запускати

source: Messages categories
de: Nachrichtenkategorien
ru: Категории сообщений
uk: Категорії повідомлень

source: Messages level
de: Nachrichtenstufe
ru: Уровень сообщений
uk: Рівень повідомлень

source: Debug (0);Information (1[X]);Notice (2[X]);Warning (3[X]);Error (4[X]);Critical (5[X]);Alert (6[X]);Emergency (7[X])
ru: Отладка (0);Информация (1[X]);Замечание (2[X]);Предупреждение (3[X]);Ошибка (4[X]);Критически (5[X]);Тревога (6[X]);Авария (7[X])

source: Address
de: Adresse
ru: Адрес
uk: Адреса

source: Redundant
de: Überflüssig
ru: Резервирование
uk: Резервування

source: Preferable run
de: Prioritätsstufe
ru: Предпочтение исполнения
uk: Уподобання виконання

source: Period of the values, seconds
de: Zeitraum der Werte, Sekunden
ru: Период значений, секунд
uk: Період значень, секунд

source: Period of the archiving, seconds
de: Zeitintervall für die Archivierung, Sekunden
ru: Период архивирования, секунд
uk: Період архівування, секунд

source: Selection priority
de: Auswahl Priorität
ru: Приоритет выбора
uk: Пріоритет обрання

source: Source
de: Quelle
ru: Источник
uk: Джерело

source: Data combining mode
de: Modus der Assoziation Daten
ru: Режим объединения данных
uk: Режим поєднання даних

source: Moving average;Single;Minimum;Maximum
de: Gleitender Durchschnitt;Einer;Minimum;Maximum
ru: Скользящее среднее;Один;Минимум;Максимум
uk: Ковзне середне;Один;Мінімум;Максимум

source: Value type
de: Datentyp der Werte
ru: Тип значений
uk: Тип значення

source: Boolean;Integer;Real;String;Int16;Int32;Int64;Real(Float);Real(Double)
de: Logisch;Ganzzahl;Reelle Zahl;Linie;Ganzzahl16;Ganzzahl32;Ganzzahl64;Reelle(Float);Reelle(Double)
ru: Логическое;Целое;Вещественное;Строка;Целое16;Целое32;Целое64;Вещ.(Float);Вещ.(Double)
uk: Логічне;Ціле;Реальне;Рядок;Ціле16;Ціле32;Ціле64;Реальне(Float);Реальне(Double)

source: Buffer period, seconds
de: Zeitintervall für Speicherung, Sekunden
ru: Период буфера, секунд
uk: Період буфера, секунд

source: Buffer size, items
de: Speichergrösse, einheiten
ru: Размер буфера, единиц
uk: Розмір буферу, одиниць

source: Buffer in the hard time grid
de: Puffer im harten Zeitraster
ru: Жесткая сетка времени буфера
uk: Жорстка сітка часу буфера

source: Buffer in the high time resolution
de: Puffer in der hohen Zeitauflösung
ru: Высокое разрешение времени буфера
uk: Висока роздільна здатність часу буфера

source: Filling the passage points with the last value
de: Füllen der Durchgangspunkte mit dem letzten Wert
ru: Заполнение проходных точек последним значением
uk: Заповнення прохідних точок останнім значенням

source: Process into archivers
de: In Archiver verarbeiten
ru: Обработка архиваторами
uk: Обслуговування архіваторами

source: Error loading the message archivers.
de: Nachrichtenarchivierer laden Fehler.
ru: Ошибка загрузки архиваторов сообщений.
uk: Помилка завантаження архіваторів повідомлень.

source: Error loading the value archivers.
de: Value-Archivierer laden Fehler.
ru: Ошибка загрузки архиваторов значений.
uk: Помилка завантаження архіваторів значень.

source: Value archives load error.
de: Fehler beim Laden des Wertearchivs.
ru: Ошибка загрузки архивов значений.
uk: Помилка завантаження архівів значень.

source: ======================== Subsystem "Archives-History" options =================== ------ Parameters of the section '%s' of the configuration file ------ MessBufSize <items> Size of the messages buffer. MessPeriod <seconds> Period of the messages archiving. ValPeriod <mseconds> Period of active archiving of values. ValPriority <level> Level of priority of the task of active archiving of values. RdRestDtOverTm <days> Depth of the forced overloading of the reserve history at startup, in days.
de: ==================== Optionen des Subsystems "Archiv-Geschichte" ====================== ---------- Parameter des Abschnitts '%s' der Konfigurationsdatei ---------- MessBufSize <items> Größe des Nachrichtenpuffers. MessPeriod <Sekunden> Zeitraum der Nachrichtenarchivierung. ValPeriod <mSekunden> Zeitraum der aktiven Archivierung von Werten. ValPriority <level> Prioritätsstufe der Aufgabe der aktiven Archivierung von Werten. RdRestDtOverTm <Tage> Tiefe der erzwungenen Überlastung der Reservehistorie beim Start in Tagen.
ru: ==================== Опции подсистемы "Архивы-История" ====================== ---------- Параметры секции '%s' конфигурационного файла ---------- MessBufSize <ед.> Размер буфера сообщений. MessPeriod <секунд> Период архивирования сообщений. ValPeriod <мсекунд> Период активного архивирования значений. ValPriority <уровень> Уровень приоритета задачи активного архивирования значений. RdRestDtOverTm <дней> Глубина принудительной перезагрузки истории резерва при запуске, в днях.
uk: ====================== Опції підсистеми "Архіви-Історія" ======================== ---------- Параметри секції '%s' конфігураційного файлу ---------- MessBufSize <од.> Розмір буферу повідомлень. MessPeriod <секунд> Період архівування повідомлень. ValPeriod <мсекунд> Період активного архівування значень. ValPriority <рівень> Рівень пріоритету задачі активного архівування значень. RdRestDtOverTm <днів> Глибина примусового перевантаження історії резерву при запуску, у днях.

source: Start/update subsystem.
de: Subsystems starten/aktualisierung.
ru: Пуск/обновление подсистемы.
uk: Запуск/оновлення підсистеми.

source: Error starting the message archiver '%s'.
de: Nachrichtenarchivierer '%s' startet Fehler.
ru: Ошибка запуска архиватора сообщений '%s'.
uk: Помилка запуску архіватору повідомлень '%s'.

source: Error starting the value archiver '%s'.
de: Wertarchivierer '%s' startet Fehler.
ru: Ошибка запуска архиватора значений '%s'.
uk: Помилка запуску архіватору значень '%s'.

source: Error starting the value archive '%s'.
de: Fehler beim Starten des Wertearchivs '%s'.
ru: Ошибка запуска архива значений '%s'.
uk: Помилка запуску архіву значень '%s'.

source: Error stopping the value archiver '%s'.
de: Fehler beim Anhalten des Wertarchivierer '%s'.
ru: Ошибка останова архиватора значений '%s'.
uk: Помилка зупинки архіватору значень '%s'.

source: Error stopping the message archiver '%s'.
de: Fehler beim Anhalten des Nachrichtenarchivierer '%s'.
ru: Ошибка останова архиватора сообщений '%s'.
uk: Помилка зупинки архіватору повідомлень '%s'.

source: Value archive '%s' stop error.
de: Fehler beim Anhalten des Wertearchivs '%s'.
ru: Ошибка останова архива значений '%s'.
uk: Помилка зупинки архіву значень '%s'.

source: Put message to the archiver '%s' error: %s
de: Kleide Mitteilung an den Archivierungs '%s' Fehler: %s
ru: Ошибка записи сообщения в архиватор '%s': %s
uk: Помилка запису повідомлення до архіватору '%s': %s

source: Message buffer process error.
de: Meldepuffer Prozessfehler.
ru: Ошибка обработки буфера сообщений.
uk: Помилка опрацювання буферу повідомлень.

source: Value archive
de: Wertearchiv
ru: Архив значений
uk: Архів значень

source: Redundancy
de: Redundanz
ru: Резервирование
uk: Резервування

source: Overtime of the reserve history reload at start, days
de: Überstunden der Reserve Geschichte reload beim Start, Tage
ru: Глубина принудительной перезагрузки истории резерва при запуске, в сутках.
uk: Глибина примусового перевантаження історії резерву при запуску, в добах.

source: Message archivers
de: Nachrichtenarchivierer
ru: Архиваторы сообщений
uk: Архіватори повідомлень

source: Archiver
ru: Архиватор
uk: Архіватор

source: Run.
de: Akt.
ru: Исполн.
uk: Викон.

source: Redund.
de: Überfl.
ru: Резерв.
uk: Резерв.

source: Pref. to run
de: Prior. Stufe
ru: Предп. исп.
uk: Уподоб. вик.

source: Remote
de: Gelöscht
ru: Удалённый
uk: Віддалений

source: Messages
de: Nachrichten
ru: Сообщения
uk: Повідомлення

source: Buffer size
de: Speichergrösse
ru: Размер буфера
uk: Розмір буферу

source: Archiving period, seconds
de: Archivierungsperiode, Sekunden
ru: Период архивирования, секунд
uk: Період архівування, секунд

source: View
de: Ansicht
ru: Просмотр
uk: Перегляд

source: Time, size (seconds) and level
de: Zeit, Größe (Sekunden) und Niveau
ru: Время, размер (секунд) и уровень
uk: Час, розмір (секунд) та рівень

source: Debug (0);Information (1[X]);Notice (2[X]);Warning (3[X]);Error (4[X]);Critical (5[X]);Alert (6[X]);Emergency (7[X]);Information (1[X]), ALARMS;Notice (2[X]), ALARMS;Warning (3[X]), ALARMS;Error (4[X]), ALARMS;Critical (5[X]), ALARMS;Alert (6[X]), ALARMS;Emergency (7[X]), ALARMS
ru: Отладка (0);Информация (1[X]);Замечание (2[X]);Предупреждение (3[X]);Ошибка (4[X]);Критически (5[X]);Тревога (6[X]);Авария (7[X]);Информация (1[X]), НАРУШЕНИЯ;Замечание (2[X]), НАРУШЕНИЯ;Предупреждение (3[X]), НАРУШЕНИЯ;Ошибка (4[X]), НАРУШЕНИЯ;Критически (5[X]), НАРУШЕНИЯ;Тревога (6[X]), НАРУШЕНИЯ;Авария (7[X]), НАРУШЕНИЯ

source: Receiving messages with a level greater or equal to the specified.
de: Empfangen von Nachrichten mit einem Level größer oder gleich dem angegebenen.
ru: Получение сообщений уровнем больше или равно указанному.
uk: Отримання повідомлень з рівнем більш або дорівнює вказаному.

source: Category pattern
de: Kategoriemuster
ru: Шаблон категории
uk: Шаблон категорії

source: Archivers
de: Archiver
ru: Архиваторы
uk: Архіватори

source: Message archivers. Do not set the field for processing the request by the buffer and all archivers. Set '<buffer>' for processing by the buffer.
de: Nachrichtenarchivierer. Setzen Sie das Feld für die Verarbeitung der Anforderung nicht durch den Puffer und alle Archivierer. Setzen Sie '<buffer>' für die Verarbeitung durch den Puffer.
ru: Архиваторы сообщений. Не указывайте архиваторы для обработки запроса буфером и всеми архиваторами. Установите '<buffer>' для обработки запроса буфером.
uk: Архіватори повідомлень. Не встановлюйте поле для обробки запиту буфером та всіма архіваторами. Встановіть '<buffer>' для обробки запиту буфером.

source: Time
de: Zeit
ru: Время
uk: Час

source: mcsec
de: mks
ru: мкс
uk: мкс

source: Category
de: Kategorie
ru: Категория
uk: Категорія

source: Level
de: Stufe
ru: Уровень
uk: Рівень

source: Message
de: Nachricht
ru: Сообщение
uk: Повідомлення

source: Clear visible violations
de: Sichtbare Verstöße löschen
ru: Очистить видимые нарушения
uk: Очистити видимі порушення

source: Values
de: Werte
ru: Значения
uk: Значення

source: Period of the data receiving, milliseconds
de: Zeitraum des Datenempfangs, Millisekunden
ru: Период получения данных, миллисекунд
uk: Період отримання даних, мілісекунд

source: Level of priority of the data receiving task
de: Prioritätsstufe der Datenempfangsaufgabe
ru: Уровень приоритета задачи получения данных
uk: Рівень пріоритету задачі отримання даних

source: Forced to set timestampes in the current time
de: Gezwungen, Zeitstempel in der aktuellen Zeit festzulegen
ru: Принудительно устанавливать метку времени в текущее время
uk: Примусово встановлювати мітку часу у поточний час

source: Mode of forming ID of the automatic created archives
de: Art der Bildung der ID der automatisch erstellten Archive
ru: Режим формирования ID автоматически создаваемых архивов
uk: Режим формування ID атрибуту автоматично створюваних архівів

source: Both parameter and attribute ID;Only parameter ID;Only attribute ID;All controller, parameter and attribute ID
de: Beide Parameter und ID-Attribut;Nur ID-Parameter;Nur ID-Attribut;Alle Controller, Parameter und Attribut-ID
ru: Оба ID параметра и атрибута;Только ID параметра;Только ID атрибута;Все ID контроллера, параметра и атрибута
uk: Обидва ID параметру та атрибуту;Тільки ID параметру;Тільки ID атрибуту;Всі ID контролеру, параметру та атрибуту

source: Number
de: Anzahl
ru: Количество
uk: Кількість

source: Value archives
de: Wertearchive
ru: Архивы значений
uk: Архіви значень

source: All: %d; Enabled: %d
de: Insgesamt: %d; Eingeschaltet: %d
ru: Всего: %d; Включено: %d
uk: Разом: %d; Ввімкнено: %d

source: <High level>
de: <Hohes Niveau>
ru: <Высокий уровень>
uk: <Високий рівень>

source: <Low level>
de: <Niedriges Niveau>
ru: <Низкий уровень>
uk: <Низький рівень>

source: <Optimal>
ru: <Оптимально>
uk: <Оптимально>

source: Message archiver
de: Nachrichtenarchivierer
ru: Архиватор сообщений
uk: Архіватор повідомлень

source: Value archiver
de: Wertarchivierer
ru: Архиватор значений
uk: Архіватор значень

source: Value archivers
de: Wert Archivierer
ru: Архиваторы значений
uk: Архіватори значень

source: Message archiver:
de: Nachrichtenarchivierer:
ru: Архиватор сообщений:
uk: Архіватор повідомлень:

source: State
de: Zustand
ru: Состояние
uk: Стан

source: Running
de: Am Laufen
ru: Выполняется
uk: Виконується

source: Archiver DB
ru: БД архиватора
uk: БД архіватору

source: Remove from '%s'
ru: Удалить из '%s'

source: End
de: Ende
ru: Конец
uk: Кінець

source: Begin
de: Beginn
ru: Начало
uk: Початок

source: Configuration
de: Konfiguration
ru: Конфигурация
uk: Конфігурація

source: Requested %d records for time %s.
de: Fordert %d Datensätze für Zeit %s.
ru: Запрошено %d записей в течении %s.
uk: Запитано %d записів протягом %s.

source: The grid mode doesn't support inserting too old values %lld (%lld-%lld).
de: Gittermodus unterstützt nicht das Einfügen sehr alter Werte %lld (%lld-%lld).
ru: Режим привязки к сетке не поддерживает вставку очень старых значений %lld (%lld-%lld).
uk: Не підтримується вставка дуже старих повідомлень у режимі прив'язки до сітки %lld (%lld-%lld).

source: The grid mode doesn't support inserting too old values.
de: Gittermodus unterstützt nicht das Einfügen alter Werte.
ru: Режим привязки к сетке не поддерживает вставку очень старых значений.
uk: Режим прив'язки до сітки не підтримує вставки дуже старих значень.

source: Inserting too old values to the buffer.
de: Fügen Sie einen sehr alten Wert in den Puffer ein.
ru: Вставка очень старых значений в буфер.
uk: Вставка дуже старого значення до буфера.

source: Error connecting to source '%s'.
de: Fehler beim Verbinden mit der Quelle '%s'.
ru: Ошибка подключения к источнику '%s'.
uk: Помилка підключення до джерела '%s'.

source: Archive '%s' is already connected to the target parameter '%s'.
de: Archiv '%s' ist bereits auf die Zielparameter '%s' verbunden.
ru: Архив '%s' уже подключен к целевому параметру '%s'.
uk: Архів '%s' вже підключено до цільового параметру '%s'.

source: gdImageStringFT error for font '%s': %s.
de: gdImageStringFT Fehler für die Schriftart '%s': %s.
ru: gdImageStringFT ошибка для шрифта '%s': %s.
uk: gdImageStringFT помилка для шрифту '%s': %s.

source: %ds
de: %dс
ru: %dс
uk: %dс

source: %gs
de: %gc
ru: %gс
uk: %gс

source: %gms
de: %gмс
ru: %gмс
uk: %gмс

source: Range error
de: Fehler des Bereichs
ru: Ошибка диапазона
uk: Помилка діапазону

source: Data mode '%d' is not supported
de: Der Datenmodus '%d' wird nicht unterstützt
ru: Не поддерживается режим данных '%d'
uk: Режим даних '%d' не підтримується

source: Binary mode is not supported for strings data
de: Binärer Modus für Textdaten wird nicht unterstützt
ru: Бинарный режим не поддерживается для строковых данных
uk: Бінарний режим не підтримується для строкових даних

source: Value archive:
de: Wertearchiv:
ru: Архив значений:
uk: Архів значень:

source: Archive
de: Archiv
ru: Архив
uk: Архів

source: Buffer end
de: Buffersende
ru: Конец буфера
uk: Кінець буферу

source: Buffer begin
de: Buffersbeginn
ru: Начало буфера
uk: Початок буферу

source: Archive DB
de: Archiv Datenbank
ru: БД архива
uk: БД архіву

source: The size of the buffer of values should be large enough for the periodicity of the archivers. By default, this value is automatically configured for periodicity of the values of this archive and periodicity of archivers in 60 seconds.
de: Die Größe des Wertepuffers sollte groß genug für die Periodizität der Archivierer sein. Standardmäßig wird dieser Wert automatisch für die Periodizität der Werte dieses Archivs und die Periodizität der Archiver in 60 Sekunden konfiguriert.
ru: Размер буфера значений должен быть достаточно большим для периодичности архиваторов. Типично это значение автоматически настраивается на периодичность значений этого архива и периодичность архиваторов в 60 секунд.
uk: Розмір буферу значень має бути достатньо великим для періодичності архіваторів. Типово це значення автоматично налаштовується на періодичність значень цього архіву та періодичність архіваторів у 60 секунд.

source: Default for fast processing of archiving values.
de: Standard für die schnelle Verarbeitung von Archivierungswerten.
ru: Типично для быстрой обработки архивации значений.
uk: Типово для швидкої обробки архівації значень.

source: Set in case of periodicity of values in less than a second.
de: Im Falle der Periodizität der Werte in weniger als einer Sekunde eingestellt.
ru: Установить в случае периодичности значений менее секунды.
uk: Встановити у випадку періодичності значень менше за секунду.

source: The passage values mostly fill by EVAL but sometime data periodicity of the source greater to the archive's one and it is normal.
de: Die Passage-Werte füllen sich meistens mit EVAL, aber manchmal ist die Periodizität der Daten der Quelle größer als die des Archivs und normal.
ru: В основном проходные значения заполняются EVAL однако иногда периодичность значений источника больше периодичности этого архива и это нормально.
uk: Переважно прохідні значення заповнюються EVAL однак інколи періодичність значень джерела більша за періодичність цього архіву та це нормально.

source: Processing
de: Verarbeitung
ru: Обработка
uk: Обробка

source: Period, seconds
de: Periode, Sekunden
ru: Период, секунд
uk: Період, секунд

source: Microseconds
de: Mikrosekunden
ru: Микросекунды
uk: Мікросекунди

source: Size, seconds
de: Größe, Sekunden
ru: Размер, секунд
uk: Розмір, секунд

source: Values archiver. If the value is empty, the request will be processed for the buffer and for all archivers. If "<buffer>" is specified then the request will be processed only for the archive buffer.
de: Werte archivieren. Wenn der Wert leer ist, wird die Anforderung für den Puffer und für alle Archivierer verarbeitet. Wenn "<buffer>" angegeben ist, wird die Anfrage nur für den Archivpuffer verarbeitet.
ru: Архиватор значений. Если значение отсутствует то запрос будет обработан для буфера и всех архиваторов. Если указано "<buffer>", то запрос будет обработан только для буфера архива.
uk: Архіватор значень. Якщо значення відсутнє то запит буде оброблено для буферу та всіх архіваторів. Якщо вказано "<buffer>", то запит буде оброблено тільки для буферу архіву.

source: Show trend
de: Trend zeigen
ru: Показать график
uk: Показати графік

source: Table of the values
de: Tabelle der Werte
ru: Таблица значений
uk: Таблиця значень

source: Value
de: Wert
ru: Значение
uk: Значення

source: Image size
de: Bildgröße
ru: Размер изображения
uk: Розмір зображення

source: Image width in pixels.
de: Bildbreite in Pixel.
ru: Ширина изображения в пикселах.
uk: Ширина зображення у пікселях.

source: Image height in pixels.
de: Bildhöhe in Pixeln.
ru: Высота изображения в пикселах.
uk: Висота зображення у пікселях.

source: Scale of the values
de: Skalierung der Werte
ru: Шкала значений
uk: Шкала значень

source: Image minimum value.
de: Mindestbildwert.
ru: Минимальное значение изображения.
uk: Мінімальне значення зображення.

source: Image maximum value.
de: Maximaler Bildwert.
ru: Максимальное значение изображения.
uk: Максимальне значення зображення.

source: Trend of the values
de: Trend der Werte
ru: График значений
uk: Графік значень

source: Value archiver:
de: Wertarchivierer:
ru: Архиватор значений:
uk: Архіватор значень:

source: Archiving time
de: Archivierungszeit
ru: Время архивирования
uk: Час архівування

source: Set a zero period to disable the use of the archiver in processing the buffer - just a direct recording.
de: Legen Sie eine Nullperiode fest, um die Verwendung des Archivers bei der Verarbeitung des Puffers zu deaktivieren - nur eine direkte Aufzeichnung.
ru: Установить нулевой период для отключения использования архиватора в обработке буфера - только прямая запись.
uk: Встановити нульовий період для відключення використання архіватору у обробці буферу - тільки прямий запис.

source: Selection of a priority of the archiver for using in the source mode "All". Set to zero for full the selection disabling.
de: Auswahl einer Priorität des Archivers zur Verwendung im Quellmodus "Alle". Setzen Sie die Auswahl auf Null, um die Auswahl zu deaktivieren.
ru: Приоритет выбора архиватора для режима использования источника "Все". Установить в нуль для полного исключения из выбора.
uk: Пріоритет обрання архіватору для режиму використання джерела "Всі". Встановити у нуль для повного виключення із обрання.

source: Archives
de: Aufzeichnungen
ru: Архивы
uk: Архіви

source: Last read buffer
de: Letzte Lesepuffer
ru: Последнее чтение буфера
uk: Останнє читання буферу

source: DB type (module)
de: Typ der Datenbank (Modul)
ru: Тип БД (модуль)
uk: Тип БД (модуль)

source: Code page
de: Unicode Zeichensatz
ru: Кодовая страница
uk: Кодова сторінка

source: To enable
de: Aktivieren
ru: Включать
uk: Вмикати

source: Priority in list
ru: Приоритет в списке

source: Transaction closing: after opening, seconds
de: Transaktionsabschluss: nach dem Öffnen, Sekunden
ru: Закрытие транзакции: после открытия, секунд
uk: Закриття транзакції: після відкриття, секунд

source: Transaction closing: after request, seconds
de: Transaktionsabschluss: nach Aufforderung, Sekunden
ru: Закрытие транзакции: после запроса, секунд
uk: Закриття транзакції: після запиту, секунд

source: Transaction closing: separate task priority
de: Transaktionsabschluss: separate Aufgabenpriorität
ru: Закрытие транзакции: приоритет отдельной задачи
uk: Закриття транзакції: пріоритет окремої задачі

source: Error closing database '%s'!
de: Fehler beim Schliessen der Datenbank '%s'!
ru: Ошибка закрытия БД '%s'!
uk: Помилка закриття БД '%s'!

source: The requested entry is missing.
de: Der angeforderte Eintrag fehlt.
ru: Запрошенная запись отсутствует.
uk: Запитаний запис відсутній.

source: Error writing to DB or configuration file.
de: Schreiben Reihe zum DB-oder Konfigurationsfehler.
ru: Ошибка записи в БД или конфигурационный файл.
uk: Помилка запису до БД або конфігураційного файлу.

source: Value ID
de: ID des Werts
ru: ID значения
uk: ID значення

source: ========================= Subsystem "DB" options ======================== ------ Parameters of the section '%s' of the configuration file ------ TblLifeTime <seconds> Opened tables lifetime (by default 600 seconds).
ru: ========================= Опции подсистемы "БД" ========================= ---------- Параметры секции '%s' конфигурационного файла ---------- TblLifeTime <секунд> Время жизни открытых таблиц (по умолчанию 600 секунд).

source: Error finding and opening a new database.
de: Fehler beim Suchen und Öffnen einer neuen Datenbank.
ru: Ошибка поиска и открытия новой БД.
uk: Помилка пошуку та відкриття нової БД.

source: Subsystem
ru: Подсистема
uk: Підсистема

source: Opened tables lifetime, seconds
de: Lebensdauer geöffneter Tabellen, Sekunden
ru: Время жизни открытых таблиц, секунд
uk: Час життя відкритих таблиць, секунд
