Repository: aleax/openscada
Catalog: src/po/*.po
Languages: de, ru, uk

source: *************************************************************************** ********** %s v%s (%s-%s). ********* *************************************************************************** =========================================================================== ==================== Generic options ====================================== =========================================================================== -h, --help This help text about the program command-line options and configuration file parameters. --projName=<name> OpenSCADA project name to switch it. For this feature there also uses an environment variable "OSCADA_ProjName" and the program binary name "openscada_{ProjName}". --projUserDir={dir} Directory of user projects (writeable) of OpenSCADA, "~/.openscada" by default. --projLock={per} Uses the projects locking by creation the "lock" file into the project folder and update it in the period <per>, by default it is enabled and the updating period <per> is 60 seconds. To disable set the updating period <per> to zero. --lang=<LANG> Station language, in the view "en_US.UTF-8". --config=<file> Station configuration file. --station=<id> Station identifier. --statName=<name> Station name. --modDir=<path> Directories with the modules, separated by ';', they can include a files' template at the end. --messLev=<level> Level of the processing messages (0-7). --log=<direct> Direct messages to, by the bitfield: 0x1 - syslogd; 0x2 - stdout; 0x4 - stderr; 0x8 - the messages archive. --consoleCharSet={CharSet} Forcing to the console <CharSet> for the console messages, by default it is system one. --demon, --daemon Run in the daemon mode. --pidFile=<file> File for the program process ID placing here. --noCoreDump Prevents from the core dump creation at crashes - don't set the limit to the unlimited value. --permCrtFiles={perm} Permissions of the created OpenSCADA files, by default it is 0755 (RWXRW_RW_). ----------- Station '%s(%s)' settings in the configuration file ----------- StName <nm> Station name. WorkDB <Type.Name> Working DB (<type> and <name>). WorkDir <path> Working directory. ModDir <path> Directories with the modules, separated by ';', they can include a files' template at the end. IcoDir <path> Icons directory. DocDir <path> Documents directory. MessLev <level> Level of the processing messages (0-7). SelDebCats <list> Debug categories list, separated by ';'. LogTarget <direction> Direct messages to, by the bitfield: 0x1 - syslogd; 0x2 - stdout; 0x4 - stderr; 0x8 - the messages archive. Lang <lang> Station language-locale in the view "en_US.UTF-8". LangBase <lang> Base language and the project whole locales (like to "en_US.UTF-8") list (optional) separated by ';', for the multilanguage mode. MainCPUs <list> Main list of the using CPUs, separated by ':'. TaskInvPhs <n> Number of phases of the task invoking, 1 to disable the phasing. ClockRT <0|1> Sets the clock source to use to REALTIME (otherwise MONOTONIC), which is problematic one at the system clock modification. SaveAtExit <0|1> Save the program at exit. SavePeriod <seconds> Period of the program saving, 0 to disable. ModifCalc <0|1> Set modification for the calculated objects. RdStLevel <lev> Level of the redundancy of the current station. RdTaskPer <seconds> Call period of the redundancy task. RdRestConnTm <seconds> Time to restore connection to "dead" reserve station. RdStList <list> Redundant stations list, separated symbol ';' (st1;st2). RdPrimCmdTr <0|1> Enables the transmission of primary commands to the reserve stations. Global configurable limits: limObjID_SZ [*20..50] ID size of the OpenSCADA objects. WARNING! Big size can cause the key limit error on MySQL like DB! Change that once before use on DBs with the fixed type "char({N})"! limObjNm_SZ [*100...200] NAME size of the OpenSCADA objects. WARNING! Change that once before use on DBs with the fixed type "char({N})"! limArchID_SZ [*50...90] ID size of the value archive objects. WARNING! Increase it only, else you can get problems on Archive.FSArch! Change that once before use on DBs with the fixed type "char({N})"! limUserFile_SZ [1MB...*10MB...1000MB] The files size limit at loading and processing in the userspace and the part size of the big files transferring. limUserIts_N [1000...*1000000...1000000000] The limit on count of creating user items, like to array items. limCacheIts_N [*100...100000] The limit on count of the caching items. limCacheIts_TM [10...*60...1000] The limit on the caching items time, seconds. Global configurable parameters: prmStrBuf_SZ [1000...*10000...1000000] Length of string buffers, no string class. prmWait_DL [0.001...*0.1...1] Quantum of the waiting time cycles, seconds. prmWait_TM [*5...10] Standard waiting timeout length, seconds. prmInterf_TM [*7...15] Time of waiting for the interface reaction, seconds. prmServTask_PER [1...*10...120] Service task period, seconds.
ru: *************************************************************************** ********** %s %s (%s-%s). ********* *************************************************************************** =========================================================================== ======================= Основные опции ==================================== =========================================================================== -h, --help Этот текст помощи по опциям командной строки и параметрам конфигурационного файла программы. --projName=<имя> Имя проекта OpenSCADA для переключения. Для такой операции также используется переменная окружение "OSCADA_ProjName" и имя бинарной программы "openscada_{ProjName}". --projUserDir={дир.} Директория пользовательских проектов OpenSCADA (доступна для записи), по умолчанию "~/.openscada". --projLock={per} Использовать блокирование проектов созданием файла "lock" в директории проекта и его обновление с периодом <per>, по умолчанию включено и период обновления <per> составляет 60 секунд. Для отключения установить период обновления <per> в нуль. --lang=<LANG> Язык станции, в виде "ru_RU.UTF-8". --config=<файл> Конфигурационный файл станции. --station=<ид> Идентификатор станции. --statName=<имя> Имя станции. --modDir=<path> Директории модулей, разделённые ';', и в конце могут содержать шаблон файлов. --messLev=<уров> Уровень обрабатываемых сообщений (0-7). --log=<направл.> Направление сообщений в, по битовому полю: 0x1 - системный логер (syslogd); 0x2 - стандартный выход (stdout); 0x4 - стандартный выход ошибок (stderr); 0x8 - архив сообщений. --consoleCharSet={CharSet} Принудительно установить кодовый набор символов консоли в <CharSet>, по умолчанию он системный. --demon, --daemon Запуск в режиме демона. --pidFile=<файл> файл для помещения ID процесса программы сюда. --noCoreDump Предотвращать создание предсмертных дампов - не снимать это ограничение. --permCrtFiles={права} Права создаваемых OpenSCADA файлов, по умолчанию это 0755 (RWXRW_RW_). -------------- Параметры станции '%s(%s)' в конфигурационном файле ------------ StName <имя> Имя станции. WorkDB <Тип.Имя> Рабочая БД (тип и имя). WorkDir <path> Рабочая директория. ModDir <path> Директории модулей, разделённые ';', и в конце могут содержать шаблон файлов. IcoDir <path> Директория с иконками. DocDir <path> Директория с документами. MessLev <уровень> Уровень обрабатываемых сообщений (0-7). SelDebCats <список> Список категорий отладки, разделены ';'. LogTarget <направл.> Направление сообщений в, по битовому полю: 0x1 - системный логер (syslogd); 0x2 - стандартный выход (stdout); 0x4 - стандартный выход ошибок (stderr); 0x8 - архив сообщений. Lang <язык> Язык-локаль станции, в виде "ru_RU.UTF-8". LangBase <язык> Базовый язык и перечень всех локалей (вроде "ru_RU.UTF-8") проекта (опционально) разделённых ';', для многоязычного режима. MainCPUs <список> Основной перечень используемых процессоров, разделены ':'. TaskInvPhs <n> Количество фаз вызова задач, 1 для отключения фазирования. ClockRT <0|1> Установить использование источника часов в REALTIME (иначе MONOTONIC), несколько проблематичное при модификации системных часов. SaveAtExit <0|1> Сохранять программу при выходе. SavePeriod <секунд> Период сохранения программы, 0 для отключения. ModifCalc <0|1> Устанавливать модификацию для вычислительных объектов. RdStLevel <уров> Уровень резервирования текущей станции. RdTaskPer <секунд> Период вызова задачи обслуживания резервирования. RdRestConnTm <секунд> Время восстановления соединения с "мёртвой" резервной станцией. RdStList <список> Список резервных станций, разделённых символом ';' (st1;st2). RdPrimCmdTr <0|1> Включение транзита первичных команд на резервные станции. Глобальные конфигурируемые лимиты: limObjID_SZ [*20..50] Размер ИД объектов OpenSCADA. ВНИМАНИЕ! Большой размер может вызвать ошибку размера ключа на БД похожих на MySQL! Измените это только один раз перед использованием на БД с фиксированным типом "char({N})"! limObjNm_SZ [*100...200] Размер НАЗВАНИЯ объектов OpenSCADA. ВНИМАНИЕ! Измените это лишь один раз перед использованием на БД с фиксированным типом "char({N})"! limArchID_SZ [*50...90] Размер ИД объектов архива значений. ВНИМАНИЕ! Только увеличивайте его, иначе можете получить проблемы в Archive.FSArch! Измените это лишь один раз перед использованием на БД с фиксированным типом "char({N})"! limUserFile_SZ [1MB...*10MB...1000MB] Ограничение на размер файлов при загрузке и обработке в пространстве пользователя и размер частей передачи больших файлов. limUserIts_N [1000...*1000000...1000000000] Ограничение на количество создаваемых элементов пользователя, вроде элементов массивов. limCacheIts_N [*100...100000] Ограничение на количество элементов в кеше. limCacheIts_TM [10...*60...1000] Ограничение на время элементов в кеше, секунд. Глобальные конфигурируемые параметры: prmStrBuf_SZ [1000...*10000...1000000] Длина строковых буферов, не строковых классов. prmWait_DL [0.001...*0.1...1] Время кванта циклов ожидания, секунд. prmWait_TM [*5...10] Стандартный размер таймаута ожидания, секунд. prmInterf_TM [*7...15] Время ожидания реакции интерфейса, секунд. prmServTask_PER [1...*10...120] Период сервисной задачи, секунд.

source: Error the configuration file '%s': %s
de: Fehler in der Konfigurationsdatei '%s': %s
ru: Ошибка конфигурационного файла '%s': %s
uk: Помилка конфігураційного файлу '%s': %s

source: Error loading the configuration file '%s'.
de: Fehler beim Laden der Konfigurationsdatei '%s'.
ru: Ошибка загрузки конфигурационного файла '%s'.
uk: Помилка завантаження конфігураційного файлу '%s'.

source: Station '%s' is not in the configuration file. The configuration of the station '%s' has been used!
de: Station '%s' fehlt in der Konfigurationsdatei. Konfiguration der Station '%s' wird verwendet!
ru: Станция '%s' отсутствует в конфигурационном файле. Использована конфигурация станции '%s'!
uk: Станція '%s' відсутня у конфігураційному файлі. Використано конфігурацію станції '%s'!

source: Error configuration '%s'!
de: Konfigurationsfehler '%s'!
ru: Ошибка конфигурации '%s'!
uk: Помилка конфігурації '%s'!

source: Error writing the configuration file '%s': %s
de: Fehler beim Schreiben der Konfigurationsdatei '%s': %s
ru: Ошибка записи в конфигурационный файл '%s': %s
uk: Помилка запису до конфігураційного файлу '%s': %s

source: Impossible to hold the project lock! Seems the project '%s' already running.
de: Unmöglich, die Projektsperre zu halten! Scheint, dass das Projekt '%s' bereits läuft.
ru: Невозможно захватить замок проекта! Похоже проект '%s' уже исполняется.
uk: Неможливо захопити замок проекту! Схоже проект '%s' вже виконується.

source: Loading.
de: Laden.
ru: Загрузка.
uk: Завантаження.

source: No module has been loaded, your configuration is likely to be broken!
de: Kein Modul ist geladen. Ihre Konfiguration ist kaput
ru: Ни одного модуля не загружено. Ваша конфигурация сломана!
uk: Жодного модуля не завантажено, Вашу конфігурацію схоже зламано!

source: Error loading the subsystem '%s'.
de: Fehler beim Laden des Subsystems '%s'.
ru: Ошибка загрузки подсистемы '%s'.
uk: Помилка завантаження підсистеми '%s'.

source: Saving.
de: Speichern.
ru: Сохранение.
uk: Збереження.

source: Starting.
de: Starten.
ru: Запуск.
uk: Запуск.

source: Error starting the subsystem '%s'.
de: Fehler beim Starten des Subsystems '%s'.
ru: Ошибка запуска подсистемы '%s'.
uk: Помилка старту підсистеми '%s'.

source: Starting is completed!
de: Starten abgeschlossen ist!
ru: Запуск завершён!
uk: Запуск завершено!

source: waiting the processing finish ...
de: Warten auf die Verarbeitung beendet ...
ru: ожидание завершения обработки ...
uk: очікування завершення опрацювання ...

source: Stopping.
de: Stoppen.
ru: Останов.
uk: Зупинка.

source: Error stopping the subsystem '%s'.
de: Fehler beim Stoppen des Subsystems '%s'.
ru: Ошибка останова подсистемы '%s'.
uk: Помилка зупинки підсистеми '%s'.

source: Termination signal is received. Stopping the program!
de: Terminierungssignal wird empfangen. Programm anhalten!
ru: Получен сигнал прерывания. Остановка станции!
uk: Отримано сигнал переривання роботи. Зупинка програми!

source: Floating point exception is caught!
de: Fehler bei Fliesskommaoperation abgefangen!
ru: Исключение операции с плавающей точкой!
uk: Виключення операції з плаваючою крапкою!

source: Close the process %d of the child!
de: Schließen Sie den Prozess %d des Kindes!
ru: Закрытие дочернего процесса %d!
uk: Закриття процесу нащадка %d!

source: Segmentation fault signal!
de: Fehler Speichersegmentierung!
ru: Сигнал нарушения сегментации памяти!
uk: Сигнал помилки сегментації пам'яті!

source: Program aborted!
de: Programmabbruch!
ru: Программа прервана!
uk: Програму перевано!

source: Unknown signal %d!
de: Unbekanntes Signal %d!
ru: Неизвестный сигнал %d!
uk: Невідомий сигнал %d!

source: Timeouted !!!
de: Zeitüberschreitung !!!
ru: Превышение времени ожидания !!!
uk: Час очікування вичерпано!!!

source: Waiting for event ...
de: Warten auf ein Ereignis ...
ru: Ожидание события...
uk: Очікування повідомлення...

source: Task '%s' is already present!
de: Task '%s' ist bereits vorhanden!
ru: Задача '%s' уже присутствует!
uk: Завдання '%s' вже присутнє!

source: There is no access to create a real-time task for '%s'. An ordinal task is created!
de: Es ist nicht möglich, eine Echtzeitaufgabe für '%s' zu erstellen. Eine ordinale Aufgabe wird erstellt!
ru: Нет доступа для создания политики реального времени для '%s'. Создан обычный поток!
uk: Немає доступу для створення задачі у політиці реального часу для '%s'. Створено звичайну задачу!

source: Error %d creation a task.
de: Fehler %d beim Erstellen einer Aufgabe.
ru: Ошибка создания задачи %d.
uk: Помилка створення задачі %d.

source: Timeout of starting the task '%s'!
de: Timeout beim Starten der Aufgabe '%s'!
ru: Исчерпано время запуска задачи '%s'!
uk: Вичерпано час запуску задачі '%s'!

source: Timeout of the task '%s' !!!
de: Timeout der Aufgabe '%s' !!!
ru: Исчерпано время задачи '%s' !!!
uk: Вичерпано час завданняі '%s' !!!

source: Task '%s' is not stopped!
de: Aufgabe '%s' ist nicht gestoppt!
ru: Задача '%s' не остановлена!
uk: Завдання '%s' не зупинено!

source: Waiting for an event of the task '%s' ...
de: Warten Sie Ereignis von Aufgaben '%s' ...
ru: Ожидание события задачи '%s' ...
uk: Очікування події завдання '%s' ...

source: It isn't OpenSCADA task!
de: Es ist nicht OpenSCADA Aufgabe!
ru: Это не задача OpenSCADA!
uk: Це не завдання OpenSCADA!

source: Task %u unexpected terminated by an exception.
de: Task %u unerwartet beendet durch Ausnahme.
ru: Задача %u неожиданно прервана исключением.
uk: Завдання %u несподівано перервано виключенням.

source: Redundant station '%s' is up.
de: Redundancy station '%s' auf.
ru: Резервная станция '%s' доступна.
uk: Резервна станція '%s' доступна.

source: Redundant station '%s' is down.
de: Redundancy station '%s' abwärts.
ru: Резервная станция '%s' недоступна.
uk: Резервна станція '%s' недоступна.

source: System clock changed to '%s'. Correction the cron '%s' target!
de: Der Systemtakt geändert '%s'. Korrektur der cron '%s' Ziel!
ru: Системные часы изменены в '%s'. Коррекция цели крона '%s'!
uk: Системний годинник змінено у '%s'. Корекція цілі крону '%s'!

source: 1:Request is not an object!
de: 1:Die Anfrage ist kein Objekt!
ru: 1:Запрос не объект!
uk: 1:Запит не є об'єкт!

source: 10:Error remote request: %s
de: 10:Fehler Remote-Anforderung: %s
ru: 10:Ошибка удалённого запроса: %s
uk: 10:Помилка віддаленого запиту: %s

source: %s station: "%s"
ru: %s станция: "%s"
uk: %s станція: "%s"

source: Station
ru: Станция
uk: Станція

source: Configuration file
de: Konfigurationsdatei
ru: Конфигурационный файл
uk: Конфігураційний файл

source: Work directory
de: Arbeitsverzeichnis
ru: Рабочая директория
uk: Робоча тека

source: Modules directory
de: Modulverzeichnis
ru: Директория модулей
uk: Тека модулів

source: Icons directory
de: Symbolverzeichnis
ru: Директория иконок
uk: Тека іконок

source: Separate directory paths with icons by symbol ';'.
de: Separate Verzeichnispfade mit Ikonen Symbol ';'.
ru: Отделять пути директорий с иконками символом ';'.
uk: Відокремлювати шляхи тек із іконками символом ';'.

source: Documents directory
de: Documenteverzeichnis
ru: Директория документов
uk: Тека документів

source: Separate directory paths with documents by symbol ';'.
de: Separate Verzeichnispfade mit Documents Symbol ';'.
ru: Отделять пути директорий с документами символом ';'.
uk: Відокремлювати шляхи тек із документами символом ';'.

source: Work DB
de: Arbeitsdatenbank
ru: Рабочая БД
uk: Робоча БД

source: Work DB address in the format "{DB module}.{DB name}".
ru: Адрес рабочей БД в формате "{Модуль БД}.{Имя БД}".

source: Select for the program automatic saving to DB on exit.
de: Auswahl für das automatische Programm in die Datenbank beim Beenden.
ru: Выбрать для автоматического сохранения программы в БД при выходе.
uk: Вибрати для автоматичного збереження програми у БД під час виходу.

source: Set modification for the calculated objects
de: Legen Sie die Änderung für die berechneten Objekte fest.
ru: Устанавливать модификацию для вычислительных объектов
uk: Встановлювати модифікацію для обчислювальних об'єктів

source: Most suitable for the production systems together with the previous configuration properties, for the calculation context saving. But it is inconvinient in the development mode, all time reminding for the saving need.
de: Am besten geeignet für die Produktionssysteme zusammen mit den vorherigen Konfigurationseigenschaften, um den Berechnungskontext zu speichern. Aber im Entwicklungsmodus unpraktisch, immer daran zu erinnern, dass gespart werden muss.
ru: Особенно подходящее для рабочих систем вместе с предыдущими конфигурационными свойствами, для сохранения контекста вычисления. Но неудобно в режиме разработки, постоянно напоминая про необходимость сохранения.
uk: Особливо підхоже для робочих систем разом із попередніми конфігураційними властивостями, для збереження контексту обчислення. Але незручно у режимі розробки, постійно нагадуючи про необхідність збереження.

source: Least messages level which is procesed by the program.
de: Die niedrigste Nachrichtenstufe, welche vom Programm bearbeitet wird.
ru: Наименьший уровень сообщений, который обрабатывается программой.
uk: Найменший рівень повідомлень, які обробляються програмою.

source: To syslog
de: Systemlog (syslog)
ru: В системный логер(syslog)
uk: До системного логера(syslog)

source: To stdout
de: Standardausgang (stdout)
ru: На стандартный выход(stdout)
uk: До стандартного виходу(stdout)

source: To stderr
de: Standardfehlerausgang (stderr)
ru: На стандартный выход ошибок(stderr)
uk: До стандартного виходу помилок(stderr)

source: To archive
de: Zum Archiv
ru: В архив
uk: До архіву

source: Program
de: Programm
ru: Программа
uk: Програма

source: System user
de: Systembenutzer
ru: Системный пользователь
uk: Системний користувач

source: Host name
de: Rechnername
ru: Имя хоста
uk: Ім'я хосту

source: Number of phases of the task invoking
de: Anzahl der Phasen des Taskaufrufs
ru: Количество фаз вызова задач
uk: Кількість фаз виклику задач

source: Subsystems
de: Subsysteme
ru: Подсистемы
uk: Підсистеми

source: Station level
de: Stationsstufe
ru: Уровень станции
uk: Рівень станції

source: Redundant task period, seconds
de: Zeit der Reservierungsaufgabe, Sekunden
ru: Период задачи резервирования, секунд
uk: Період задачі резервування, секунд

source: Restore connection timeout, seconds
de: Verbindungs-Timeout wiederherstellen, Sekunden
ru: Интервал времени восстановления соединения, секунд
uk: Час відновлення підключення, секунд

source: Local primary commands transfer
de: Lokale primäre Befehle Übertragung
ru: Передача локальных первичных команд
uk: Передача локальних первинних команд

source: Stations
de: Stationen
ru: Станции
uk: Станції

source: Live
de: Lebendig
ru: Жив
uk: Жива

source: Counter
de: Zähler
ru: Счётчик
uk: Лічильник

source: Go to the configuration of the list of remote stations
de: Wechseln Sie zur Konfiguration der Liste der Remote-Stationen
ru: Переход к конфигурации перечня удалённых станций
uk: Перехід до конфігурації переліку віддалених станцій

source: Translations
de: Übersetzungen
ru: Переводы
uk: Переклади

source: Base language - locales list
ru: Базовый язык - перечень локалей

source: Enables the multilingual support for text variables in the configuration DBs by entry the base language and the project whole locales (like to "en_US.UTF-8") list (optional) separated by ';'. You can entry here other language besides English(en) as the base, but take in your mind that all standard OpenSCADA libraries formed for the base language English(en), so other base languages will break these DBs at change!
ru: Включает поддержку многоязычности текстовых переменных в конфигурационных БД через ввод базового языка и перечня всех локалей (вроде "ru_RU.UTF-8") проекта (опционально) разделённых ';'. Вы можете ввести тут другой язык кроме Английский(en), но имейте ввиду, что все стандартные библиотеки OpenSCADA сформированы для базового языка Английский(en), т.е другой базовый язык будет портить эти БД при изменении!

source: dynamic translation
de: Dynamische Übersetzung
ru: динамический перевод
uk: динамічний переклад

source: Dynamic translation scheduling for next startup.
de: Planen Sie für die dynamische Übersetzung beim nächsten Start.
ru: План для динамического перевода при следующем запуске.
uk: План динамічного перекладу на наступний запуск.

source: Enable the manager
de: Manager aktivieren
ru: Включение менеджера
uk: Ввімкнення менеджера

source: Enables the generic translation manager which cause full reloading for all built messages obtain.
de: Aktivieren gemeinsame Übersetzung verwalten, welche volle Nachladen führen für alle gebaut Nachrichten zu erhalten.
ru: Включение общего управления переводами, что приводит к полной перезагрузке для получения встроенных сообщений.
uk: Включення загального керування перекладами, що призводить до повного перезавантаження для отримання вбудованих повідомлень.

source: Languages of managing
de: Verwaltungssprachen
ru: Языки контроля
uk: Мови контролю

source: List of the processing languages, in the two-character representation and separated by the character ';'.
de: Liste der Verarbeitungssprachen, in der Zwei-Zeichen-Darstellung und getrennt durch das Zeichen ';'.
ru: Список обрабатываемых языков в двухсимвольном представлении и разделённые символом ';'.
uk: Перелік оброблюваних мов у двосимвольному представлені та поділені символом ';'.

source: Source filter, check/fix, pass
de: Quellenfilter, überprüfen/beheben, pass
ru: Фильтр источников, проверка/исправление, пропуск
