Repository: aleax/openscada
Catalog: src/po/*.po
Languages: de, ru, uk

source: Time of inactivity in the tables for it closing.
de: Zeitpunkt der Inaktivität in den Tabellen zum Schließen.
ru: Время неактивности в таблицах для их закрытия.
uk: Час неактивності у таблицях для їх закриття.

source: DB
de: Datenbank
ru: БД
uk: БД

source: Complete DB removal
de: Komplette DB-Entfernung
ru: Полное удаление БД
uk: Повне видалення БД

source: Select to completely remove the database when closing, otherwise the DB will simply be closed.
de: Wählen Sie für die vollständige DB Löschung in dieser DB schließen, sonst wird die DB einfach geschlossen werden.
ru: Выбрать для полного удаления БД при её закрытии, иначе БД будет просто закрыта.
uk: Обрати для повного видалення БД під час закриття, інакше БД буде просто закрито.

source: Data base:
de: Datenbank:
ru: База данных:
uk: База даних:

source: Opened table
de: Geöffnete Tabelle
ru: Открытая таблица
uk: Відкриті таблиці

source: Data base
de: Datenbank
ru: База данных
uk: База даних

source: Enabled
de: Aktiviert
ru: Включен
uk: Ввімкнено

source: Accessible tables
de: Verfügbare Tabellen
ru: Доступные таблицы
uk: Наявні таблиці

source: Tables in the database, but not open at this time.
de: Tabellen sind in der Datenbank aber nicht geöffnet.
ru: Таблицы которые в БД, но не открыты на данный момент.
uk: Таблиці у БД, але не відкриті на цей час.

source: Load the program from this DB
de: Programm aus der Datenbank laden
ru: Загрузить программу из этой БД
uk: Завантажити програму з цієї БД

source: Codepage of data into the DB. For example it is: UTF-8, KOI8-R, KOI8-U ... .
de: Unicode Zeichensatz in der Datenbank, zum Beispiel: UTF-8, KOI8-R, KOI8-U ... .
ru: Кодировка данных в БД. Для примера: UTF-8, KOI8-R, KOI8-U ... .
uk: Кодування даних у БД. Наприклад: UTF-8, KOI8-R, KOI8-U ... .

source: Priority in the range [0...99]. Useful for libraries placed in several databases for specifying the priority of the project - used ones.
ru: Приоритет в диапазоне [0...99]. Полезно для библиотек размещённых в нескольких базах данных для определения приоритетных - используемых.

source: Tables
de: Tabellen
ru: Таблицы
uk: Таблиці

source: Opened tables
de: Geöffnete Tabellen
ru: Открытые таблицы
uk: Відкриті таблиці

source: Opened tables list. Adding and removing tables actually consists of opening and closing tables.
de: Liste von geöffneten Tabellen. Hinzufügen und Löschen von Tabellen entspricht Öffnen und Schliessen von Tabellen.
ru: Перечень открытых таблиц. Операции добавления и удаления таблиц на самом деле являются операциями открытия и закрытия таблиц.
uk: Перелік відкритих таблиць. Операції додавання та видалення таблиць насправді становлять операції відкриття та закриття таблиць.

source: Request
de: Anfrage
ru: Запрос
uk: Запит

source: Transaction
de: Eingangsübertragung
ru: Транзакция
uk: Транзакція

source: Out;Into;No matter
de: Außerhalb;Innerhalb;Ganz gleich
ru: Вне;Внутри;Не имеет значения
uk: Зовні;В середині;Немає значення

source: Send
de: Absenden
ru: Отправить
uk: Надіслати

source: Result
de: Ergebnis
ru: Результат
uk: Результат

source: Table:
de: Tabelle:
ru: Таблица:
uk: Таблиця:

source: Table
de: Tabelle
ru: Таблица
uk: Таблиця

source: Table offset, size
de: Tabelle Offset, die Größe
ru: Таблица - смещение, размер
uk: Таблиця - зміщення, розмір

source: Data
de: Daten
ru: Данные
uk: Дані

source: Table is empty.
ru: Таблица пуста.

source: Row "%s" is not present. Are you saved the object?
ru: Запись "%s" отсутствует. Вы сохраняли этот объект?

source: The DB is in the Read only mode.
ru: БД в режиме Только для Чтения.

source: Translation removed! Reload the base message.
ru: Перевод удалён! Перегрузите базовое сообщение.

source: Field id = %s(%s) is missing!
de: Feld id = %s(%s) ist nicht vorhanden!
ru: Поле id = %s(%s) отсутствует!
uk: Поле id = %s(%s) відсутнє!

source: %s:%s:> Error in the control item '%s'!
de: %s:%s:> Fehler des Kontrollelements '%s'!
ru: %s:%s:> Ошибка элемента управления '%s'!
uk: %s:%s:> Помилка елементу керування '%s'.

source: The node is already being processed!
de: Der Knoten wird bereits bearbeitet!
ru: Узел уже обрабатывается!
uk: Вузол вже обробляється!

source: Waiting time exceeded. The object is used by %d users. Release the object first!
de: Zeitüberschreitung ist aufgetreten. Objekt wird von %d Benutzern verwendet.Zuerst Objekt freigeben!
ru: Превышено время ожидания. Объект использован %d пользователями. Сначала освободите объект!
uk: Перевищено час очікування. Об'єкт використовується %d користувачами. Звільніть об'єкт спочатку!

source: Error blocking node. The node forced to disable which can cause to crash. This problem mostly in a user procedure, if the program exits!
de: Fehler beim Blockieren des Knotens. Der Knoten wird zum Deaktivieren gezwungen, was zum Absturz führen kann. Dieses Problem tritt meistens in der Benutzerprozedur auf, wenn das Programm beendet wird!
ru: Ошибка блокирования узла. Узел принудительно выключен, что может привести к аварийному завершению программы. Эта проблема в основном в процедуре пользователя, если программа завершается!
uk: Помилка блокування вузлу. Вузол примусово вимкнено, що може призвести до аварійного завершення програми. Ця проблема переважно у процедурі користувача, якщо програма завершується!

source: Expecting release %d users!
de: Erwartet Release %d Benutzer!
ru: Ожидание освобождения %d пользователями!
uk: Очікування звільнення %d користувачами!

source: Error turning off node. Turning on back the node.
de: Fehler beim Ausschalten des Knotens. Den Knoten zurückschalten.
ru: Ошибка отключения узла. Восстановление включения узла.
uk: Помилка вимкнення вузлу. Відновлення увімкнення вузлу.

source: Node is disabled!
de: Der Knoten ist abgeschaltet!
ru: Узел отключен!
uk: Вузол вимкнено!

source: The node '%s' is missing!
de: Der Knoten '%s' ist nicht vorhanden!
ru: Узел '%s' отсутствует!
uk: Вузол '%s' відсутній!

source: Copy from '%s' to '%s' is not possible.
de: Kopieren von '%s' nach '%s' ist nicht zulässig.
ru: Копирование из '%s' в '%s' невозможно.
uk: Копіювання з '%s' до '%s' неможливе.

source: Target node has no branches.
de: Der Zielknoten hat keine Verzweigung.
ru: Целевой узел не имеет ветвей.
uk: Цільовий вузол не має відгалужень.

source: The target node '%s' does not have the required branch.
ru: Целевой узел '%s' не имеет нужной ветви.

source: End branch of the target node '%s' is not writeable.
ru: Конечная ветвь целевого узла '%s' недоступна для записи.

source: Target node does not have the required branch.
de: Der Zielknoten hat keine erforderliche Verzweigung.
ru: Целевой узел не имеет нужной ветви.
uk: Цільовий вузол не має потрібної гілки.

source: Error group of branches '%d'.
de: Fehler der Branchengruppe '%d'.
ru: Ошибка группы веток '%d'.
uk: Помилка групи гілок '%d'.

source: Error group of childs %d!
de: Gruppe der Kinder %d Fehler!
ru: Ошибка группы дочерних узлов %d!
uk: Помилка групи нащадків %d!

source: Node is not enabled!
de: Knoten ist nicht eingeschaltet!
ru: Узел не включен!
uk: Вузол не увімкнено!

source: Id of the child that is adding is empty!
de: Die ID des hinzuzufügenden Kindes ist leer!
ru: Добавляемый дочерний идентификатор пуст!
uk: Id нащадку, що додається є порожнім!

source: Node is being processed now for enable!
de: Knoten wird jetzt zur Aktivierung verarbeitet!
ru: Узел сейчас обрабатывается для включения!
uk: Вузол обробляється зараз для ввімкнення!

source: Node root or not connected!
de: Knotenstamm oder nicht verbunden!
ru: Узел корневой или не подключен!
uk: Вузол кореневий або не підключений!

source: Element '%s' is not present!
de: Element '%s' ist nicht vorhanden!
ru: Элемент '%s' отсутствует!
uk: Елемент '%s' відсутній!

source: Element '%s' is disabled!
de: Element '%s' ist abgeschaltet!
ru: Элемент '%s' отключен!
uk: Елемент '%s' вимкнений!

source: Very many users at the node!!!
de: Zu viele Benutzer für Knoten!!!
ru: Очень много пользователей у узла!!!
uk: Дуже багато користувачів у вузла!!!

source: Error the function '%s' or missing its parameters.
de: Fehler in der Funktion '%s' oder nicht genug Parameter.
ru: Ошибка функции '%s' или не достаточно параметров для неё.
uk: Помилка функції '%s' або недостатньо параметрів для неї.

source: Item %d of the path '%s' is missing!
de: Eintrag %d des Pfads '%s' wird verpasst!
ru: Элемент %d пути '%s' отсутствует!
uk: Елемент %d шляху '%s' відсутній!

source: Error accessing item '%s'!
de: Fehler beim Zugriff auf das Element '%s'!
ru: Ошибка доступа к элементу '%s'!
uk: Помилка доступу до елементу '%s'!

source: Node: %s
de: Knoten: %s
ru: Узел: %s
uk: Вузол: %s

source: Error loading: %s
de: Ladefehler: %s
ru: Ошибка загрузки: %s
uk: Помилка завантаження: %s

source: Error saving: %s
de: Fehler beim Speichern %s
ru: Ошибка сохранения: %s
uk: Помилка збереження: %s

source: [TableName]
de: [Tabellenname]
ru: [ИмяТаблицы]
uk: [Ім'яТаблиці]

source: Attribute '%s' is not present!
de: Attribut '%s' ist nicht vorhanden!
ru: Атрибут '%s' отсутствует!
uk: Атрибут '%s' відсутній!

source: Element type is not selective!
de: Elementtyp ist nicht selektiv!
ru: Тип элемента не выбираем!
uk: Тип елементу не вибірковий!

source: Element type is not String!
de: Elementtyp ist nicht String!
ru: Тип элемента не строка!
uk: Тип елементу не рядок!

source: Element type is not Real!
de: Elementtyp ist nicht Reelle Zahl!
ru: Тип элемента не вещественное!
uk: Тип елементу не реальний!

source: Element type is not Integer!
de: Elementtyp ist nicht Ganzzahl!
ru: Тип элемента не целый!
uk: Тип елементу не цілий!

source: Element type is not Boolean!
de: Elementtyp ist nicht Logisch!
ru: Тип элемента не логический!
uk: Тип елементу не логічний!

source: Running.
de: Laufen.
ru: Выполняется.
uk: Виконується.

source: Acquisition data from a remote station:
de: Erfassungsdaten von einer entfernten Station:
ru: Сбор данных из удалённой станции:
uk: Збір даних з віддаленої станції:

source: Your redundancy settings are incorrect and the controller often enables-disables the redundancy!
de: Ihre Redundanzkonfiguration falsch und Steuerung oft enable-deaktivieren Redundanz!
ru: Ваши настройки резервирования некорректны и контроллер часто включает-выключает резервирование!
uk: Ваші налаштування резервування некоректні та контролер часто включає-виключає резервування!

source: Enabled.
de: Aktiviert.
ru: Включен.
uk: Ввімкнено.

source: Disabled.
de: Behindert.
ru: Выключен.
uk: Вимкнено.

source: Controller configuration loading.
de: Controller-Konfiguration wird geladen.
ru: Загрузка конфигурации контроллера.
uk: Завантаження конфігурації контролера.

source: Controller configuration saving.
de: Controller-Konfiguration speichern.
ru: Сохранение конфигурации контроллера.
uk: Збереження конфігурації контролера.

source: Controller starting.
de: Controller startet.
ru: Запуск контроллера.
uk: Запуск контролера.

source: Controller stopping.
de: Controller stoppt.
ru: Останов контроллера.
uk: Зупинка контролера.

source: Controller enabling.
de: Controller ermöglicht.
ru: Включение контроллера.
uk: Ввімкнення контролера.

source: Error turning on the parameter '%s'.
de: Fehler beim Einschalten des Parameters '%s'.
ru: Ошибка включения параметра '%s'.
uk: Помилка ввімкнення параметру '%s'.

source: Error turning on some parameters.
de: Fehler beim Einschalten einiger Parameter.
ru: Ошибка включения некоторых параметров.
uk: Помилка включення деяких параметрів.

source: Controller disabling.
de: Controller wird deaktiviert.
ru: Отключение контроллера.
uk: Виключення контролеру.

source: Error turning off the parameter '%s'.
de: Fehler beim Ausschalten des Parameters '%s'.
ru: Ошибка отключения параметра '%s'.
uk: Помилка вимкнення параметру '%s'.

source: Error adding the parameter '%s'.
de: Fehler beim Hinzufügen des Parameters '%s'.
ru: Ошибка добавления параметра '%s'.
uk: Помилка додавання параметру '%s'.

source: Error finding and creating new parameters.
de: Fehler beim Suchen und Erstellen neuer Parameter.
ru: Ошибка поиска и создание новых параметров.
uk: Помилка пошуку та створення нових параметрів.

source: Controller:
ru: Контроллер:
uk: Контролер:

source: Controller
ru: Контроллер
uk: Контролер

source: Status
ru: Статус
uk: Статус

source: Controller DB
de: Datenbank des Controllers
ru: БД контроллера
uk: БД контролера

source: Date of modification
de: Änderungsdatum
ru: Дата модификации
uk: Дата модифікації

source: Parameter
ru: Параметр
uk: Параметр

source: Parameters
de: Optionen
ru: Параметры
uk: Параметри

source: Add parameters to the type
de: Fügen Sie dem Typ Parameter hinzu
ru: Добавление параметров типа
uk: Додання параметрів типу

source: Diagnostics
de: Diagnostik
ru: Диагностика
uk: Діагностика

source: Display messages for larger or even levels. Also affects to specific-diagnostic messages generation by the data sources.
de: Zeigen Sie Nachrichten für größere oder gerade Ebenen an. Dies wirkt sich auch auf die Generierung spezifischer Diagnoseinformationen durch die Datenquellen aus.
ru: Отображать сообщения с уровнем больше или равно указанному. Также сказывается на генерации источником данных специфических-диагностических сообщений.
uk: Відображення повідомлень з рівнем більш або дорівнює вказаному. Також впливає на генерацію джерелом даних специфічних-діагностичних повідомлень.

source: Maximum calculate time, seconds
de: Maximale Zeit der Berechnung, Sekunden
ru: Максимальное время вычисления, секунд
uk: Максимальний час обрахунку, секунд

source: Completely translate the procedure
de: Übersetzen Sie das Verfahren vollständig
ru: Полностью переводить процедуру
uk: Повністю перекладати процедуру

source: Procedure
de: Verfahren
ru: Процедура
uk: Процедура

source: Template identifier
de: Vorlagen-ID
ru: Идентификатор шаблона
uk: Ідентифікатор шаблону

source: Flags
ru: Флаги
uk: Прапорці

source: Real position
de: Reale Stelle
ru: Реальное положение
uk: Реальна позиція

source: Error
de: Fehler
ru: Ошибка
uk: Помилка

source: === Attributes ===
de: === Attribute ===
ru: === Атрибуты ===
uk: === Атрибути ===

source: Error loading template libraries.
de: Fehler beim Laden der Vorlagenbibliotheken.
ru: Ошибка загрузки библиотек шаблонов.
uk: Помилка завантаження бібліотек шаблонів.

source: Error adding controller '%s'.
de: Fehler beim Hinzufügen des Controllers '%s'.
ru: Ошибка добавления контроллера '%s'.
uk: Помилка додавання контролеру '%s'.

source: Error starting the templates library '%s'.
de: Fehler beim Starten der Vorlagenbibliothek '%s'.
ru: Ошибка запуска библиотеки шаблонов '%s'.
uk: Помилка запуску бібліотеки шаблону '%s'.

source: Error enabling the controller object '%s'.
de: Fehler beim Aktivieren des Controller-Objekts '%s'.
ru: Ошибка включения объекта контроллера %s.
uk: Помилка увімкнення об'єкту контролеру '%s'.

source: Error stopping the controller object '%s'.
de: Fehler beim Stoppen des Controller-Objekts '%s'.
ru: Ошибка останова объекта контроллера %s.
uk: Помилка зупинки об'єкту контролеру '%s'.

source: Error disabling the controller object '%s'.
de: Fehler beim Deaktivieren des Controller-Objekts '%s'.
ru: Ошибка отключения объекта контроллера %s.
uk: Помилка вимкнення об'єкту контролеру '%s'.

source: Missing the DAQ node '%s'.
de: Den DAQ-Knoten '%s' fehlt.
ru: Отсутствует DAQ узел '%s'.
uk: Відсутній DAQ вузол '%s'.

source: The specified node is not the parameter '%s'.
de: Spitz Knoten nicht Parameter '%s'.
ru: Указанный узел не параметр '%s'.
uk: Вказаний вузол не параметр '%s'.

source: The specified node is not the attribute '%s'.
de: Spitz Knoten nicht Attribut '%s'.
ru: Указанный узел не атрибут '%s'.
uk: Вказаний вузол не атрибут '%s'.

source: =================== Subsystem "Data acquisition" options ================ ------ Parameters of the section '%s' of the configuration file ------ RdRestDtTm <hour> Depth of recovery time of archive data from the reserve station, when startup, in hours.
de: =================== Optionen des Subsystems "Datenempfang" ====================== ---------- Parameter des Abschnitts '%s' der Konfigurationsdatei ---------- RdRestDtTm <Stunde> Tiefe der Wiederherstellungszeit von Archivdaten von der Reservestation beim Start in Stunden.
ru: =================== Опции подсистемы "Сбор данных" ====================== ---------- Параметры секции '%s' конфигурационного файла ---------- RdRestDtTm <час> Глубина восстановления данных архива из резервной станции, при включении, в часах.
uk: ==================== Опції підсистеми "Збір даних" ====================== ---------- Параметри секції '%s' конфігураційного файлу ---------- RdRestDtTm <год> Глибина часу відновлення даних архіву з резервної станції, під час включення, у годинах.

source: Templates library
de: Vorlagenbibliothek
ru: Библиотека шаблонов
uk: Бібліотека шаблонів

source: Depth time of restoring data at the starting, hours
de: Depth-Zeit der Wiederherstellung von Daten beim Start, Stunden
ru: Глубина восстановления данных при запуске, часов
uk: Глибина відновлення даних при запуску, годин

source: Controllers
de: Controller
ru: Контроллеры
uk: Контролери

source: Off;Asymmetric;Only alarms
de: Off;Asymmetrisch;Nur Alarme
ru: Выключено;Асимметричное;Только нарушения
uk: Вимкнено;Асиметрично;Тільки порушення

source: Template libraries
de: Vorlagenbibliotheken
ru: Библиотеки шаблонов
uk: Бібліотеки шаблонів

source: Error ID!
de: Fehler-ID!
ru: Ошибка идентификатора!
uk: Помилка ідентифікатору!

source: Container element already connected!
de: Containerelement ist bereits verbunden!
ru: Элемент контейнера уже подключен!
uk: Елемент контейнеру вже під'єднано!

source: Field is not String.
de: Feld ist keine Zeichenfolge.
ru: Поле не строка.
uk: Поле не рядок.

source: Field is not Integer.
de: Feld ist keine Ganzzahl.
ru: Поле не целое.
uk: Поле не ціле.

source: Field is not Real.
de: Feld ist keine reelle Zahl.
ru: Поле не вещественное.
uk: Поле не реальне.

source: Field is not Boolean.
de: Feld ist nicht Logisch.
ru: Поле не логическое.
uk: Поле не логічне.

source: Field is not selective!
de: Feld ist nicht selektiv!
ru: Поле не выборочного типа!
uk: Поле не вибіркового типу!

source: Empty
de: Leer
ru: Пусто
uk: Порожньо

source: Error selecting! Value: '%s'.
de: Auswahlfehler! Wert: '%s'.
ru: Ошибка выбора! Значение: '%s'.
uk: Помилка вибору! Значення: '%s'.

source: A duple IO '%s' is detected in position %d after %d. If you do not see the duple IO then you created a special IO, remove or rename it!
de: Ein Duple IO '%s' wurde in Position %d nach %d erkannt. Wenn Sie das nicht sehen doppelte IO, dann haben Sie eine spezielle IO erstellt, entfernen oder umbenennen!
ru: Обнаружен дублирующий ВВ "%s" в позиции %d после %d. Если вы не видите дублирующего ВВ, то вы создали специальный ВВ, удалите или переименуйте его!
uk: Виявлено дублюєчий ВВ "%s" у позиції %d після %d. Якщо ви не бачите дублюючого ВВ, то ви створили спеціальний ВВ, видаліть або перейменуйте його!

source: Function used: %s
de: Funktion wird verwendet: %s
ru: Функция использована: %s
uk: Функція використана: %s

source: Index %d is broken!
de: Index %d ist beschädigt!
ru: Индекс %d повреждён!
uk: Індекс %d пошкоджено!

source: Error removing IO %d.
de: Fehler beim Entfernen von IO %d.
ru: Ошибка удаления IO '%d'.
uk: Помилка видалення IO '%d'.

source: Error moving IO from %d to %d.
de: Fehler beim Verschieben von IO von %d nach %d.
ru: Ошибка перемещения IO из %d в %d.
uk: Помилка пересування IO з %d до %d.

source: Changes are not possible because the function is used: %s
de: Änderung nicht möglich solange die Funktion verwendet wird: %s
ru: Изменение не допустимо пока функция используется: %s
uk: Зміни неможливі тому що функція використана: %s

source: The value '%s' is already connected!
de: Wert '%s' ist schon eingeschaltet!
ru: Значение '%s' уже подключено!
uk: Значення '%s' вже підключено!

source: Function:
de: Funktion:
ru: Функция:
uk: Функція:

source: Function
de: Funktion
ru: Функция
uk: Функція

source: Accessible
de: Zugänglich
ru: Доступен
uk: Доступний

source: Used
de: Verwendet
ru: Использовано
uk: Використано

source: IO
ru: ВВ
uk: ВВ

source: Type
de: Typ
ru: Тип
uk: Тип

source: Mode
de: Modus
ru: Режим
uk: Режим

source: Hide
de: Unsichtbar
ru: Скрыт
uk: Приховано

source: Default
de: Standard
ru: По умолчанию
uk: По замовченню

source: Execute
de: Ausführen
ru: Исполнить
uk: Виконати

source: Number of calculations
de: Anzahl der Berechnungen
ru: Количество исполнения
uk: Кількість виконань

source: Spent time
de: Verbrauchte Zeit
ru: Затрачено времени
uk: Витрачено часу

source: Text
ru: Текст

source: String
de: Text
ru: Строка
uk: Рядок

source: (translate)
de: (übersetzen)
ru: (перевод)

source: Integer
de: Ganzzahl
ru: Целый
uk: Цілий

source: Real
de: Reele Zahl
ru: Веществен.
uk: Реальний

source: Bool
de: Logisch
ru: Логический
uk: Логічний

source: Object
de: Objekt
ru: Объект
uk: Об'єкт

source: Return
de: Rückgabe
ru: Возврат
uk: Повернення

source: Output
de: Ausgang
ru: Выход
uk: Вихід

source: Input
de: Eingang
ru: Вход
uk: Вхід

source: IO '%s' is not present!
de: IO '%s' ist nicht vorhanden!
ru: IO '%s' отсутствует!
uk: IO '%s' відсутній!

source: Function is not attached!
de: Funktion ist nicht aktiviert!
ru: Функция не подключена!
uk: Функція не підключена!

source: %s: Error with ID or IO %d!
de: %s: Fehler des Bezeichners oder IO %d!
ru: %s: Ошибка идентификатора или IO %d!
uk: %s: Помилка ідентифікатору або IO %d!

source: Error getting object from non-object IO %d!
de: Fehler beim Empfang des Objekts vom anderen IO %d !
ru: Ошибка получения объекта из не объектного IO %d!
uk: Помилка отримання об'єкту з не об'єктного IO %d!

source: Storage address in the format "{DB module}.{DB name}".
ru: Адрес хранилища в формате "{Модуль БД}.{Имя БД}".

source: Set '*.*' to use the Generic Storage.
ru: Установить '*.*' для использования Общего Хранилища.

source: Please note that removing from the Generic Storage (*.*) will cause the data removing both from the Configuration File (<cfg>) and the Work DB (%s)!
ru: Заметьте пожалуйста, что удаление из Общего Хранилища (*.*) приведёт к удалению данных как из Конфигурационного Файла (<cfg>), так и Рабочей БД (%s)!

source: Schedule wrotes in seconds periodic form or in the standard CRON form. The seconds periodic form is one real number (1.5, 1e-3). CRON is the standard form "* * * * *". Where items by the order: - minutes (0-59); - hours (0-23); - days (1-31); - month (1-12); - week day (0[Sunday]-6). Where the item variants: - "*" - any value; - "1,2,3" - list of the allowed values; - "1-5" - raw range of the allowed values; - "*/2" - divider to the all allowed values range. Examples: "1e-3" - call with a period of one millisecond; "* * * * *" - each minute; "10 23 * * *" - only at 23 hour and 10 minute for any day and month; "*/2 * * * *" - for minutes: 0,2,4,...,56,58; "* 2-4 * * *" - for any minutes in hours from 2 to 4(include).
ru: Планирование записывается в форме секундной периодичности или в форме стандарта CRON. Секундная форма это одно вещественное число (1.5, 1e-3). Форма стандарта CRON это "* * * * *". Где элементы по порядку: - минуты (0-59); - часы (0-23); - дни (1-31); - месяца (1-12); - дни недели (0[Воскресенье]-6). Где варианты элемента: - "*" - любое значение; - "1,2,3" - разрешённые значения; - "1-5" - диапазон разрешённых значений; - "*/2" - делитель диапазона разрешённых значений. Примеры: "1e-3" - периодический вызов с одной миллисекундой; "* * * * *" - каждая минута; "10 23 * * *" - только 23ий час и 10ая минута любого дня и месяца; "*/2 * * * *" - для минут: 0,2,4,...,56,58; "* 2-4 * * *" - для любой минуты в часе от 2 до 4(включительно).
