Repository: aleax/openscada
Catalog: src/po/*.po
Languages: de, ru, uk

source: Source filter of limiting the manager work in some DBs, the source just must contain such substring.
de: Quellfilter zur Einschränkung der Managerarbeit in einigen DBs, die Quelle muss nur einen solchen Teilstring enthalten.
ru: Фильтр источников для ограничения работы менеджера некоторыми БД, источник должен просто содержать такую подстроку.
uk: Фільтр джерел для обмеження роботи менеджеру деякими БД, джерело має просто містити такий підрядок.

source: Enable for checking the base messages translation equality in different sources and fixing by: propagation the translations to empty sources, clearing the double to base translations and merging the base messages as the translations.
de: Aktivieren Sie diese Option, um die Übersetzungsgleichheit der Basisnachrichten in verschiedenen Quellen zu überprüfen und Fixieren durch: Propagieren der Übersetzungen an leere Quellen, Löschen der Doppel-zu-Basis-Übersetzungen und Zusammenführen der Basisnachrichten als die Übersetzungen.
ru: Включить проверку на предмет одинаковости перевода базового сообщения в разных источниках и исправление на предмет: распространения перевода на пустые источники, очистки дублирования базовых сообщений и объединения базовых сообщений как переводы.

source: Pass the specified number of the table items from the top, useful for very big projects which are limited in time of the table complete processing.
de: Übergeben Sie die angegebene Anzahl der Tabellenelemente von oben, nützlich für sehr große Projekte, die in der Zeit der vollständigen Verarbeitung der Tabelle begrenzt sind.
ru: Пропустить указанное количество элементов таблицы от начала, полезно для очень больших проектов которые ограничены во времени полной обработки таблицы.
uk: Пропустити визначену кількість елементів таблиці від початку, корисно для дуже великих проектів які обмежено у часі повного опрацювання таблиці.

source: Remove from Trs
ru: Удалить из Trs

source: Split item
ru: Разделить елемент

source: Tasks
de: Aufgaben
ru: Задачи
uk: Задачі

source: Path
de: Pfad
ru: Путь
uk: Шлях

source: Thread
de: Der Strom
ru: Поток
uk: Нитка

source: Policy
de: Politik
ru: Политика
uk: Політика

source: Prior.
de: Priorität
ru: Приор.
uk: Пріор.

source: CPU set
de: CPU Installation
ru: Уст. CPU
uk: Вст. CPU

source: To set up the processors you use, write a row of numbers separated by a ':' character.
de: Für eine Verwendung von CPU gesetzt Schreib Prozessoren Zahlen String mit dem Symbol ':' getrennt.
ru: Для указания используемых процессоров записывайте строку номеров разделённых символом ':'.
uk: Для встановлення використовуваних процесорів записуйте рядок номерів поділених символом ':'.

source: Phase
ru: Фаза
uk: Фаза

source: To set up the task invoking phase.
de: Zum Einstellen der Phaseneinstellung der Task
ru: Для установки фазирования вызова задач.
uk: Для встановлення фазування виклику задач.

source: Debug
de: Debuggen
ru: Отладка
uk: Налагодження

source: Counters
de: Zähler
ru: Счётчики
uk: Лічильники

source: Debug categories
de: Kategorien Debugging
ru: Категории отладки
uk: Категорії налагодження

source: Process
de: Bearbeitung
ru: Обработка
uk: Обробка

source: See to the messages
de: Siehe zu den Nachrichten
ru: Просмотр сообщений
uk: Перегляд повідомлень

source: Real-time %s
de: Echtzeit %s
ru: Реального времени %s
uk: Реального часу %s

source: Monotonic %s
de: Monotone %s
ru: Монотонные %s
uk: Монотонний %s

source: %dx%0.3gGHz
ru: %dx%0.3gГГц
uk: %dx%0.3gГГц

source: Spent time %s[%s].
ru: Затрачено времени %s[%s].

source: <newStat>
de: <neueStation>
ru: <новаяСтанц>
uk: <новСтанц>

source: Finished.
ru: Закончен.
uk: Закінчено.

source: Last: %s. Consumed: %3.1f[%3.1f]%% (%s from %s). Lag: %s[%s]. Lost cycles: %g.
de: Letzter: %s. Konsumieren: %3.1f[%3.1f]%% (%s von %s). Lag: %s[%s]. Verlust Zyklen: %g.
ru: Посл.: %s. Использ. %3.1f[%3.1f]%% (%s из %s). Отстав.: %s[%s]. Потеря циклов: %g.
uk: Останній: %s. Використ.: %3.1f[%3.1f]%% (%s із %s). Відстав.: %s[%s]. Втрата циклів: %g.

source: Standard
ru: Стандарт
uk: Стандарт

source: RT FIFO
ru: РВ FIFO
uk: РЧ FIFO

source: RT Round-robin
ru: РВ Round-robin
uk: РЧ Round-robin

source: Style "batch"
de: Stil "batch"
ru: Стиль "batch"
uk: Стиль "batch"

source: The task '%s' is missing.
de: Die Aufgabe '%s' fehlt.
ru: Задача '%s' отсутствует.
uk: Задача '%s' відсутня.

source: Attempt to set missing processor.
de: Versuch, fehlenden Prozessor zu setzen.
ru: Попытка установки отсутствующего процессора.
uk: Спроба встановлення відсутнього процесору.

source: Error installing processors for the thread.
de: Fehler beim Installieren der Prozessoren für den Thread.
ru: Ошибка установки процессоров для потока.
uk: Помилка встановлення процесорів для потоку.

source: SINGLELANGUAGE
ru: ОДНОЯЗЫЧНЫЙ

source: only use the already multilanguage DBs with their modification
de: nur die bereits mehrsprachigen DBs mit ihren Modifikationen verwenden
ru: только использовать уже многоязычные БД с их модификацией
uk: лише використовувати вже багатомовні БД із їх модифікацією

source: MULTILANGUAGE-DYNAMIC
ru: МНОГОЯЗЫЧНЫЙ-ДИНАМИЧЕСКИЙ

source: MULTILANGUAGE
ru: МНОГОЯЗЫЧНЫЙ

source: creating or modification the configuration DBs as multilanguage ones with the pointed base language '%s'
de: Erstellen oder Ändern der Konfigurations-DBs als mehrsprachige mit der angegebenen Basissprache '%s'
ru: создание или модификация конфигурационных БД как многоязычные с указанным базовым языком '%s'
uk: створення або модифікація конфігураційних БД як багатомовні із вказаною базовою мовою '%s'

source: Messages indexed %d, cached %d.
ru: Сообщений индексировано %d, кешировано %d.

source: Translation contexts %d.
ru: Контекстов перевода %d.

source: <<<Unmatched sources>>>
de: <<<Unerreichte Quelle!!!>>>
ru: <<<Несовпадение источников!!!>>>

source: Clearing the equel to base translation '%s' for '%s'.
de: Löschen der Gleich-zu-Basis-Übersetzung '%s' für '%s'.
ru: Очистка переводов, которые одинаковы с базой '%s' для '%s'.

source: Propagation the translation '%s' to all empty sources for '%s'.'%s'.
de: Propagiere die Übersetzung '%s' an alle leeren Quellen für '%s'.'%s'.
ru: Распространение перевода '%s' на все пустые источники для '%s'.'%s'.

source: Merging the base message to the translation '%s' for '%s' > '%s'.
de: Zusammenführen der Basisnachricht mit der Übersetzung '%s' für '%s' > '%s'.
ru: Объединение базового сообщения с переводом '%s' для '%s' > '%s'.

source: <<<Base changed>>>
ru: <<<База изменена>>>

source: Transport type
de: Übertragungstypen
ru: Тип транспорта
uk: Тип транспорту

source: Transport protocol
de: Übertragungsprotokoll
ru: Транспортный протокол
uk: Транспортний протокол

source: To connect
de: Zum Verbinden
ru: Подключаться
uk: Підключатися

source: User that opens
de: Benutzer, der geöffnet wird
ru: Открывающий пользователь
uk: Користувач що відкриває

source: Transport
de: Übertragung
ru: Транспорт
uk: Транспорт

source: Transport address
de: Adresse des Übertragung
ru: Адрес транспорта
uk: Адреса транспорту

source: User of the requests
de: Benutzer der Anfragen
ru: Пользователь запросов
uk: Користувач запитів

source: Password of the requests
de: Passwort der Anfragen
ru: Пароль запросов
uk: Пароль запитів

source: Level of lifting
de: Höhe des Hebens
ru: Уровень поднятия
uk: Рівень підняття

source: Error finding and creating new input transports.
de: Fehler beim Suchen und Erstellen neuer Eingabetransporte.
ru: Ошибка поиска и создания новых входных транспортов.
uk: Помилка пошуку та створення нових вхідних транспортів.

source: Error finding and creating new output transports.
de: Fehler beim Suchen und Erstellen neuer Ausgabetransporte.
ru: Ошибка поиска и создания новых выходных транспортов.
uk: Помилка пошуку та створення нових вихідних транспортів.

source: Error finding and loading external hosts.
de: Fehler beim Suchen und Laden externer Hosts.
ru: Ошибка поиска и загрузки БД внешних хостов.
uk: Помилка пошуку та завантаження БД зовнішніх хостів.

source: Error starting the input transport '%s'.
de: Fehler beim Starten des Eingabetransports '%s'.
ru: Ошибка запуска входного транспорта '%s'.
uk: Помилка запуску вхідного транспорту '%s'.

source: Error stopping the input transport '%s'.
de: Fehler beim Stoppen des Eingabetransports '%s'.
ru: Ошибка останова входного транспорта '%s'.
uk: Помилка зупинки вхідного транспорту '%s'.

source: Error stopping the output transport '%s'.
de: Fehler beim Stoppen des Ausgabetransports '%s'.
ru: Ошибка останова выходного транспорта '%s'.
uk: Помилка зупинки вихідного транспорту '%s'.

source: ======================= Subsystem "Transports" options ==================
de: ================== Optionen des Subsystems "Übertragung" ================
ru: ====================== Опции подсистемы "Транспорты" ====================
uk: ======================= Опції підсистеми "Транспорти" ===================

source: External hosts of %s
de: Externe Hosts von %s
ru: Внешние хосты %s
uk: Зовнішні хости %s

source: User;System;User and System
de: Benutzer;System;Benutzer und System
ru: Пользов.;Системн.;Пользов. и Системн.
uk: Корист.;Системн.;Корист. та Системн.

source: New external host
de: Neuer externe Host
ru: Новый внешний хост
uk: Новий зовнішній хост

source: Lifted hosts are not available for control here!
de: Lifted Hosts sind hier nicht zur Kontrolle verfügbar!
ru: Поднятые хосты недоступны для контроля здесь!
uk: Підняті хости недоступні для контролю тут!

source: The host '%s' is presented already!
ru: Хост '%s' уже присутствует!

source: ======================= Module <%s:%s> options ======================= ---- Parameters of the module section '%s' of the configuration file ---- OutLifeTime <seconds> Output transports lifetime (by default 0 seconds), 0 to disable the function.
de: ========================== Optionen des Moduls <%s:%s> ========================== ------ Parameter des Modulabschnitts '%s' der Konfigurationsdatei ------ OutLifeTime <Sekunden> Die Ausgabe transportiert die Lebensdauer (standardmäßig 0 Sekunden), 0 um die Funktion zu deaktivieren.
ru: ========================== Опции модуля <%s:%s> ========================== ------ Параметры модульной секции '%s' конфигурационного файла ------ OutLifeTime <секунд> Время жизни выходного транспорта (по умолчанию 0 секунд), 0 - для выключения функции.
uk: ========================== Опції модуля <%s:%s> ========================== ------ Параметри модульної секції '%s' конфігураційного файлу ------ OutLifeTime <секунд> Час життя вихідного транспорту (по замовченню 0 секунд), 0 - для вимкнення функції.

source: Input transport
de: Eingangsübertragung
ru: Входной транспорт
uk: Вхідний транспорт

source: Output transport
de: Ausgangsübertragung
ru: Выходной транспорт
uk: Вихідний транспорт

source: Transports
de: Übertragungen
ru: Транспорты
uk: Транспорти

source: List
de: Aufführen
ru: Список
uk: Перелік

source: Lifetime, seconds
de: Lebensdauer, Sekunden
ru: Время жизни, секунд
uk: Час життя, секунд

source: Time of inactivity in the output transport for it closing/disconnection. Set to 0 to disable the transports closing!
de: Zeitpunkt der Inaktivität im Ausgangstransport zum Schließen/Trennen. Auf 0 setzen, um das Schließen der Transporte zu deaktivieren!
ru: Время бездействия в выходном транспорте для его закрытия/отключения. Установите 0, чтобы отключить закрытие транспортов!
uk: Час бездіяльності у вихідному транспорті для його закриття/відключення. Встановіть 0, щоб відключити закриття транспорту!

source: Receiving data.
de: Daten empfangen.
ru: Получение данных.
uk: Отримання даних.

source: Disconnected.
de: Getrennt.
ru: Отключено.
uk: Відключено.

source: Error deletion the node: %s
de: Fehler beim Löschen des Knotens: %s
ru: Ошибка удаления узла: %s.
uk: Помилка видалення вузла: %s

source: Input transport:
de: Eingangsübertragung:
ru: Входной транспорт:
uk: Вхідний транспорт:

source: Connect
de: Verbinden
ru: Подключение
uk: Підключення

source: Transport DB
de: Datenbank der Übertragung
ru: БД транспорта
uk: БД транспорту

source: IO log
ru: Лог ВВ
uk: Лог ВВ

source: Log
ru: Лог
uk: Лог

source: CUT
de: SCHNEIDEN
ru: ВЫРЕЗАНО
uk: ВИРІЗАНО

source: Connected.
de: Verbunden.
ru: Подключено.
uk: Підключено.

source: Established %s, last %s.
ru: Установлено %s, последнее %s.

source: Transport protocol '%s' is missing
de: Das Transportprotokoll '%s' fehlt
ru: Транспортный протокол '%s' отсутствует
uk: Транспортний протокол '%s' відсутній

source: Output transport:
de: Ausgangsübertragung:
ru: Выходной транспорт:
uk: Вихідний транспорт:

source: Binary;Text(LF);Text(CR);Text(CR/LF)
de: Binär;Text(LF);Text(CR);Text(CR/LF)
ru: Бинарный;Текст(LF);Текст(CR);Текст(CR/LF)
uk: Бінарний;Текст(LF);Текст(CR);Текст(CR/LF)

source: Wait timeout
de: Timeout erwarten
ru: Ожидать таймаут
uk: Очікувати таймаут

source: A sign of waiting timeout when receiving an answer. Many systems, when responding to different protocols (such as HTTP), can send response data in several parts. Without this, only the first part will be received and displayed. When this flag is set, all parts of the response will be waiting up to missing data during the transport timeout.
de: Signal für das Timeout-Warten beim Erhalten der Antwort. Mehrere Systeme (HTTP) können bei der Antwort an verschiedenen Protokollen Daten der Antwort in einigen Stückchen senden. Ohne dieser Flagge wird nur das erste Stück erhalten und gezeigt. Bei der Installation dieser Flaggewird das Erwarten aller Antwortstückchen, bis zum Datenfehlen während Transport-Timeout erfüllt.
ru: Признак ожидания таймаута при получении ответа. Многие системы при ответе на различных протоколах (HTTP) могут слать данные ответа несколькими кусками. Без этого флага будет получен и отображён только первый кусок. При установке этого флага будет осуществлено ожидание всех кусков ответа, вплоть до отсутствия данных в течении таймаута дожидания транспорта.
uk: Ознака очікувати таймауту при отриманні відповіді. Багато систем під час відповіді на різних протоколах (на приклад HTTP) можуть надсилати дані відповіді декількома частинами. Без цього прапорцю буде отримано та відображено тільки першу частину. При встановлені цього прапорцю буде здійснено очікування всіх частин відповіді, до відсутності даних протягом таймаута доочікування транспорту.

source: Input buffer size, bytes
de: Eingangspuffergröße, Bytes
ru: Размер входного буфера, байт
uk: Розмір вхідного буферу, байтів

source: Direct set the input buffer size. Use 0 to disable waiting and reading for a data - only to write.
de: Direktes Setzen der Eingangspuffergröße. Verwenden Sie 0 zu deaktivieren warten und das Lesen zu einem Daten - nur zu schreiben.
ru: Прямая установка размера входного буфера. Используйте 0 для отключения ожидания и чтения данных - только запись.
uk: Пряме встановлення розміру вхідного буферу. Використовуйте 0 для відключення очікування та читання даних - тільки запис.

source: Answer
de: Antwort
ru: Ответ
uk: Відповідь

source: Off;Asymmetric
de: Off;Asymmetrisch
ru: Выключено;Асимметричное
uk: Вимкнено;Асиметрично

source: Preference for running
de: Präferenz für den Lauf
ru: Предпочтение исполнения
uk: Уподобання виконання

source: Error starting the controller '%s'.
de: Fehler beim Starten des Controllers '%s'.
ru: Ошибка подключения нового контроллера %s.
uk: Помилка запуску контролера '%s'.

source: Error ID of the parameter type!
de: Fehler-ID des Parametertyps!
ru: Ошибка идентификатора типа параметра!
uk: Помилка Id типу параметру!

source: Parameter type '%s' is not present.
de: Parametertyp '%s' ist nicht vorhanden.
ru: Тип параметра '%s' отсутствует.
uk: Тип параметру '%s' відсутній.

source: Error attaching the new controller '%s'.
de: Fehler beim Anhängen des neuen Controllers '%s'.
ru: Ошибка подключения нового контроллера '%s'.
uk: Помилка підключення нового контролера '%s'.

source: Module does not support compilation of the programming language.
de: Modul unterstützt Kompilierung der Programmiersprache nicht.
ru: Модуль не поддерживает функцию компиляции языков программирования.
uk: Модуль не підтримує функцію компіляції мови програмування.

source: Owner
de: Eigentümer
ru: Владелец
uk: Власник

source: ===================== Subsystem "User interfaces" options =============== ------ Parameters of the section '%s' of the configuration file ------ FontSnthHglCode <font> Font used in the code syntax highlight, by default "monospace".
ru: ============= Опции подсистемы "Пользовательские интерфейсы" ============ ---------- Параметры секции '%s' конфигурационного файла ---------- FontSnthHglCode <шрифт> Шрифт использованный в подсветке синтаксиса кода, по умолчанию "monospace".

source: Syntax highlight font for code
ru: Шрифт подсветки синтаксиса кода

source: User interface
de: Benutzerschnittstelle
ru: Пользовательский интерфейс
uk: Інтерфейс користувача

source: Parameter: %s
ru: Параметр: %s
uk: Параметр: %s

source: Attributes
de: Attribute
ru: Атрибуты
uk: Атрибути

source: Unknown
de: Unbekannt
ru: Неизвестный
uk: Невідомий

source: Boolean
de: Logisch
ru: Логический
uk: Логічний

source: -select
de: -Wahl
ru: -выбор
uk: -вибір

source: Parameter attribute ID: '%s' Name: '%s' Type: '%s' Read only: %d
de: Parameterattribut ID: '%s' Name: '%s' Typ: '%s' Nur lesen: %d
ru: Атрибут параметра ID: '%s' Имя: '%s' Тип: '%s' Только чтение: %d
uk: Атрибут параметру ID: '%s' Ім'я: '%s' Тип: '%s' Тільки читання: %d

source: Values:
de: Werte:
ru: Значения:
uk: Значення:

source: Names for selection:
de: Namen zur Auswahl:
ru: Выбираемые имена:
uk: Імена для обрання:

source: Archiving
de: Archivierung
ru: Архивация
uk: Архівація

source: Not selective type!
de: Nicht selektiver Typ!
ru: Не выборочный тип!
uk: Не вибірковий тип!

source: Error writing a value to the archive: %s
de: Fehler beim Schreiben eines Werts in das Archiv: %s
ru: Ошибка записи значения в архив: %s
uk: Помилка запису значення до архіву: %s

source: Attribute does not have an archive
de: Attribut hat kein Archiv
ru: Атрибут не имеет архива
uk: Атрибут не має архіву

source: Very large string for non STL string (> 30 MB)!
de: Sehr große Zeichenfolge für Nicht-STL-Zeichenfolge (> 30 MB)!
ru: Очень большая строка для не STL строки (> 30 МБ)!
uk: Дуже великий рядок для не STL рядку (> 30 МБ)!

source: Error allocating memory for large string (%d)!
de: Fehler beim Zuweisen von Speicher für große Zeichenfolge (%d)!
ru: Ошибка выделения памяти для строки большого размера (%d)!
uk: Помилка виділення пам'яті для рядка великого розміру (%d)!

source: Attempt to double disconnect!
de: Versuch, die Verbindung zu trennen!
ru: Попытка двойного отключения!
uk: Спроба подвійного від'єднання!

source: Error deleting the child '%d'.
de: Fehler beim Löschen des untergeordneten '%d'.
ru: Ошибка удаления потомка '%d'.
uk: Помилка видалення нащадку '%d'.

source: Child '%d' is not allowed.
de: Kind '%d' ist nicht erlaubt.
ru: Потомок '%d' не доступен.
uk: Нащадок '%d' не доступний.

source: Child %s:%d is not found!
de: Kind %s:%d wurde nicht gefunden!
ru: Потомок %s:%d не обнаружен!
uk: Нащадок %s:%d не знайдений!

source: 2:Error opening the file '%s': %s
de: 2:Fehler beim Öffnen der Datei '%s': %s
ru: 2:Ошибка открытия файла '%s': %s
uk: 2:Помилка відкриття файлу '%s': %s

source: 3:Error loading the file '%s'.
de: 3:Fehler beim Laden der Datei '%s'.
ru: 3:Ошибка загрузки файла '%s'.
uk: 3:Помилка завантаження файлу '%s'.

source: Object is not connected to a node of the OpenSCADA tree.
de: Objekt ist nicht mit einem Knoten der OpenSCADA-Baumstruktur verbunden.
ru: Объект не подключен к узлу дерева OpenSCADA.
uk: Об'єкт не підключено до вузла дерева OpenSCADA.

source: Child %d is not present.
de: Kind %d ist nicht vorhanden.
ru: Потомок %d отсутствует.
uk: Нащадок %d відсутній.

source: Child with the attribute %s=%s is not present.
de: Kind mit dem Attribut %s=%s ist nicht vorhanden.
ru: Потомок с атрибутом %s=%s отсутствует.
uk: Нащадок з атрибутом %s=%s відсутній.

source: Unexpected end. Pos: %d
de: Unerwartetes Ende. Pos: %d
ru: Неожиданный конец. Поз: %d
uk: Неочікуваний кінець. Поз: %d

source: No comment block completion. Pos: %d
de: Kein Kommentar Blockende. Pos: %d
ru: Нет окончания блока комментария. Поз: %d
uk: Немає завершення блоку коментаря. Поз: %d

source: Unfinished '!DOCTYPE' block. Pos: %d
de: Unvollendete '! DOCTYPE' zu blockieren. Pos: %d
ru: Незавершённый блок '!DOCTYPE'. Поз: %d
uk: Незавершений блок '!DOCTYPE'. Поз: %d

source: Unfinished '!DOCTYPE [ ]' container. Pos: %d
de: Unvollendete '! DOCTYPE []' Container. Pos: %d
ru: Незавершённый контейнер '!DOCTYPE [ ]'. Поз: %d
uk: Незавершений контейнер '!DOCTYPE [ ]'. Поз: %d

source: Unexpected or error end tag. Pos: %d
de: Unerwarteter oder Fehler End-Tag. Pos: %d
ru: Неожиданный или ошибочный тег завершения. Поз: %d
uk: Неочікуване або помилкове завершення тегу. Поз: %d

source: Unfinished start of comment or unknown block. Pos: %d
de: Unfertig starten Kommentar oder unbekannte blockieren. Pos: %d
ru: Незавершённое начало комментария или неизвестный блок. Поз: %d
uk: Незавершений початок коментарю або невідомий блок. Поз: %d

source: Start tag error. Pos: %d
de: Start-Tag-Fehler. Pos: %d
ru: Ошибка начала тега. Поз: %d
uk: Помилка початку тегу. Поз: %d

source: Unfinished attribute. Pos: %d
de: Unfertig Attribut. Pos: %d
ru: Незавершённый атрибут. Поз: %d
uk: Незавершений атрибут. Поз: %d

source: Unknown entity '%s'. Pos: %d
de: Unbekannte Entität '%s'. Pos: %d
ru: Неизвестная сущность '%s'. Поз: %d
uk: Невідома сутність '%s'. Поз: %d

source: Message archiver is not supported!
de: Nachrichtarchiv wird nicht unterstützt!
ru: Архив сообщений не поддерживается!
uk: Архів повідомлень не підтримується!

source: Value archiver is not supported!
de: Wertearchiv wird nicht unterstützt!
ru: Архив значений не поддерживается!
uk: Архів значень не підтримується!

source: Archives-History
de: Archiv-Geschichte
ru: Архивы-История
uk: Архіви-Історія

source: Function '%s' is not supported!
de: Funktion '%s' wird nicht unterstützt!
ru: Функция '%s' не поддерживается!
uk: Функція '%s' не підтримується!

source: Data Bases
de: Datenbank
ru: Базы Данных
uk: Бази Даних

source: Data Acquisition
de: Datenerfassung
ru: Сбор Данных
uk: Збір Даних

source: %s: No function set!
de: %s: Keine Funktion gesetzt!
ru: %s: Функция не установлена!
uk: %s: Функцію не встановлено!

source: %s: Error with ID or IO %d for the function '%s'!
de: %s: Fehler des Bezeichners oder IO %d für die Funktion %s'!
ru: %s: Ошибка идентификатора или IO %d для функции '%s'!
uk: %s: Помилка ідентифікатору або IO %d для функції '%s'!

source: Modules scheduler
de: Module Scheduler
ru: Диспетчер модулей
uk: Диспетчер модулів

source: Transport Protocols
de: TransportProtokolle
ru: Транспортные Протоколы
uk: Транспортні Протоколи

source: Security
de: Sicherheit
ru: Безопасность
uk: Безпека

source: Specials
de: Zusätze
ru: Специальные
uk: Спеціальні

source: Open Supervisory Control And Data Acquisition
de: Offenes System der Datenüberwachung und Datenerfassung
ru: Открытая система диспетчерского контроля и сбора данных
uk: Відкрита система диспетчерського контролю та збору даних

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: Input transport is not supported!
de: Eingangsübertragung wird nicht unterstützt!
ru: Входной транспорт не поддерживается!
uk: Вхідні транспорти не підтримуються!

source: Output transport is not supported!
de: Ausgangsübertragung wird nicht unterstüzt!
ru: Выходных транспорт не поддерживается!
uk: Вихідні транспорти не підтримуються!

source: User Interfaces
de: Benutzerschnittstellen
ru: Интерфейсы Пользователя
uk: Інтерфейси Користувача

source: New project
de: Neues Projekt
ru: Новый проект
uk: Новий проект
