Repository: aleax/openscada
Catalog: src/po/*.po
Languages: de, ru, uk

source: Station name
de: Stationsnamen
uk: Ім'я станції

source: Version
uk: Версія

source: Operation system
de: Betriebssystem
uk: Операційна система

source: Main CPUs set
de: Wichtigsten CPUs Satz
uk: Основний набір процессорів

source: To set up the processors you use, write a row of numbers separated by a ':' character. Processor numbers start at 0.
de: Für eine Verwendung von CPU gesetzt Schreib Prozessoren Zahlen String mit dem Symbol ':' getrennt. Prozessorsnummer beginnen mit 0.
uk: Для встановлення використовуваних процесорів записуйте рядок номерів, поділених символом ':'. Номера процесорів починаються з 0.

source: Tasks planning clock
de: Aufgaben Uhr Planung
uk: Годинник планування задач

source: To set up phasing of the task invoking in the determined phases number, <= 0 to set optimal, 1 to disable the tasks phasing.
de: Zum Einstellen der Phaseneinstellung der Task, die in der festgelegten Phasennummer aufgerufen wird, <= 0 zum Einstellen des Optimums, 1 zum Deaktivieren der Task-Phaseneinstellung.
uk: Для встановлення фазування виклику задач у визначену кількість фаз, <= 0 для встановлення оптимально, 1 для вимкнення фазування задач.

source: Internal charset
de: Interne Kodierung
uk: Внутрішнє кодування

source: Work DB address in format "{DB module}.{DB name}". Change this field if you want to save or to reload all the program from other DB.
de: Arbeitsdatenbank im Format "{DB Modul}.{DB Name}". Ändern Sie dieses Feld falls Sie eine andere Datenbank laden oder Programm wollen.
uk: Адреса робочої БД у форматі "{Модуль БД}.{Ім'я БД}". Змініть це поле якщо бажаєте зберегти або перевантажити всю програму з іншої БД.

source: Save the program at exit
de: Programm beim Beenden speichern
uk: Зберігати програму при виході

source: Period the program saving
de: Period das Programm speichern
uk: Період збереження програми

source: Use not a zero period (seconds) to periodically save program changes to the DB.
de: Keine Nullperiode (Sekunden) für periodische Speicherung der geänderten Programm in die Datenbank verwenden.
uk: Використати не нульовий період (секунди) для періодичного збереження змін частин програми у БД.

source: Least level
de: Niedrigste Nachrichtenstufe
uk: Найменший рівень

source: Base language of the text variables
de: Basissprache der Textvariablen
uk: Базова мова текстових змінних

source: Enables the multilingual support for text variables in the configuration DBs by selecting the base language. You can select or type here other language besides English(en), but take in your mind that all standard OpenSCADA libraries's formed for the base language English(en), so other base languages will break these DBs at change!
de: Aktiviert die mehrsprachige Unterstützung von Textvariablen in den Konfigurations-DBs durch Auswahl der Basissprache. Sie können hier eine andere Sprache als Englisch (en) auswählen oder eingeben, aber denken Sie daran, dass alle Standard-OpenSCADA-Bibliotheken für die Basissprache Englisch (en) erstellt wurden, sodass andere Basissprachen diese DBs bei Änderung zerstören!
uk: Вмикає підтримку багатомовності текстових змінних у конфігураційних БД через обрання базової мови. Ви можете обрати або ввести іншу мову окрім Англійська(en), але майте на увазі, що всі стандартні бібліотеки OpenSCADA сформовано для базової мови Англійська(en), тож інша базова мова псуватиме ці БД при зміні!

source: Source filter, check for mismatch, pass
uk: Фільтр джерел, перевірка відповідності, пропуск

source: Enable for checking the equal base messages for their translation equality in different sources.
uk: Вмикає перевірку однаковий базових повідомлень на однаковість їх перекладу у різних джерелах.

source: Spent time: %s[%s].
de: Verbrauchte Zeit: %s[%s].
uk: Витрачено часу: %s[%s].

source: <<<Unmatched sources!!!>>>
uk: <<<Незбіг джерел!!!>>>

source: Error the remote host '%s'!
de: Fehler beim Remote-Host '%s'!
uk: Помилка віддаленого хосту '%s'!

source: Error removing the assigned node/connection: %s
de: Fehler beim Entfernen des zugewiesenen Knotens/Verbindung: %s
uk: Помилка видалення призначеного вузла/підключення: %s

source: Error connection the new assigned node: %s
de: Fehler beim Verbinden des neu zugewiesenen Knotens: %s
uk: Помилка підключення нового призначеного вузла: %s

source: Log length and block limit
de: Protokolllänge und Blockbegrenzung
uk: Довжина логу та обмеження блоку

source: Use zero for the log disabling.
de: Verwenden Sie Null für das Protokoll zu deaktivieren.
uk: Використовуйте нуль для вимкнення логу.

source: Established: %s. Last: %s.
de: Etabliert: %s. Zuletzt: %s.
uk: Встановлено: %s. Останнє: %s.

source: ===================== Subsystem "User interfaces" options ===============
de: ============= Optionen des Subsystems "Benutzerschnittstellen" ============
uk: ================= Опції підсистеми "Інтерфейси користувачів" ============
