Repository: aleax/openscada
Catalog: src/moduls/daq/Fastwel/po/*.po
Languages: ru

source: Maxim Kochetkov
ru: Максим Кочетков

source: Fastwel IO FBUS client implementation
ru: Реализация опроса Fastwel IO FBUS

source: FBUS init failed.
ru: Ошибка инициализации FBUS

source: FBUS open net #%d failed.
ru: Ошибка открытия сети FBUS #%d

source: FBUS rescan net #%d failed.
ru: Ошибка сканирования сети #%d

source: FBUS GetNodeDescription net #%d, #id%d failed.
ru: Ошибка FBUS GetNodeDescription net #%d, #id%d

source: DIM762 Parameters table
ru: Таблица параметров DIM762

source: DIM716 Parameters table
ru: Таблица параметров DIM716

source: DIM718 Parameters table
ru: Таблица параметров DIM718

source: AIM791 Parameters table
ru: Таблица параметров AIM791

source: AIM726 Parameters table
ru: Таблица параметров AIM726

source: AIM730 Parameters table
ru: Таблица параметров AIM730

source: AIM725 Parameters table
ru: Таблица параметров AIM725

source: DIM765 Parameters table
ru: Таблица параметров DIM765

source: Acquisition schedule
ru: Планирование сбора

source: Priority of the acquisition task
ru: Приоритет задачи сбора данных

source: Network number
ru: Номер сети

source: Device address
ru: Адрес

source: Debounce
ru: Фильтр дребезга

source: No;200us;3ms
ru: Нет;200uс;3мс

source: Enable counting
ru: Включить счетчик

source: Input range
ru: Диапазон входа

source: 0..5mA;0..20mA;4..20mA
ru: 0..5мА;0..20мА;4..20мА

source: Scan Rate
ru: Период измерения

source: Filter depth
ru: Глубина фильтра

source: 50Hz;500Hz;1000Hz
ru: 50Гц;500Гц;1000Гц

source: Output range
ru: Диапазон выхода

source: 0..20mA;4..20mA
ru: 0..20мА;4..20мА

source: Sensor range
ru: Диапазон входа

source: PT50;PT100;PT200;PT500;PT1000;NI100;NI120;CU100;CU50;0-150 Ohm;0-300 Ohm;0-600 Ohm;0-1500 Ohm; 0-3000 Ohm
ru: PT50;PT100;PT200;PT500;PT1000;NI100;NI120;CU100;CU50;0-150 Ом;0-300 Ом;0-600 Ом;0-1500 Ом; 0-3000 Ом

source: Sensor type
ru: Тип датчика

source: 2-wire;3-wire
ru: 2-х проводный;3-х проводный

source: Type %d
ru: Тип %d

source: No break detection;1K8;2K2;2K7;3K3;3K9;4K7;5K6;6K8;8K2;10K;12K;15K;18K;20K;22K;24K;27K;30K;33K;Type 2
ru: Без контроля;1К8;2К2;2К7;3К3;3К9;4К7;5К6;6К8;8К2;10К;12К;15К;18К;20К;22К;24К;27К;30К;33К;Тип 2

source: Debounce on %d
ru: Фильтр дребезга вкл %d

source: OFF;1.4ms;2.8ms;4.2ms;9.8ms;20ms;50ms;100ms;200ms;300ms
ru: НЕТ;1.4мс;2.8мс;4.2мс;9.8мс;20мс;50мс;100мс;200мс;300мс

source: Debounce off %d
ru: Фильтр дребезга выкл %d

source: Acquisition.
ru: Сбор.

source: Acquisition with the period: %s.
ru: Сбор с периодом: %s.

source: Next acquisition by the cron '%s'.
ru: Следующий cбор по cron '%s'.

source: Break %d
ru: Обрыв %d

source: 1:Parameter disabled.
ru: 1:Параметр отключен.

source: 2:Acquisition stopped.
ru: 2:Сбор остановлен.

source: 0: Normal
ru: 0: Норма

source: 3: Wrong type: %s
ru: 3:Неверный тип: %s
