Repository: aleax/openscada
Catalog: src/moduls/daq/GPIO/po/*.po
Languages: de, ru, uk

source: BCM2835 and newer
de: BCM2835 und neuer
ru: BCM2835 и новее
uk: BCM2835 та новіший

source: Module addition parameters
de: Modulzusatzparameter
ru: Дополнительные параметры модуля
uk: Додаткові параметри модуля

source: Init bcm2835 library error whether that is not bcm2835 or there is not access.
de: Init bcm2835 Bibliothek Fehler, ob das nicht bcm2835 oder es gibt keinen Zugriff.
ru: Ошибка инициализации библиотеки bcm2835 или через отсутствие bcm2835 или доступа к нему.
uk: Помилка ініціалізації бібліотеки bcm2835 чи-то через відсутність bcm2835 чи-то доступу до нього.

source: BCM2835 GPIO is already used.
de: BCM2835 GPIO wird bereits verwendet.
ru: BCM2835 GPIO уже используется.
uk: BCM2835 GPIO вже використаний.

source: SUNXI (ALLWINNER H2 and newer)
de: SUNXI (ALLWINNER H2 und neuer)
ru: SUNXI (ALLWINNER H2 и новее)
uk: SUNXI (ALLWINNER H2 та новіший)

source: Init SUNXI GPIO library error whether that is not SUNXI or there is not access.
de: Init SUNXI GPIO Bibliothek Fehler, ob das nicht SUNXI oder es gibt keinen Zugriff.
ru: Ошибка инициализации библиотеки SUNXI GPIO или через отсутствие SUNXI или доступа к нему.
uk: Помилка ініціалізації бібліотеки SUNXI GPIO чи-то через відсутність SUNXI чи-то доступу до нього.

source: SUNXI GPIO is already used.
de: SUNXI GPIO wird bereits verwendet.
ru: SUNXI GPIO уже используется.
uk: SUNXI GPIO вже використаний.

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: GPIO different single board PCs: Broadcom BCM 2835 and more (Raspberry Pi, ...), SUNXI AllWinner H2 and more (Orange Pi Zero, ...).
de: GPIO verschiedene Single-Board-PCs: Broadcom BCM 2835 und mehr (Raspberry Pi, ...), SUNXI AllWinner H2 und mehr (Orange Pi Zero, ...).
ru: GPIO различных одноплатных ПК: Broadcom BCM 2835 и больше (Raspberry Pi, ...), SUNXI AllWinner H2 и больше (Orange Pi Zero, ...).
uk: GPIO різних одноплатних ПК: Broadcom BCM 2835 та більше (Raspberry Pi, ...), SUNXI AllWinner H2 та більше (Orange Pi Zero, ...).

source: Function '%s' is busy by %d connections.
de: Die Funktion '%s' ist mit %d-Verbindungen besch√§ftigt.
ru: Функция '%s' занята %d подключениями.
uk: Функція '%s' зайнята %d підключеннями.

source: Function
de: Funktion
ru: Функция
uk: Функція

source: Functions
de: Funktionen
ru: Функции
uk: Функції

source: Configuration
de: Konfiguration
ru: Конфигурация
uk: Конфігурація

source: GPIO '%s' output and reverse
de: GPIO '%s' Ausgang und umgekehrt
ru: Выход и инверсия GPIO '%s'
uk: Вихід та інверсія GPIO '%s'

source: Disabled;Input;Input (pull up);Input (pull down);Output
de: Deaktiviert;Eingang;Eingang (Pull-Up);Eingang (Pull-Down);Ausgang
ru: Отключен;Вход;Вход (pull up);Вход (pull down);Выход
uk: Вимкнено;Вхід;Вхід (pull up);Вхід (pull down);Вихід

source: Result
de: Ergebnis
ru: Результат
uk: Результат

source: Pin
de: Stift
ru: Штырь
uk: Штир

source: Setting the input mode: 1-Input,2-Input (pull up),3-Input (pull down),4-Output
de: Einstellen des Eingabemodus: 1-Input,2-Input (Pull-Up),3-Input (Pull-Down),4-Output
ru: Установка режима входа: 1-Вход,2-Вход (pull up),3-Вход (pull down),4-Выход
uk: Встановлення режиму входу: 1-Вхід,2-Вхід (pull up),3-Вхід (pull down),4-Вихід

source: GPIO: Mode
de: GPIO: Modus
ru: GPIO: Режим
uk: GPIO: Режим

source: GPIO mode, input or output.
de: GPIO-Modus, Eingang oder Ausgang.
ru: Режим GPIO, вход или выход.
uk: Режим GPIO, вхід або вихід.

source: GPIO: Get
ru: GPIO: Получить
uk: GPIO: Отримати

source: GPIO get pin level.
de: GPIO erhalten Pin-Level.
ru: Получить уровень штыря GPIO.
uk: Отримати рівень штира GPIO.

source: Value
de: Wert
ru: Значение
uk: Значення

source: GPIO: Put
ru: GPIO: Установить
uk: GPIO: Встановити

source: GPIO put pin level.
de: GPIO setzen Pin-Level.
ru: Установить уровень штыря GPIO.
uk: Встановити івень штира GPIO.
