Repository: aleax/openscada
Catalog: src/moduls/daq/System/po/*.po
Languages: de, ru, uk

source: System
ru: Система
uk: Система

source: Load whole, system, user, idle In %
de: Laden Gesamtes, System, Benutzer, Leerlauf Im %
uk: Навантаження загальне, системне, користувацьке, відсутнє У %

source: Closing the file %p error '%s (%d)'!
de: Schließen der Datei %p Fehler '%s (%d)'!
uk: Помилка закриття файлу %p - '%s (%d)'!

source: Frequency: driver
de: Häufigkeit: Fahrer
uk: Частота: драйвер

source: Frequency: governor
de: Häufigkeit: Gouverneur
uk: Частота: керувач

source: Frequency: current In MHz
de: Frequenz: aktuell In MHz
uk: Частота: поточна У МГц

source: Frequency: minimum, set In MHz
de: Häufigkeit: Minimum, eingestellt In MHz
uk: Частота: мінімум, встановлення У МГц

source: Frequency: maximum, set In MHz
de: Häufigkeit: Maximum, eingestellt In MHz
uk: Частота: максимум, встановлення У МГц

source: Model name
de: Modellname
uk: Назва моделі

source: MHz
uk: МГц

source: BogoMIPS
uk: ПідставніМОЗаС

source: MHz at rdtsc
de: MHz bei rdtsc
uk: МГц за rdtsc

source: General
de: Im allgemein
ru: В общем
uk: Загалом

source: Total (GB)
ru: Всего (ГБ)
uk: Разом (ГБ)

source: Used (GB)
de: Verwendete (GB)
ru: Использовано (ГБ)
uk: Використано (ГБ)

source: Free (GB)
de: Frei (GB)
ru: Свободно (ГБ)
uk: Вільно (ГБ)

source: Total file nodes
de: Gesamte Datei Knoten
ru: Всего файловых узлов
uk: Разом файлових вузлів

source: Used file nodes
de: Verwendete Datei-Knoten
ru: Использовано файловых узлов
uk: Використано файлових вузлів

source: Free file nodes
de: Freie Datei Knoten
ru: Свободно файловых узлов
uk: Вільно файлових вузлів

source: 10:Mountpoint isn't available.
de: 10:Mountpoint ist nicht verfügbar.
ru: 10:Точка монтирования не доступна.
uk: 10:Точка монтування не доступна.

source: Read (B)
de: Gelesen (B)
ru: Прочитано (Б)
uk: Прочитано (Б)

source: Read speed (B/s)
de: Speed Reading (B/s)
ru: Скорость чтения (Б/c)
uk: Швидкість читання (Б/с)

source: Write (B)
de: Geschrieben (B)
ru: Записано (Б)
uk: Записано (Б)

source: Write speed (B/s)
de: Speed Geschrieben (B/s)
ru: Скорость записи (Б/c)
uk: Швидкість запису (Б/с)

source: 10:Device is not available.
de: 10:Das Gerät ist.
ru: 10:Устройство недоступно.
uk: 10:Пристрій недоступний.

source: Name
ru: Имя
uk: Назва

source: Measure unit
de: Masseinheit
ru: Единица измерения
uk: Одиниця виміру

source: Temperature
de: Temperatur
ru: Температура
uk: Температура

source: Parameter Hddtemp
ru: Параметр Hddtemp
uk: Параметр Hddtemp

source: Free (KiB)
de: Frei (KiB)
ru: Свободно (КиБ)
uk: Вільно (КіБ)

source: Total (KiB)
ru: Всего (КиБ)
uk: Разом (КіБ)

source: Used (KiB)
de: Verwendete (KiB)
ru: Использовано (КиБ)
uk: Використано (КіБ)

source: Buffers (KiB)
de: Puffer (KiB)
ru: Буфера (КиБ)
uk: Буфера (КіБ)

source: Cached (KiB)
ru: Кеши (КиБ)
uk: Кеші (КіБ)

source: Swap free (KiB)
de: Swap frei (KiB)
ru: Своп свободно (КиБ)
uk: Своп вільно (КіБ)

source: Swap total (KiB)
ru: Своп всего (КиБ)
uk: Своп загалом (КіБ)

source: Swap used (KiB)
de: Swap benutzt (KiB)
ru: Своп использовано (КиБ)
uk: Своп використано (КіБ)

source: Received (B)
de: Empfangen (B)
ru: Принято (Б)
uk: Прийнято (Б)

source: Receive speed (B/s)
de: Speed Empfangen (B/s)
ru: Скорость приёма (Б/с)
uk: Швидкість прийняття (Б/с)

source: Transmitted (B)
de: Uebermitteln (B)
ru: Передано (Б)
uk: Передано (Б)

source: Transmit speed (B/s)
de: Speed Uebermitteln (B/s)
ru: Скорость передачи (Б/с)
uk: Швидкість передавання (Б/с)

source: Type
de: Typ
uk: Тип

source: Technology
de: Technologie
uk: Технологія

source: Scope
de: Umfang
uk: Простір

source: Present
de: Gegenwart
uk: Наявне

source: Manufacturer, model, SN
de: Hersteller, Modell, SN
uk: Виробник, модель, SN

source: Status
uk: Статус

source: Online
uk: ВМережі

source: Health
de: Gesundheit
uk: Здоров'є

source: Capacity
de: Kapazität
uk: Ємність

source: Capacity level
de: Kapazitätsniveau
uk: Рівень ємності

source: Charge now, full, design In Ah
de: Jetzt aufladen, voll, Design Im Ah
uk: Заряд зараз, повний, дизайн У Аг

source: Energy now, full, design In Ah
de: Energie jetzt, voll, Design Im Ah
uk: Енергія зараз, повна, дизайн У Аг

source: Voltage
de: Voltzahl
uk: Напруга

source: Voltage minimum
de: Voltzahlminimum
uk: Напруга мінімум

source: Cycle count
de: Zyklusanzahl
uk: Кількість циклів

source: Power In Watts
de: Leistung In Watt
uk: Потужність У Ватах

source: Current In mAmpers
de: Aktuell In Ampere
uk: Струм У мАмперах

source: Temperature In degC
de: Temperatur In GradC
uk: Температура У градС

source: Time to empty now, average
de: Zeit zum Entleeren, durchschnittlich
uk: Час спустошення зараз, середній

source: Time to full
de: Zeit, voll zu werden
uk: Час наповнення

source: Charge threshold start, stop
de: Ladeschwelle Start, Stopp
uk: Поріг зарядження початок, зупинка

source: Charge control threshold start, end
de: Ladekontrollschwelle Anfang, Ende
uk: Поріг контролю зарядження початок, кінець

source: Number of file descriptor slots currently
de: Anzahl der aktuellen Dateideskriptor-Slots
uk: Поточна кількість слотів файлових дескрипторів

source: Peak virtual memory size (KiB)
de: Spitzengröße des virtuellen Speichers (KiB)
uk: Піковий розмір віртуальної пам'яті (КіБ)

source: Virtual memory size (KiB)
de: Größe des virtuellen Speichers (KiB)
uk: Розмір віртуальної пам'яті (КіБ)

source: Locked memory size (KiB)
de: Größe des gesperrten Speichers (KiB)
uk: Розмір заблокованої пам'яті (КіБ)

source: Pinned memory size (KiB)
de: Größe des angehefteten Speichers (KiB)
uk: Розмір закріпленої пам'яті (КіБ)

source: Peak resident set size (KiB)
de: Spitzengröße der Residentmenge (KiB)
uk: Піковий розмір резидентного набору (КіБ)

source: Resident set size (KiB)
de: Größe des Resident-Sets (KiB)
uk: Розмір резидентного набору (КіБ)

source: Size of resident anonymous memory (KiB)
de: Größe des residenten anonymen Speichers (KiB)
uk: Розмір резидентної анонімної пам'яті (КіБ)

source: Size of resident file mappings (KiB)
de: Größe der residenten Dateizuordnungen (KiB)
uk: Розмір резидентних файлових мапувань (КіБ)

source: Size of resident shared memory (KiB)
de: Größe des residenten Shared Memory (KiB)
uk: Розмір резидентної спільної пам'яті (КіБ)

source: Size of data segment (KiB)
de: Größe des Datensegments (KiB)
uk: Розмір сегменту даних (КіБ)

source: Size of stack segment (KiB)
de: Größe des Stapelsegments (KiB)
uk: Розмір сегменту стеку (КіБ)

source: Size of text segment (KiB)
de: Größe des Textsegments (KiB)
uk: Розмір сегменту тексту (КіБ)

source: Shared library code size (KiB)
de: Größe des Shared-Library-Codes (KiB)
uk: Розмір коду спільних бібліотек (КіБ)

source: Page table entries size (KiB)
de: Größe der Seitentabelleneinträge (KiB)
uk: Розмір таблиці записів (КіБ)

source: Swapped-out virtual memory size by anonymous private pages (KiB)
de: Größe des ausgelagerten virtuellen Speichers nach anonymen privaten Seiten (KiB)
uk: Розмір віртуальної пам'яті, вилучений анонімними приватними сторінками (КіБ)

source: Size of hugetlb memory portions (KiB)
de: Größe der Hugetlb-Speicherportionen (KiB)
uk: Розмір порцій пам'яті hugetlb (КіБ)

source: Number of threads in process
de: Anzahl der Threads in Bearbeitung
uk: Кількість потоків у процесі

source: State
de: Zustand
ru: Состояние
uk: Стан

source: Connected=%d; Active=%d; Busy=%d; Error=%d
de: Verbunden=%d; Aktiv=%d; Beschäftigt=%d; Fehler=%d
ru: Подключен=%d; Активный=%d; Занятый=%d; Ошибка=%d
uk: Підключений=%d; Активний=%d; Зайнятий=%d; Помилка=%d

source: Property
de: Eigentum
ru: Свойство
uk: Властивість

source: Closing the pipe %p error '%s (%d)'!
de: Schließen der Pipe %p Fehler '%s (%d)'!
uk: Помилка закриття каналу %p - '%s (%d)'!

source: Sensors
de: Sensoren
ru: Сенсоры
uk: Сенсори

source: UPS
de: USV
ru: ИБП
uk: ДБЖ

source: REQ -> '%s'
de: ANF -> '%s'
ru: ЗАПР. -> '%s'
uk: ЗАП. -> '%s'

source: RESP -> '%s'
de: ANTW -> '%s'
ru: ОТВ -> '%s'
uk: ВІДП -> '%s'

source: User
de: Benutzer
ru: Пользователь
uk: Користувач

source: Password
de: Passwort
ru: Пароль
uk: Пароль

source: Full seconds
de: Volle Sekunden
ru: Секунды полные
uk: Секунди повні

source: Seconds
de: Sekunden
ru: Секунды
uk: Секунди

source: Minutes
de: Minuten
ru: Минуты
uk: Хвилини

source: Hours
de: Stunden
ru: Часы
uk: Години

source: Days
de: Tage
ru: Дни
uk: Дні

source: Station
ru: Станция
uk: Станція

source: System DA
de: Systemdatenerfassung
ru: Сбор данных системы
uk: Збір даних системи

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: Provides data acquisition from Operation System. Supported OS Linux data sources: CPU, Memory, Sensors, Disk SMART, Disk Statistic, File System, Network, Power, UPS, Up Time etc.
de: Bietet Datenerfassung vom Betriebssystem. Unterstützte Betriebssystem- Linux-Datenquellen: CPU, Speicher, Sensoren, Disk SMART, Festplattenstatistik, Dateisystem, Netzwerk, Strom, USV, Betriebszeit usw.
uk: Надає збір даних із Операційної Системи. Підтримуються джерела даних ОС Linux: ЦП, Пам'ять, Сенсори, SMART Диску, Статистика Диску, Файлова Система, Мережа, Живлення, ДБЖ, Час Дії та інше.

source: Auto create active data sources
de: Automatisches Erstellen ist aktiv - DA
ru: Авт. создавать активные источники данных
uk: Авт. створювати активні джерела даних

source: Manual;Fast sources;Slow sources;All sources
de: Manuell;Schnelle Quellen;Langsame Quellen;Alle Quellen
ru: Ручной;Быстрые источники;Медленные источники;Все источники
uk: Ручний;Швидкі джерела;Повільні джерела;Всі джерела

source: Table of system parameters
de: Tabelle der Systemparameter
ru: Таблица системных параметров
uk: Таблиця системних параметрів

source: Acquisition schedule
de: Planung der Befragung
ru: Планирование сбора
uk: Планування збору

source: Priority of the acquisition task
de: Priorität der Erwerbsaufgabe
ru: Приоритет задачи получения данных
uk: Пріоритет задачі збору даних

source: Standard
ru: Стандартный
uk: Стандартний

source: System part
de: Systemteil
ru: Часть системы
uk: Частина системи

source: Additional parameters
de: Zusätzlichen Parametern
ru: Дополнительные параметры
uk: Додаткові параметри

source: Acquisition.
de: Erwerb.
ru: Сбор.
uk: Збір.

source: Acquisition with the period %s.
de: Erwerb mit dem Zeitraum %s.
ru: Сбор с периодом %s.
uk: Збір з періодом %s.

source: Next acquisition by the cron '%s'.
de: Erwerb nächsten durch cron '%s'.
ru: Следующий сбор по cron '%s'.
uk: Наступний збір за cron '%s'.

source: Spent time %s[%s].
de: Verbrauchte Zeit %s[%s].
ru: Затрачено времени %s[%s].
uk: Витрачено часу %s[%s].

source: 2:Controller stopped
de: 2:Controller ist angehalten
ru: 2:Контроллер остановлен
uk: 2:Контролер зупинено!

source: 1:Parameter disabled
de: 1:Parameter ist abgeschaltet
ru: 1:Параметр отключен
uk: 1:Параметр вимкнено

source: Error writing value to attribute '%s': %s
de: Fehler beim Schreiben des Werts für das Attribut '%s': %s
ru: Ошибка записи значения в атрибут '%s': %s
uk: Помилка запису значення до атрибуту '%s': %s

source: CPU
de: Prozessor
ru: Процессор
uk: ЦП

source: File System
de: Dateisystem
uk: Файлова Система

source: Disk Statistic
de: Festplattenstatistik
uk: Статистика Диску

source: HDD temperature
de: HDD Temperatur
ru: Температура HDD
uk: Температура HDD

source: HD temperature
de: HD Temperatur
uk: Температура ЖД

source: Memory
de: Speicher
ru: Память
uk: Пам'ять

source: Network
de: Netzwerk
uk: Мережа

source: Power
de: Leistung
uk: Живлення

source: Process
de: Prozess
uk: Процес

source: Qt sensor
uk: Сенсор Qt

source: Disk SMART
de: Festplatte SMART
uk: SMART Диску

source: Up Time
de: Betriebszeit
uk: Час Дії
