Repository: aleax/openscada
Catalog: src/moduls/protocol/UserProtocol/po/*.po
Languages: de, ru, uk

source: User protocol
de: Nutzersprotokoll
ru: Пользовательский протокол
uk: Протокол користувача

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: Allows you to create your own user protocols on an internal OpenSCADA language.
de: Ermöglicht das Erstellen eigener Benutzerprotokolle in einer internen Sprache von OpenSCADA.
ru: Обеспечивает создание собственных пользовательских протоколов на внутреннем языке OpenSCADA.
uk: Забезпечує створення власних протоколів користувача на внутрішній мові OpenSCADA.

source: Identifier
de: Identifikator
ru: Идентификатор
uk: Ідентифікатор

source: Name
ru: Имя
uk: Ім'я

source: Description
de: Beschreibung
ru: Описание
uk: Опис

source: To enable
de: Aktivieren
ru: Включать
uk: Вмикати

source: Representative DAQ template
de: Repräsentative DAQ-Vorlage
ru: Представительский DAQ шаблон
uk: Представницький DAQ шаблон

source: Timeout of a request waiting, milliseconds
de: Wartezeit einer Anforderung, in Millisekunden
ru: Время ожидания запроса, миллисекунд
uk: Час очікування запиту, міллісекунд

source: Input procedure
de: Eingabeverfahren
ru: Входная процедура
uk: Вхідна процедура

source: Output procedure
de: Ausgabeverfahren
ru: Выходная процедура
uk: Вихідна процедура

source: Completely translate the procedure
de: Übersetzen Sie das Verfahren vollständig
ru: Полностью переводить процедуру
uk: Повністю перекладати процедуру

source: Date of modification
de: Änderungsdatum
ru: Дата модификации
uk: Дата модифікації

source: User protocol ID
de: Benutzerprotokoll-ID
ru: Идентификатор пользовательского протокола
uk: Ідентифікатор протоколу користувача

source: Value
de: Wert
ru: Значение
uk: Значення

source: Error searching and creating a new user protocol.
de: Fehler beim Suchen und Erstellen eines neuen Benutzerprotokolls.
ru: Ошибка поиска и создания нового пользовательского протокола.
uk: Помилка пошуку та створення протоколу користувача.

source: Error starting the protocol '%s'.
de: Fehler beim Starten des Protokolls '%s'.
ru: Ошибка запуска протокола '%s'.
uk: Помилка запуску протоколу '%s'.

source: User protocols
de: Nutzersprotkolle
ru: Пользовательские протоколы
uk: Протоколи користувача

source: Protocols
de: Protokolle
ru: Протоколы
uk: Протоколи

source: Size of the accumulated request exceeded for %s, but the user protocol must tend for removing processed data itself. Fix this!
de: Die Größe der angehäuften Anforderung wurde für %s überschritten. Das Benutzerprotokoll muss jedoch zum Entfernen der verarbeiteten Daten selbst ausgewählt werden. Reparieren Sie das!
ru: Размер аккумулированного запроса достиг %s, и протокол пользователя должен обеспечить удаление обработанных данных самостоятельно. Исправьте это!
uk: Розмір акумульованого запиту досяг %s, та протокол користувача має забезпечувати видалення оброблених даних самостійно. Виправте це!

source: The template '%s' does not have one or more required attribute in the needed type. Input part: rez=%d, request=%d, answer=%d. Output part: tr=%d, io=%d. See to the documentation and append their!
de: Die Vorlage '%s' verfügt nicht über ein oder mehrere erforderliche Attribute im erforderlichen Typ: rez=%d, HTTPreq=%d, url=%d, HTTPvars=%d. Eingabeteil: rez=%d, request=%d, answer=%d. Ausgangsteil: tr=%d, io=%d. Sehen Sie sich die Dokumentation an und hängen Sie deren an!
ru: Шаблон '%s' не имеет одного или нескольких необходимых атрибутов в нужных типах. Входная часть: rez=%d, request=%d, answer=%d. Выходная часть: tr=%d, io=%d. Пересмотрите документацию и добавьте их!
uk: Шаблон '%s' не має одного або декількох потрібних атрибутів у потрібних типах. Вхідна частина: rez=%d, request=%d, answer=%d. Вихідна частина: tr=%d, io=%d. Переглянте документацію та додайте їх!

source: Input result
de: Eingabeergebnis
ru: Входной результат
uk: Вхідний результат

source: Input request
de: Eingabeaufforderung
ru: Входной запрос
uk: Вхідний запит

source: Input answer
de: Antwort eingeben
ru: Входной ответ
uk: Вхідна відповідь

source: Input sender
de: Absender eingeben
ru: Входной отправитель
uk: Вхідний відправник

source: Transport
ru: Транспорт
uk: Транспорт

source: Output IO
de: Ausgabe IO
ru: Выходной ВВ
uk: Вихідний ВВ

source: Disabled.
de: Disaktiviert.
ru: Отключен.
uk: Вимкнений.

source: Enabled.
de: Aktiviert.
ru: Включен.
uk: Включений.

source: Requests input %.4g, output %.4g.
de: Eingänge angefragt %.4g, Outputs %.4g.
ru: Запрошено входов %.4g, выходов %.4g.
uk: Запитів вхідних %.4g, вихідних %.4g.

source: User protocol:
de: Nutzersprotokoll:
ru: Пользовательский протокол:
uk: Протокол користувача:

source: State
de: Zustand
ru: Состояние
uk: Стан

source: Status
ru: Состояние
uk: Стан

source: Enabled
de: Aktiviert
ru: Включен
uk: Увімкнений

source: DB
ru: БД
uk: БД

source: Configuration
de: Konfiguration
ru: Конфигурация
uk: Конфігурація

source: DAQ template
de: DAQ-Vorlage
ru: DAQ шаблон
uk: DAQ шаблон

source: Input procedure language
de: Sprache des Eingabeverfahrens
ru: Язык входной процедуры
uk: Мова вхідної процедури

source: Output procedure language
de: Sprache für das Ausgabeverfahren
ru: Язык выходной процедуры
uk: Мова вихідної процедури

source: Input
de: Eingang
ru: Вход
uk: Вхід

source: Use this for the poolling mode enabling through setting this timeout to a nonzero value. Into the poolling mode an input transport will call this protocol with the empty message at no request during this timeout.
ru: Используйте это поле для включения режима пулинга, установкой в ненулевое значение. В режиме пулинга входной транспорт будет вызывать протокол с пустым запросом, в случае отсутствия запроса в течении указанного времени.
uk: Використовуйте це поле для включення режиму пулінгу, встановленням у ненульове значення. У режимі пулінгу вхідний транспорт буде викликати протокол із порожнім запитом, у випадку відсутності запиту протягом визначеного часу.

source: IO
ru: ВВ
uk: ВВ

source: Type
de: Typ
ru: Тип
uk: Тип

source: Real;Integer;Boolean;String;Object
ru: Вещественный;Целый;Логический;Строка;Объект
uk: Реальний;Цілий;Логічний;Рядок;Об'єкт

source: Next attributes define for the input requests processing: 'rez' - result of the processing (false - full request; true - not full request); 'request' - request message; 'answer' - answer message; 'sender' - request sender; 'tr' - sender transport.
ru: Следующие атрибуты определены для обработки входных запросов: 'rez' - результат обработки (false - полный запрос; true - неполный запрос); 'request' - сообщение запроса; 'answer' - сообщение ответа; 'sender' - отправитель запроса; 'tr' - транспорт отправителя.
uk: Наступні атрибути визначені для обробки вхідних запитів: 'rez' - результат обробки (false - повний запит; true - неповний запит); 'request' - повідомлення запиту; 'answer' - повідомлення відповіді; 'sender' - відправник запиту; 'tr' - транспорт відправника.

source: Output
ru: Выход
uk: Вихід

source: Next attributes define for the output requests processing: 'io' - XMLNode object of the input/output interface; 'tr' - associated transport.
de: Folgende Attribute sind für die Bearbeitung von Outputsanfragen bestimmt: 'io' - XMLNode Objekt des Input-/Output-Interfaces; 'tr' - assoziierter Transport.
ru: Следующие атрибуты определены для обработки выходных запросов: 'io' - XMLNode объект интерфейса входа/выхода; 'tr' - ассоциированный транспорт.
uk: Наступні атрибути визначені для обробки вихідних запитів: 'io' - XMLNode об'єкт інтерфейсу входу/виходу; 'tr' - асоційований транспорт.

source: This object
de: Dieses Objekt

source: Scheduling the next service call
de: Terminierung des nächsten Serviceeinsatzes

source: Remove from '%s'
de: Entfernen von '%s'

source: Use this for the polling mode enabling through setting this timeout to a nonzero value. In the polling mode an input transport will call this protocol with the empty message at no request during this timeout.
de: Verwenden Sie dies für die Aktivierung des Abfragemodus, indem Sie dieses Timeout auf einen Wert ungleich Null setzen. Im Polling-Modus ruft ein Eingangstransport dieses Protokoll während dieser Zeitüberschreitung ohne Anforderung mit der leeren Nachricht auf.

source: Next attributes define for the input requests processing: 'rez' - result of the processing (false - full request; true - not full request); 'request' - request message; 'answer' - answer message; 'sender' - request sender; 'tr' - sender transport; 'this' - pointer to object of this protocol; 'schedCall' - scheduling the next service call in the Integer type for seconds.
de: Folgende Attribute sind für die Bearbeitung von Inputsanfragen bestimmt: 'rez' - Ergebnis der Bearbeitung (false - volle Anfrage; true - unvolle Anfrage); 'request' - Anfragenachricht; 'answer' - Antwortsnachricht; 'sender' - Absender der Anfrage; 'tr' - Absender Transport; 'this' - Zeiger auf Objekt dieses Protokolls; 'schedCall' - Planen des nächsten Serviceaufrufs im Integer-Typ für Sekunden.
