Repository: aleax/openscada
Catalog: src/moduls/protocol/SelfSystem/po/*.po
Languages: de, ru, uk

source: Own protocol of OpenSCADA
de: Eigenes Protokoll von OpenSCADA
ru: Собственный протокол OpenSCADA
uk: Власний протокол OpenSCADA

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: Provides own OpenSCADA protocol based at XML and the control interface of OpenSCADA.
de: Stellt ein eigenes OpenSCADA-Protokoll bereit, das auf XML und der Steuerschnittstelle von OpenSCADA basiert.
ru: Предоставляет cобственный протокол OpenSCADA основанный на XML и интерфейсе управления OpenSCADA.
uk: Надає власний протокол OpenSCADA заснований на XML та інтерфейсі керування OpenSCADA.

source: Connections from the user '%s' and the source '%s' reached to the limit %d. Erasing spare!
de: Verbindungen vom Benutzer '%s' und der Quelle '%s' erreichten das Limit %d. Löschen von Ersatz!
ru: Подключения от пользователя '%s' и источника '%s' достигли лимита %d. Удаление лишних!
uk: Підключення від користувача '%s' та джерела '%s' досягли ліміту %d. Видалення зайвих!

source: SES_OPEN request: %d
de: SES_OPEN Antrag: %d
ru: SES_OPEN запрос: %d
uk: SES_OPEN запит: %d

source: Not full response.
de: Nicht vollständige Antwort.
ru: Неполный ответ.
uk: Неповна відповідь.

source: SES_OPEN response: %d
de: SES_OPEN Antwort: %d
ru: SES_OPEN ответ: %d
uk: SES_OPEN відповідь: %d

source: Error the station '%s': %s.
de: Fehler der Station '%s': %s.
ru: Ошибка станции '%s': %s.
uk: Помилка станції '%s': %s.

source: Error the station '%s': error the response format.
de: Fehler bei der Station '%s': Fehler beim Antwortformat.
ru: Ошибка станции '%s': ошибка формата ответа.
uk: Помилка станції '%s': помилка формату відповіді.

source: REQ send: %d
de: REQ senden: %d
ru: REQ отправка: %d
uk: REQ надсилання: %d

source: REQ first response %d
de: REQ Erste Antwort %d
ru: REQ первый ответ %d
uk: REQ перша відповідь %d

source: Error the station '%s' response.
de: Fehler der Station '%s' Antwort.
ru: Ошибка ответа станции '%s'.
uk: Помилка відповіді станції '%s'.

source: Not full respond.
de: Partielles Ansprechen.
ru: Неполный ответ.
uk: Неповна відповідь.

source: REQ full response %d
de: REQ volle Antwort %d
ru: REQ весь ответ %d
uk: REQ повна відповідь %d

source: The response '%s' is not suitable to the request '%s'.
de: Die Antwort '%s' ist nicht für die Anfrage '%s' geeignet.
ru: Ответ '%s' не соответствует запросу '%s'.
uk: Відповідь '%s' не відповідає запиту '%s'.

source: The response sequence %d is not suitable to the request one %d.
de: Die Antwortsequenz %d ist nicht für die Anforderung %d geeignet.
ru: Последовательность ответа %d не соответствует запросу %d.
uk: Послідовність відповіді %d не відповідає запиту %d.

source: Error the request: %s
de: Fehler bei der Anfrage: %s
ru: Ошибка запроса: %s
uk: Помилка запиту: %s

source: Parameters
de: Optionen
ru: Параметры
uk: Параметри

source: State
de: Zustand
ru: Статус
uk: Стан

source: Active authentication sessions
de: Aktive Authentifizierung Sitzungen
ru: Активные сеансы аутентификации
uk: Активні сеанси аутентифікації

source: Module options
de: Optionen des Moduls
ru: Опции модуля
uk: Опції модуля

source: Life time of the authentication session, minutes
de: Lebenszeit der Authentifizierungssitzung, Minuten
ru: Время жизни сеанса аутентификации, минут
uk: Час життя сеансу аутентифікації, хвилин

source: Limit of the connections for one user and host
de: Limit der Verbindungen für einen Benutzer und Host
ru: Предел подключений одного пользователя и хоста
uk: Ліміт підключень одного користувача та хоста

source: Compression level
de: Kompressionsstufe
ru: Уровень компрессии
uk: Рівень компресії

source: ZLib compression level: -1 - optimal speed-size; 0 - disable; 1-9 - direct level.
de: Kompressionsstufe ZLib: -1 - optimale Geschwindigkeit-Grösse; 0 - abgeschaltet; 1-9 - direkte Stufe.
ru: Уровень компрессии ZLib: -1 - оптимальный, скорость-размер; 0 - отключен; 1-9 - прямой уровень.
uk: Рівень компресії ZLib: -1 - оптимальна швидкість-розмір; 0 - вимкнено; 1-9 - прямий рівень.

source: Lower limit of compression
de: Untergrenze der Komprimierung
ru: Нижняя граница компрессии
uk: Нижня межа компресії

source: Value in bytes.
de: Wert in Bytes.
ru: Значение в байтах.
uk: Значення у байтах.

source: Request received: '%s': %d, time: %g ms.
de: Anfrage erhalten: '%s': %d, Zeit: %g ms.
ru: Получен запрос: '%s': %d, время: %g мс.
uk: Отримано запит: '%s': %d, час: %g мс.

source: Request checked and redirected: '%s': %d, time: %g ms.
de: Anfrage aktiviert und umgeleitet: '%s': %d, Zeit: %g ms.
ru: Проверен и перенаправлен запрос: '%s': %d, время: %g мс.
uk: Перевірено та переспрямовано запит: '%s': %d, час: %g мс.

source: Request unpacked and loaded: '%s': %d, time: %g ms.
de: Anfrage entpackt und geladen: '%s': %d, Zeit: %g ms.
ru: Распакован и загружен запрос: '%s': %d, время: %g мс.
uk: Розпаковано та завантажено запит: '%s': %d, час: %g мс.

source: Request processed: '%s', time: %g ms.
de: Anfrage bearbeitet: '%s', Zeit: %g ms.
ru: Обработан запрос: '%s', время: %g мс.
uk: Оброблено запит: '%s', час: %g мс.

source: Response saved to a stream and packed: '%s': %d, time: %g ms.
de: Antwort in einem Stream gespeichert und gepackt: '%s': %d, Zeit: %g ms.
ru: Сохранён ответ в поток и упакован: '%s': %d, время: %g мс.
uk: Збережено відповідь до потоку та запаковано: '%s': %d, час: %g мс.
