Repository: aleax/openscada
Catalog: src/moduls/daq/SMH2Gi/po/*.po
Languages: de, ru, uk

source: Segnetics SMH2Gi and SMH4
de: Segnetics SMH2Gi und SMH4
ru: Segnetics SMH2Gi и SMH4
uk: Segnetics SMH2Gi та SMH4

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: Data acquisition and control by Segnetics SMH2Gi and SMH4 hardware interfaces and modules.
de: Datenerfassung und Steuerung Hardware-Schnittstellen und Module Segnetics SMH2Gi und SMH4.
ru: Сбор данных и управление аппаратными интерфейсами и модулями Segnetics и SMH4.
uk: Збір даних і управління апаратними інтерфейсами та модулями Segnetics SMH2Gi та SMH4.

source: Shared memory parameters
de: Die Parameter gemeinsamen Speicher
ru: Параметры разделяемой памяти
uk: Параметри поділяємої пам'яті

source: MR and MC bus parameters
de: Reifenparameter MR und MC
ru: Параметры шин MR и MC
uk: Параметри шин MR та MC

source: Acquisition schedule
de: Planung der Befragung
ru: Планирование сбора
uk: Планування збору

source: Priority of the acquisition task
de: Priorität der Erfassungsaufgabe
ru: Приоритет задачи сбора данных
uk: Пріоритет задачі збору даних

source: Shared memory variables file
de: Variable Datei in dem gemeinsamen Speicher
ru: Файл переменных в разделяемой памяти
uk: Файл змінних у поділюваній пам'яті

source: MR bus device
de: Busgerat-MR
ru: Устройство шины MR
uk: Пристрої шини MR

source: MC bus device
de: Busgerat-MC
ru: Устройство шины MC
uk: Пристрої шини MC

source: MC device reset GPIO
de: MC-Gerät zurückgesetzt GPIO
ru: GPIO сброса MC устройства
uk: GPIO скидання MC пристрою

source: Request tries
de: Anfrageversuche
ru: Попыток запроса
uk: Спроб запиту

source: Re-enable by Reinit flag for MC/MR module.
de: Reaktivieren von 'Reinit' Flagge für MC/MR-Modul.
ru: Переподключение по флагу "Reinit" модуля MC/MR.
uk: Перепідключення за прапором "Reinit" модуля MC/MR.

source: MR/MC devices *.ini files directry
de: Das Verzeichnis der *.INI-Dateien Geräten MR/MC
ru: Директория с *.ini файлами устройств MR/MC
uk: Тека з *.ini файлами пристроїв MR/MC

source: Acquisition.
de: Erwerb.
ru: Сбор.
uk: Збір.

source: Acquisition with the period %s.
de: Erwerb mit dem Zeitraum %s.
uk: Збір з періодом %s.

source: Next acquisition by the cron '%s'.
de: Erwerb nächsten durch cron '%s'.
ru: Следующий сбор по cron '%s'.
uk: Наступний збір за cron '%s'.

source: Spent time %s.
de: Abgelaufene Zeit %s.
uk: Витрачено часу %s.

source: Error opening GPIO %s for MC reset.
de: Fehler beim Öffnen GPIO %s zurückzusetzen MC.
ru: Ошибка открытия GPIO %s для сброса MC.
uk: Помилка відкриття GPIO %s для скидання MC.

source: Write to gpio94 error!
de: Schreibe auf gpio94 Fehler!
ru: Ошибка записи в gpio94!
uk: Помилка запису до gpio94!

source: Closing the file %d error '%s (%d)'!
de: Schließen der Datei %d Fehler '%s (%d)'!

source: Segnetics SMH2Gi automatic created transport for '%s' bus
de: Automatische Erstellung Verkehr Segnetics SMH2Gi für Bus '%s'
ru: Автоматически созданный транспорт Segnetics SMH2Gi для шины '%s'
uk: Автоматично створений транспорт Segnetics SMH2Gi для шини '%s'

source: ModBUS REQ -> '%s': %s
de: ModBUS Anfrage -> '%s': %s
ru: ModBUS Запрос -> '%s': %s
uk: ModBUS Запит -> '%s': %s

source: 13:Error respond: Too short: %s.
de: 13:Fehler in der Antwort: Zu kurz: %s.
uk: 13:Помилка відповіді: Дуже коротка: %s.

source: 13:Error respond: CRC error: %s.
de: 13:Fehler in der Antwort: Fehler der CRC: %s.
uk: 13:Помилка відповіді: Помилка CRC: %s.

source: ModBUS RESP -> '%s': %s
de: ModBUS Antwort -> '%s': %s
ru: ModBUS Ответ -> '%s': %s
uk: ModBUS Відпов. -> '%s': %s

source: ModBUS ERR -> '%s': %s
de: ModBUS Fehler -> '%s': %s
uk: ModBUS Помилка -> '%s': %s

source: Set <0 for disable the reset.
de: Setzen Sie <0, um den Reset zu deaktivieren.
ru: Установить <0 для отключения сброса.
uk: Встановити <0 для вимкнення скидання.

source: 1:Parameter disabled.
de: 1:Parameter ist abgeschaltet.
ru: 1:Параметр отключен.
uk: 1:Параметр вимкнено.

source: 2:Acquisition stopped.
de: 2:Erwerb ist angehalten.
ru: 2:Сбор остановлен.
uk: 2:Збір зупинено.

source: Variables list
de: Liste der Variablen
ru: Перечень переменных
uk: Перелік змінних

source: SHM Get vals: %s
de: SHM Abrufen des Werts: %s
ru: SHM Получение знач.: %s
uk: SHM Отримання знач.: %s

source: SHM Set value '%s' to '%s' error.
de: SHM Setzen des Wertes '%s' in '%s' Fehler.
ru: SHM Уст. значения '%s' в '%s' ошибка.
uk: SHM Вст. значення '%s' у '%s' помилка.

source: SHM Set val: %s='%s': %d
de: SHM Setzen des Wertes: %s='%s': %d
ru: SHM Уст. значения: %s='%s': %d
uk: SHM Вст. значення: %s='%s': %d

source: Module type
de: Modultyp
ru: Тип модуля
uk: Тип модуля

source: Module slot/address
de: Adresse/platz module
ru: Адрес/слот модуля
uk: Адреса/слот модуля

source: Module addition parameters
de: Zusätzliche Parameter des Moduls
ru: Дополнительные параметры модуля
uk: Додаткові параметри модуля

source: No selected any module type or type '%d' error.
de: Fehler '%d' oder ausgewählten Modultyp.
ru: Ошибка '%d' или не выбран тип модуля.
uk: Помилка '%d' або не обрано тип модуля.

source: Parameters request error: %s.
de: Fehler Parameter-Abfrage: %s.
ru: Ошибка запроса параметров: %s.
uk: Помилка запиту параметрів: %s.

source: Configure device %d but set %d.
de: Konfiguriertes Gerät %d, aber %d gefunden.
ru: Сконфигурировано устройство %d, однако установлено %d.
uk: Сконфігуровано пристрій %d, однак встановлено %d.

source: Send tune request error: %s.
de: Thun Anfrage Fehler beim Senden: %s.
ru: Ошибка отправки тюн-запроса: %s.
uk: Помилка відправлення тюн-запиту: %s.

source: 20:PDU short.
de: 20:PDU kurz.
ru: 20:PDU короткий.
uk: 20:PDU короткий

source: 21:Position lost. Need reload MR/MC bus - re-enable the controller object.
de: 21:Position verloren. Brauchen nachladen MR/MC-Bus - reaktivieren das Controller-Objekt.
ru: 21:Потеря позиции. Необходима перегрузка MR/MC шины - переподключение объекта контроллера.
uk: 21:Втрата позиції. Потрібне перевантаження MR/MC шини - перепідключення об'єкта контролеру.

source: Analog output overload;
de: Analoge Ausgang ist überlastet;
ru: Аналоговый выход перегружен;
uk: Аналоговий вихід перевантажено;

source: No tunes get;
de: Nicht erhalten die Einstellungen;
ru: Не получено настроек;
uk: Не отримано налаштувань;

source: High voltage;
de: Hochspannung;
ru: Высокое напряжение;
uk: Висока напруга;

source: Low voltage;
de: Niederspannung;
ru: Низкое напряжение;
uk: Низька напруга;

source: Internal power supply overvoltage;
de: Überlastete internes Netzteil;
ru: Перегружен внутренний источник питания;
uk: Перевантажено внутрішнє джерело живлення;

source: Unknown MR module type;
de: Unbekannt Modultyp MR;
ru: Неизвестный тип модуля MR;
uk: Невідомий тип модуля MR;

source: -1 - for MC; 0-7 - for MR.
de: -1 - für MC; 0-7 - für MR.
ru: -1 - для MC; 0-7 - для MR.
uk: -1 - для MC; 0-7 - для MR.

source: Configuration
de: Konfiguration
ru: Конфигурация
uk: Конфігурація

source: Digital signals reverse
de: Inversion von Digitalsignalen
ru: Инверсия дискретных сигналов
uk: Інверсія дискретних сигналів

source: <No select>
de: <Nicht ausgewählt>
ru: <Не выбрано>
uk: <Не обрано>

source: Acquisition with the period: %s.
ru: Сбор с периодом: %s.

source: Spent time: %s.
ru: Затрачено времени: %s.

source: 13:Error respond: Too short.
ru: 13:Ошибка ответа: Очень короткий.

source: 13:Error respond: CRC check error.
ru: 13:Ошибка ответа: Ошибка проверки CRC.

source: ModBUS ERR -> %s: %s
ru: ModBUS Ошибка -> %s: %s
