Repository: aleax/openscada
Catalog: src/moduls/bd/FireBird/po/*.po
Languages: de, ru, uk

source: DB FireBird
de: Datenbank FireBird
ru: БД FireBird
uk: БД FireBird

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: DB module. Provides support of the DBMS FireBird.
ru: Модуль БД. Предоставляет поддержку СУБД FireBird.

source: Error dropping the DB '%s': %s
ru: Ошибка удаления БД '%s': %s

source: Error creating the DB '%s': %s
ru: Ошибка создания БД '%s': %s

source: Error opening the table '%s': the DB is disabled.
ru: Ошибка открытия таблицы '%s': БД отключена.

source: The table '%s' is not present.
ru: Таблица '%s' отсутствует.

source: Error starting a transaction: %s
ru: Ошибка открытия транзакции: %s

source: Error committing a transaction: %s
ru: Ошибка осуществления транзакции: %s

source: Error allocating a statement: (%d)%s
ru: Ошибка размещения выражения: (%d)%s

source: Error starting a transaction: (%d)%s
ru: Ошибка открытия транзакции: (%d)%s

source: DSQL: error preparing: (%d)%s
ru: DSQL: ошибка подготовки: (%d)%s

source: DSQL: error describing: (%d)%s
ru: DSQL: ошибка описания: (%d)%s

source: Repeated errors of requesting the DB: %s.
ru: Повторяемые ошибки запроса БД: %s.

source: Error connecting to a DB: %s
ru: Ошибка подключения к БД: %s

source: Error requesting: %s
ru: Ошибка запроса: %s

source: DSQL: error executing: %s
ru: DSQL: ошибка исполнения: %s

source: DSQL: error freeing a statement: %s
ru: DSQL: ошибка освобождения выражения: %s

source: DSQL: error closing a transaction: %s
ru: DSQL: ошибка закрытия транзакции: %s

source: Address to the FireBird DBMS must be written as: "{file};{user};{pass}[;{conTm}]". Where: file - full path to the DB file in the form: "[{host}:]{filePath}"; user - DB user; pass - password of the DB user; conTm- connection timeout, seconds.
ru: Адрес к СУБД FireBird записывается как: "{file};{user};{pass}[;{conTm}]". Где: файл - полный путь к файлу БД в формате: "[{host}:]{filePath}"; пользователь - пользователь БД; пароль - пароль пользователя БД; conTm - таймаут подключения, секунд.

source: The table is empty.
ru: Таблица пуста.

source: The row "%s" is not present. Are you saved the object?
ru: Запись "%s" отсутствует. Вы сохраняли этот объект?

source: DB module. Provides support of the DB FireBird.
de: Modul unterstützt die FireBird Datenbank.
uk: Модуль БД. Надає підтримку БД FireBird.

source: Drop DB '%s' error: %s
de: Datenbank '%s', Fehler: %s beim Abschalten
uk: Помилка видалення БД '%s': %s

source: Create DB '%s' error: %s
de: Datenbank '%s', Fehler %s bei der Erstellung
uk: Помилка створення БД '%s': %s

source: Error open table '%s'. DB is disabled.
de: Fehler beim Öffnen der Tabelle '%s'. Datenbank ist abgeschaltet.
uk: Помилка відкриття таблиці '%s'. БД виключено.

source: Start transaction error: %s
de: Fehler: %s beim Start der Transaktion
uk: Помилка запуску транзакції: %s

source: DSQL close transaction error: %s
de: Fehler beim Schliessen der Transaktion: %s
uk: Помилка закриття транзакції: %s

source: Allocate statement error: (%d)%s
de: Fehler bei der Allokierung: (%d)%s
uk: Помилка розміщення запиту: (%d)%s

source: Start transaction error: (%d)%s
de: Fehler beim Start der Transaktion: (%d)%s
uk: Помилка запуску транзакції: (%d)%s

source: DSQL prepare error: (%d)%s
de: Fehler bei der Vorbereitung DSQL: (%d)%s
uk: Помилка приготування DSQL: (%d)%s

source: DSQL describe error: (%d)%s
de: Fehler bei der Beschreibung DSQL: (%d)%s
uk: Помилка опису DSQL: (%d)%s

source: Connect to DB error: %s
de: Fehler Verbindung zum DB: %s
uk: Помилка підключення до БД: %s

source: Request error: %s
de: Anfrage-Fehler: %s
uk: Помилка запиту: %s

source: DSQL execute error: %s
de: Fehler bei der Ausführung DSQL: %s
uk: Помилка виконання DSQL: %s

source: DSQL free statement error: %s
de: Fehler bei der Freigabe DSQL: %s
uk: Помилка звільнення запиту DSQL: %s

source: FireBird address to DB must be written as: "{file};{user};{pass}[;{conTm}]". Where: file - full path to DB file in form: "[{host}:]{filePath}"; user - DB user; pass - password of DB user; conTm- connection timeout (s).
de: Die Adresse Datenbank FireBird wird geschrieben als: "{file};{user};{pass}[;{conTm}]". Wo: file - vollständigen Pfad zur Datei in DB Form: "[{host}:]{filepath}"; user - Benutzer der Datenbank; pass - Kennwort des Datenbankbenutzers; conTm- Verbindungs-Timeout (s).
uk: Адреса БД FireBird записується таким чином: "{file};{user};{pass}[;{conTm}]". Де: файл - повний шлях до файлу БД у формі: "[{host}:]{filePath}"; користувач - користувач БД; пароль - пароль БД; conTm - таймаут підключення (с).

source: Table '%s' is not present.
de: Tabelle '%s' ist nicht vorhanden.
uk: Таблиця '%s' відсутня.

source: Table is empty.
de: Tabelle ist leer.
uk: Таблиця порожня.

source: Row is not present.
de: Datensatz ist nicht vorhanden.
uk: Запис відсутній.
