Repository: aleax/openscada
Catalog: src/moduls/special/FLibSYS/po/*.po
Languages: de, ru, uk

source: Properties are not supported by the object.
de: Eigenschaften werden vom Objekt nicht unterstützt.
ru: Свойства не поддерживаются объектом.
uk: Властивості не підтримуються об'єктом.

source: Error the function '%s' or missing its parameters.
de: Error die Funktion '%s' oder fehlende Parameter.
ru: Ошибка функции '%s' или недостаточно параметров.
uk: Помилка функції '%s' або недостатньо параметрів.

source: System functions
de: Systemfunktionen
ru: Системные функции
uk: Системні функції

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: Provides a library of the system functions of the user programming area of OpenSCADA.
de: Stellt eine Bibliothek der Systemfunktionen des Benutzerprogrammierbereichs von OpenSCADA zur Verfügung.
ru: Предоставляет библиотеку системных функций среды пользовательского программирования.
uk: Надає бібліотеку системних функцій середовища програмування користувача OpenSCADA.

source: Function
de: Funktion
ru: Функция
uk: Функція

source: Functions
de: Funktionen
ru: Функции
uk: Функції

source: 1:The request is not the object!
de: 1:Die Anfrage ist nicht das Objekt!
ru: 1:Запрос не объект!
uk: 1:Запит не є об'єктом!

source: 1:Error the request: %s
de: 1:Fehler bei der Anfrage: %s
ru: 1:Ошибка запроса: %s
uk: 1:Помилка запиту: %s

source: Result
de: Ergebnis
ru: Результат
uk: Результат

source: Name
ru: Имя
uk: Ім'я

source: From file
de: Aus Datei
ru: Из файла
uk: З файлу

source: Graphical library GD2 images processing.
de: Grafikbibliothek GD2 Bilder Verarbeitung.
ru: Обработка изображений графической библиотекой GD2
uk: Обробка зображень графічною бібліотекою GD2.

source: File name or data (for string stream)
de: Dateiname oder Daten (für String-Stream)
ru: Имя файла или данные (для строкового потока)
uk: Ім'я файлу або дані (для строкового потоку)

source: File access (''-string stream;'r[+]'-read;'w[+]'-write from zero;'a[+]'-append;...)
de: Dateizugriff (''-stringstream; 'r[+]'-lesen;'w[+]'-Schreiben von Null;'a[+]'-Anhängen;...)
ru: Доступ к файлу (''-строковый поток;'r[+]'-чтение;'w[+]'-запись с нуля;'a[+]'-добавление;...)
uk: Доступ до файлу (''-потік рядка;'r[+]'-читання;'w[+]'-запис з нуля;'a[+]'-додання;...)

source: Machine data format ('n'-system order;'b'-BigEndian;'l'-LittleEndian)
de: Maschinendaten Format ('n'-sys Ordnung;'b'-BigEndian;'l'-LittleEndian)
ru: Формат данных машины ('n'-сист. порядок;'b'-BigEndian;'l'-LittleEndian)
uk: Формат даних машини ('n'-сист.послідовн.;'b'-BigEndian;'l'-LittleEndian)

source: String encoding in the file/stream
de: String-Codierung in Datei/Stream
ru: Кодировка строки в файле/потоке
uk: Кодування рядку у файлі/потоці

source: SYS: Input/Output
ru: SYS: Ввод/Вывод
uk: SYS: Ввід/Вивід

source: Input/Output to: file, string stream.
de: Input/Output an: Datei, string.
ru: Ввод/Вывод в: файл, строковый поток.
uk: Ввід/Вивід до: файлу, потік у рядку.

source: Command
de: Kommando
ru: Команда
uk: Команда

source: SYS: Call
de: SYS: Aufruf
ru: SYS: Вызов
uk: SYS: Виклик

source: Calling the console commands of the OS. The function offers great opportunities to the OpenSCADA user by calling any system software, utilities and scripts, as well as getting the access to the huge volume of system data by means of them.
de: Aufruf der Konsolenbefehle des Betriebssystems Die Funktion bietet dem OpenSCADA-Benutzer große Möglichkeiten, indem er beliebige Systemsoftware, Dienstprogramme und Skripte aufruft und über diese den Zugriff auf die riesige Menge an Systemdaten erhält.
ru: Осуществляет вызовы консольных команд ОС. Функция открывает широкие возможности пользователю OpenSCADA, путём вызова любых системных программ, утилит и скриптов, а также получения посредством них доступа к огромному объёму системных данных.
uk: Здійснює виклик консольних команд ОС. Функція відкриває широкі можливості користувачу OpenSCADA, шляхом виклику будь-яких системних програм, утиліт та скриптів, а також отримання за посередництвом них доступу до величезного об'єму системних даних.

source: DB address, "{TypeDB}.{DB}"
de: DB-Adresse, "{TypeDB}.{DB}"
ru: Адрес БД, "{TypeDB}.{DB}"
uk: Адреса БД, "{TypeDB}.{DB}"

source: SQL request
de: SQL Anfrage
ru: SQL запрос
uk: SQL запит

source: Transaction
de: Transaktion
ru: Транзакция
uk: Транзакція

source: DB: SQL request
de: Datenbank: SQL Anfrage
ru: DB: SQL запрос
uk: DB: SQL запит

source: Formation of the SQL-request <req> to the DB <addr>, inside (<trans>=true), outside (<trans>=false) or no matter (<trans>=EVAL) to the transaction. At an error the result's property "err" sets to the error value.
de: Formation der SQL-Anforderung <req> zum DB <addr>, inside (<trans>=true), außerhalb (<trans>=false) oder egal (<trans>=EVAL) zu einer Transaktion. Bei einem Fehler setzt sich die Eigenschaft "err" auf den Fehlerwert.
ru: Формирование SQL-запроса <req> к БД <addr>, внутри (<trans>=true), вне (<trans>=false) или безразлично (<trans>=EVAL) к транзакции. В случае ошибки её значение помещается в свойство "err" результата.
uk: Формування SQL-запиту <req> до БД <addr>, всередині (<trans>=true), назовні (<trans>=false) або без різниці (<trans>=EVAL) до транзакції. У випадку помилки її значення поміщається до властивості "err" результату.

source: Begin time, seconds
de: Beginnen Sie Zeit, Sekunden
ru: Время начала, секунды
uk: Час початку, секунди

source: End time, seconds
de: Endzeit, Sekunden
ru: Время конца, секунды
uk: Час кінця, секунди

source: Category
de: Kategorie
ru: Категория
uk: Категорія

source: Level
de: Stufe
ru: Уровень
uk: Рівень

source: Archiver
de: Archivar
ru: Архиватор
uk: Архіватор

source: Mess: Get
de: Nachricht: Laden
ru: Mess: Получить
uk: Mess: Отримання

source: Get messages of the program.
de: Erhalten Sie Nachrichten des Programms.
ru: Получить сообщения программы.
uk: Отримати повідомлення програми.

source: Message
de: Nachricht
ru: Сообщение
uk: Повідомлення

source: Mess: Put
de: Nachricht: Speichern
ru: Mess: Поместить
uk: Mess: Розмістити

source: Put a message to the program.
de: Legen Sie eine Nachricht an das Programm.
ru: Поместить сообщение в программу.
uk: Розмістити повідомлення до програми

source: String
de: Zeile
ru: Строка
uk: Рядок

source: String: Get size
de: String: Größe erhalten
ru: Строка: Получить размер
uk: Рядок: Отримати розмір

source: Getting size of the string.
de: Größe der Zeichenfolge ermitteln.
ru: Получение размера строки.
uk: Отримання розміру рядка.

source: Position
ru: Позиция
uk: Позиція

source: Number
de: Anzahl
ru: Количество
uk: Кількість

source: String: Get substring
de: String: Subzeile erhalten
ru: Строка: Получить подстроку
uk: Рядок: Отримати частину рядка

source: Getting of the substring.
de: Holen der Teilzeichenkette.
ru: Получение подстроки.
uk: Отримання частини рядка.

source: String to insert
de: Zeichenfolge zum Einfügen
ru: Строка для вставки
uk: Рядок для вставки

source: String: Insert a string to other string
de: String: Fügt einen String in einen anderen String ein
ru: Строка: Вставить строку в другую строку
uk: Рядок: Вставити рядок у інший

source: Inserting a string to another string.
de: Eine Zeichenfolge in eine andere Zeichenfolge einfügen.
ru: Вставка строки в другую строку.
uk: Вставка рядку до іншого рядку.

source: String to replace
de: Zu ersetzende Zeichenfolge
ru: Строка для замены
uk: Рядок для заміни

source: String: Replace a part of the string by another string
de: String: Ersetzen Sie einen Teil des Strings durch einen anderen String
ru: Строка: Заменить часть строки другой строкой
uk: Рядок: Замінити частину рядка іншим

source: Replacing a part of the string by another string.
de: Ersetzen eines Teils der Zeichenfolge durch eine andere Zeichenfolge.
ru: Заменяет часть строки другой строкой.
uk: Заміна частини рядку іншим рядком.

source: Separator
de: Trennzeichen
ru: Разделитель
uk: Розділювач

source: Offset
ru: Смещение
uk: Зміщення

source: String: Parse with a separator
de: String: Parse mit einem Trennzeichen
ru: Строка: Разобрать по разделителю
uk: Рядок: Розібрати за роздільником

source: Parsing the string with a separator.
de: Parsen der Zeichenfolge mit einem Trennzeichen.
ru: Разбор строки по разделителю.
uk: Розбір рядка за роздільником.

source: Path
de: Pfad
ru: Путь
uk: Шлях

source: String: Parse of the path
de: String: Parsen des Pfades
ru: Строка: Разобрать путь
uk: Рядок: Розібрати шлях

source: Parsing of the path for items.
de: Parsen des Pfades für Elemente.
ru: Разбор пути на элементы.
uk: Розбір шляху за елементами.

source: Source
de: Quelle
ru: Источник
uk: Джерело

source: String: Path to separated string
de: String: Pfad in die Zeile mit dem Trennzeichen
ru: Строка: Путь в строку с разделителем
uk: Рядок: Шлях у рядок з роздільником

source: Converting the path to the separated string.
de: Konvertieren des Pfads in die getrennte Zeichenfolge.
ru: Преобразование пути в строку с разделителем.
uk: Перетворення шляху у рядок за роздільником.

source: String: Encode string to HTML
de: String: Kodierung der Zeile in HTML
ru: Строка: Кодировать строку в HTML
uk: Рядок: Кодувати рядок у HTML

source: Encoding the string to use into the HTML source.
de: Codierung der Zeichenfolge, die in der HTML-Quelle verwendet werden soll.
ru: Кодирование строки для использования в исходнике HTML.
uk: Кодування рядку для використання у вихідних HTML.

source: String: Encode text to binary
de: String: Text in Binärcode codieren
ru: Строка: Кодировать текст в бинарный вид
uk: Рядок: Кодувати текст у бінарний вигляд

source: Encoding the text to the binary, for the text format <00 A0 FA DE>.
de: Codierung des Textes in die Binärdatei, für das Textformat <00 A0 FA DE>.
ru: Кодирование текста в бинарный вид, для формата текста <00 A0 FA DE>.
uk: Кодування тексту у бінарний вигляд, для формату тексту <00 A0 FA DE>.

source: String: Decode text from binary
de: String: Text aus Binärcode decodieren
ru: Строка: Декодировать текст из бинарного вида
uk: Рядок: Декодувати текст з бінарного вигляду

source: Decoding the text from the binary, for the text format <00 A0 FA DE>.
de: Decodierung des Textes aus der Binärdatei, für das Textformat <00 A0 FA DE>.
ru: Декодирование текста из бинарного вида, для формата текста <00 A0 FA DE>.
uk: Декодування тексту з бінарного вигляду, для формату тексту <00 A0 FA DE>.

source: Value
de: Wert
ru: Значение
uk: Значення

source: Precision
de: Genauigkeit
ru: Точность
uk: Точність

source: Type
de: Typ
ru: Тип
uk: Тип

source: String: Real to string
de: Zeile: Reelle Zahl in die Zeile
ru: Строка: Вещественное в строку
uk: Рядок: Реальне у рядок

source: Converting the real value to the string format.
de: Konvertieren des realen Werts in das Zeichenfolgenformat.
ru: Преобразование вещественного значения в строковый формат.
uk: Перетворення реального значення у формат рядку.

source: Base (8, 10, 16)
ru: База (8, 10, 16)
uk: База (8, 10, 16)

source: String: Integer to string
de: Zeile: Ganzzahl in die Zeile
ru: Строка: Целое в строку
uk: Рядок: Ціле у рядок

source: Converting the integer value to the string format.
de: Konvertieren des Ganzzahlwerts in das Zeichenfolgenformat.
ru: Преобразование целого значения в строковый формат.
uk: Перетворення цілого значення у формат рядку.

source: String: String to real
de: Zeile: Zeile in die reelle Zahl
ru: Строка: Строка в вещественное
uk: Рядок: Рядок у реальне

source: Converting the string value to the real format.
de: Konvertieren des Zeichenfolgenwerts in das echte Format.
ru: Преобразование значения строки в формат вещественного.
uk: Перетворення значення рядку у формат реального.

source: Base (2...36)
ru: База (2...36)
uk: База (2...36)

source: String: String to integer
de: Zeile: Zeile in die Ganzzahl
ru: Строка: Строку в целое
uk: Рядок: Рядок у ціле

source: Converting the string value to the integer format.
de: Konvertieren des Zeichenfolgenwerts in das Ganzzahlformat.
ru: Преобразование значения строки в формат целого.
uk: Перетворення значення рядку у формат цілого.

source: Word 1
de: Wort 1
ru: Слово 1
uk: Слово 1

source: Word 2
de: Wort 2
ru: Слово 2
uk: Слово 2

source: Float: Split to the words
de: Float: Split zu den Wörtern
ru: Float: Разделить на слова
uk: Float: Поділити на слова

source: Splitting the float value (4 bytes) to the two words (2 bytes).
de: Aufteilen des Float-Wertes (4 Byte) auf die zwei Wörter (2 Byte).
ru: Разделение значения float (4 байта) на два слова (2 байта).
uk: Поділ значення float (4 байтів) на два слова (2 байти).

source: Float: Merge from the words
de: Float: Merge aus den Wörtern
ru: Float: Объединить слова
uk: Float: Поєднати слова

source: Forming the float value (4 bytes) from the two words (2 bytes).
de: Bilden des Float-Werts (4 Bytes) aus den zwei Wörtern (2 Bytes).
ru: Объединение значения float (4 байта) из двух слов (2 байта).
uk: Формування значення float (4 байтів) з двох слів (2 байти).

source: Magnitude
de: Größe
ru: Размер
uk: Розмір

source: Exponent
ru: Экспонента
uk: Експонента

source: Float: Extract
de: Fliesskomma: Extrakt
ru: Float: Извлечь
uk: Float: Вилучити

source: Extracting for mantissa and exponent from the float value.
de: Extrahieren von Mantisse und Exponent aus dem Float-Wert.
ru: Извлечение мантиссы и экспоненты из вещественного значения.
uk: Вилучення мантиси та експоненти з реального значення.

source: Data
de: Daten
ru: Данные
uk: Дані

source: Width
de: Breite
ru: Ширина
uk: Ширина

source: Polynomial
ru: Полином
uk: Поліном

source: Initial
de: Initia
ru: Нач.значение
uk: Поч. значення

source: Reference input
de: Referenzeingang
ru: Последовательность входа
uk: Послідовність входу

source: Reference output
de: Referenzausgang
ru: Последовательность выхода
uk: Послідовність виходу

source: XOR for output
de: XOR für die Ausgabe
ru: XOR для выхода
uk: XOR для виходу

source: Cyclic Redundancy Code (CRC)
ru: Циклический Избыточный Код (CRC)
uk: Циклічний Надмірний Код (CRC)

source: Unified and completed implementing of the Cyclic Redundancy Code for the width in 1-64 bits with normal polynomial, the initial CRC, the input and output reference, and the XOR for output. The previous notation of the function is supported also, where the reversed polynomial is placed in the <width> place!
de: Einheitliche und vollständige Implementierung des zyklischen Redundanzcodes für die Breite in 1-64 Bit mit normalem Polynom, dem anfänglichen CRC, der Eingabe- und Ausgabereferenz, und dem XOR für die Ausgabe. Die vorherige Notation der Funktion wird auch unterstützt, wenn das umgekehrte Polynom gestellt wird an die Stelle <width>!
ru: Унифицированная и полная реализация Циклического Избыточного Кода для длин 1-64 бит с нормальным полиномом, начальным CRC, входной и выходной последовательностью, и XOR для выхода. Также поддерживается предыдущая нотация этой функции, где реверсивный полином размещается в позиции ширины <width>!
uk: Уніфікована та повна реалізація Циклічного Надмірного Коду для ширини 1-64 біт з нормальним поліномом, початковим CRC, вхідною та вихідною послідовністю, та XOR для виходу. Також підтримується попередня нотація цієї функції, де реверсивний поліном розміщується у позиції ширини <width>!

source: Message Digest 5 (MD5)
ru: Слепок сообщения 5 (MD5)
uk: Зліпок повідомлення 5 (MD5)

source: Calculating for the message Digest 5 of the <data>.
de: Berechnung für die Message Digest 5 der <Daten>.
ru: Расчёт слепка сообщения 5 для данных <data>.
uk: Обчислення зліпка повідомлення 5 для даних <data>.

source: Date and time string
de: Zeile für Datum und Zeit
ru: Строка даты и времени
uk: Рядок дати та часу

source: Seconds
de: Sekunden
ru: Секунды
uk: Секунди

source: Date and time format
de: Datum und Zeitenformat
ru: Формат даты и времени
uk: Формат дати та часу

source: Time: String time
de: Zeit: Zeit in die Zeile
ru: Time: Строка времени
uk: Time: Рядок часу

source: Getting the time in the formatted string. Recording of the format corresponds to the POSIX-function "strftime()".
de: Die Uhrzeit in der formatierten Zeichenfolge abrufen. Die Aufzeichnung des Formats entspricht der POSIX-Funktion "strftime()".
ru: Получение времени как форматируемая строка. Запись формата соответствует POSIX-функции "strftime()".
uk: Отримання часу як форматований рядок. Запис формату відповідає POSIX-функції "strftime()".

source: Full seconds
de: Volle Sekunden
ru: Полные секунды
uk: Повні секунди

source: Seconds [0...59]
de: Sekunden [0...59]
ru: Секунды [0...59]
uk: Секунди [0...59]

source: Minutes [0...59]
de: Minuten [0...59]
ru: Минуты [0...59]
uk: Хвилини [0...59]

source: Hours [0...23]
de: Std [0...23]
ru: Часы [0...23]
uk: Години [0...23]

source: Day of the month [1...31]
de: Tag im Monat [1...31]
ru: День месяца [1...31]
uk: День місяця [1...31]

source: Month [0...11]
de: Monat [0...11]
ru: Месяц [0...11]
uk: Місяць [0...11]

source: Year, from 1900
de: Jahr, von 1900
ru: Год, от 1900
uk: Рік, від 1900

source: Day of the week [0...6]
de: Wochentag [0...6]
ru: День недели [0...6]
uk: День тижня [0...6]

source: Day of the year [0...365]
de: Tag im Jahr [0...365]
ru: День в году [0...365]
uk: День у року [0...365]

source: Daylight saving time
de: Sommerzeit
ru: Летнее время
uk: Літній час

source: Time: Date and time
de: Time: Datum und Uhrzeit
ru: Time: Дата и время
uk: Time: Дата та час

source: Full date and time in seconds, minutes, hours, etc., based on the absolute time in seconds from the epoch of 01-01-1970.
de: Vollständiges Datum und Uhrzeit in Sekunden, Minuten, Stunden usw. basierend auf der absoluten Zeit in Sekunden seit der Epoche 01.01.1970.
ru: Полная дата и время в секундах, минутах, часах и т.д., исходя из абсолютного времени в секундах от эпохи 1.1.1970.
uk: Повна дата та час у секундах, хвилинах, годинах та інше, виходячи з абсолютного часу в секундах від епохи 1.1.1970.

source: Microseconds
de: Mikrosekunden
ru: Микросекунды
uk: Мікросекунди

source: Time: Time
de: Zeit: Uhrzeit
ru: Time: Время
uk: Time: Час

source: Getting the full time, in seconds since 01.01.1970, and in microseconds, if <usec> is installed in a non-negative value.
de: Die vollständige Zeit in Sekunden seit dem 01.01.1970 und in Mikrosekunden, wenn <usec> in einem nicht negativen Wert installiert ist.
ru: Получение полного времени, в секундах от 01.01.1970, и микросекундах, если <usec> установлен в неотрицательное значение.
uk: Отримання повного часу, у секундах з 01.01.1970, та мікросекундах, якщо <usec> встановлено у позитивне значення.

source: Time: String to time
de: Zeit: Zeile in Zeit
ru: Time: Строку во время
uk: Time: Рядок у час.

source: Converting the string data and time, for the <form>, to the time in seconds since 01.01.1970.
de: Konvertieren der Stringdaten und der Uhrzeit für <form> in die Zeit in Sekunden seit dem 01.01.1970.
ru: Преобразование строковой даты и времени, для формата <form>, во время в секундах от 01.01.1970.
uk: Перетворення строкового представлення дати та часу, за форматом <form>, у час в секундах з 01.01.1970.

source: Result, seconds
de: Ergebnis, Sekunden
ru: Результат, секунды
uk: Результат, секунди

source: Base time, seconds
de: Anfangszeit Sekunden
ru: Базовое время, секунды
uk: Базовий час, секунди

source: Time: Schedule time at CRON
de: Zeit: Planen Sie die Zeit bei CRON ein
ru: Time: Планировать время по CRON
uk: Time: Планувати час за CRON

source: Scheduling the time at the CRON standard, returning the planned time from the <base> time or from the current time, if the base is not specified.
de: Zeitplanung nach CRON-Standard, Rückgabe der geplanten Zeit von der <base> -Zeit oder von der aktuellen Uhrzeit, wenn die Basis nicht angegeben wird.
ru: Планирование времени по стандарту CRON, возвращая спланированное время начиная от базового времени <base> или от текущего если базовое не указано.
uk: Планування часу за стандартом CRON, повертаючи спланований час починаючи від базового часу <base> або від поточного якщо базовий не вказаний.

source: Time, seconds
de: Zeit, Sekunden
ru: Время, секунды
uk: Час, секунди

source: Time: sleep
de: Zeit: Schlaf
ru: Time: сон
uk: Time: сон

source: Short sleeping from nanoseconds and up to prmInterf_TM (7 seconds).
de: Kurzes Schlafen von Nanosekunden bis zu prmInterf_TM (7 Sekunden).
ru: Короткий сон от наносекунд и до prmInterf_TM (7 секунд).
uk: Короткий сон від наносекунд та до prmInterf_TM (7 секунд).

source: Val: Archive
de: Wert: Archiv speichern.
ru: Val: Архив
uk: Val: Архів

source: Getting the value archive object (VArchObj) through connecting to the archive at its address.
de: Abrufen des Wertarchivobjekts (VArchObj) durch Verbinden mit dem Archiv an seiner Adresse.
ru: Получение объекта архива значений (VArchObj) через подключения к архиву по его адресу.
uk: Отримання об'єкту архіву значень (VArchObj) через підключення до архіву за його адресою.

source: Values type (0-Boolean, 1-Integer, 4-Real, 5-String)
de: Werte typ (0-Boolean, 1-Integer, 4-Real, 5-String)
ru: Тип значений (0-Логический, 1-Целый, 4-Вещественный, 5-Строка)
uk: Тип значень (0-Логічний, 1-Цілий, 4-Реальний, 5-Рядок)

source: Maximum buffer size
de: Maximale Puffergröße
ru: Максимальный размер буфера
uk: Максимальний розмір буферу

source: Values period, microseconds
de: Wertezeitraum, Mikrosekunden
ru: Период значений буфера, микросекунды
uk: Період значень буферу, мікросекунди

source: Hard grid
de: Gitter
ru: Жесткая сетка
uk: Жорстка сітка

source: High time resolution (microseconds)
de: Hohe Zeitauflösung (Mikrosekunden)
ru: Высокое разрешения времени (микросекунды)
uk: Висока роздільна здатність часу (мікросекунди)

source: Val: Archive buffer
de: Wert: Archiv speichern.
ru: Val: Буфер архива
uk: Val: Буфер архіву

source: Getting a value buffer object (VArchObj) for temporary values storing and performing the intermediate operations on frames of data.
de: Abrufen eines Wertpufferobjekts (VArchObj) für temporäre Werte, die Zwischenoperationen für Datenrahmen speichern und ausführen.
ru: Получение объекта буфера значений для временного хранения значений и выполнения промежуточных операций над кадрами данных.
uk: Отримання об'єкту буфера значень для тимчасового збереження значень та виконання проміжних операцій над кадрами даних.

source: XML: Node
de: XML: Knoten
ru: XML: Узел
uk: XML: Вузол

source: Creating a XML node object.
de: Erstellen eines XML-Knotenobjekts.
ru: Создание объекта узла XML.
uk: Створення об'єкту XML вузла.

source: Request
de: Anfrage
ru: Запрос
uk: Запит

source: Station
ru: Станция
uk: Станція

source: XML: Control request
de: XML: Kontrollanfrage
ru: XML: Запрос интерфейса управления
uk: XML: Запит інтерфейсу керування

source: Requesting for control the program, by XML.
de: Aufforderung, das Programm per XML zu steuern.
ru: Запрос на предмет контроля программы, по XML.
uk: Запит щодо контролю програми, за XML.

source: Closing the file %p error '%s (%d)'!
de: Schließen der Datei %p Fehler '%s (%d)'!
