Repository: aleax/openscada
Catalog: src/moduls/daq/LogicLev/po/*.po
Languages: de, ru, uk

source: Logic level
de: Logische Stufe
ru: Логический уровень
uk: Логічний рівень

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: Allow logic level parameters.
de: Ermöglicht Parameter der logischen Stufe.
ru: Предоставляет логический уровень параметров.
uk: Надає логічний рівень параметрів.

source: Parameters table by template
de: Tabelle von Parametern durch Schablone
ru: Таблица параметров по шаблону
uk: Таблиця параметрів за шаблоном

source: Parameters table for reflection
de: Tabelle von Parametern für Reflexion
ru: Таблица параметров для отражения
uk: Таблиця параметрів для відображення

source: Request data period (ms)
de: Datenerfassungsperiode (msek)
ru: Период получения данных (мс)
uk: Період отримання даних (мс)

source: Calculate schedule
de: Berechnung Zeitplan
ru: Планирование вычислений
uk: Політика планування

source: Request task priority
de: Priorität der Anfrage
ru: Уровень приоритета задачи получения данных
uk: Рівень пріоритету задачі отримання даних

source: Logical
de: Logisch
ru: Логический
uk: Логічний

source: Parameter template
ru: Шаблон параметра
uk: Шаблон параметру

source: Parameter ID
de: Bezeichnung des Parameters
ru: Идентификатор параметра
uk: ID параметру

source: Value
de: Wert
ru: Значение
uk: Значення

source: Parameter reflection
de: Parameter Reflexion
ru: Отражение параметра
uk: Відображення параметру

source: Source parameter
de: Ursprung Parameter
ru: Исходный параметр
uk: Вихідний параметр

source: Call now.
de: Rufen Sie jetzt an.
ru: Вызов сейчас.
uk: Виклик зараз.

source: Call by period: %s.
de: Aufruf mit einer Periode: %s.
ru: Вызовы с периодом: %s.
uk: Виклик за періодом: %s.

source: Call next by cron '%s'.
de: Call nächsten durch cron '%s'.
ru: Следующий вызов по cron '%s'.
uk: Наступний виклик за cron '%s'.

source: Spent time: %s.
de: Verbrauchte Zeit: %s.
ru: Затрачено времени: %s.
uk: Витрачено часу: %s.

source: 1:Parameter is disabled.
de: 1:Parameter ist abgeschaltet.
ru: 1:Параметр отключен.
uk: 1:Параметр вимкнено.

source: 2:Controller is stopped.
de: 2:Controller ist angehalten.
ru: 2:Контроллер остановлен.
uk: 2:Контролер зупинено.

source: Parameter is disabled or is not based on the template.
de: Parameter ist abgeschaltet oder basiert nicht auf der Vorlage.
ru: Параметр отключен или не основан на шаблоне.
uk: Параметр вимкнено або він не ґрунтується на шаблоні.

source: Parameter id error.
de: Fehler des Parameterbezeichners.
ru: Ошибка идентификатора параметра.
uk: Помилковий id параметру.

source: Error calculate template.
de: Fehler bei der Berechnung der Vorlage.
ru: Ошибка вычисления шаблона.
uk: Помилка обчислення шаблону.

source: No template parameter or error.
de: Kein Vorlagenparameter oder Fehler.
ru: Ошибка или нешаблонный параметр.
uk: Помилка або нешаблонний параметр.

source: Template configuration
de: Konfiguration der Vorlage
ru: Конфигурация шаблона
uk: Конфігурація шаблону

source: Only attributes are to be shown
de: Nur Attribute zeigen
ru: Показывать только атрибуты
uk: Показувати тільки атрибути

source: Parameters
de: Optionen
ru: Параметры
uk: Параметри

source: Self to self linking error.
de: Fehler beim Anschluss an sich selbst.
ru: Ошибка, подключение самого к себе.
uk: Помилка, рекурсивне підключення.

source: Parameter has no one attribute!
de: Parameter hat kein Attribut!
ru: Параметр не имеет ни одного атрибута!
uk: Параметр не має жодного атрибута!

source: Parameter has not attributes: %s !
de: Parameter hat keine Attribute: %s !
ru: Параметр не имеет атрибутов: %s !
uk: Параметр не має атрибутів: %s !
