Repository: aleax/openscada
Catalog: src/moduls/daq/SoundCard/po/*.po
Languages: de, ru

source: Sound card
de: Soundkarte
ru: Звуковая карта

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко

source: Allow access to sound card data.
de: Zugriff auf Soundkartendata.

source: Parameters' table
de: Tabelle der Parameter

source: Card device
de: Kartengerät
ru: Устройство карты

source: Card sample rate (Hz)
de: Abtastrate der Karte (Hz)
ru: Частота выборки значений карты (Гц)

source: Card sample type
de: Typ Abtasten der Karte
ru: Тип значения выборки

source: Float 32;Int 32;Int 16
de: Fliesskomma 32;Ganzzahl 32;Ganzzahl 16
ru: Веществ. 32;Целый 32;Целый 16

source: Gather task priority
de: Priorität der Datenerfassung

source: Standard
de: Standart
ru: Стандарт

source: Channel
de: Kanal
ru: Канал

source: Value
de: Variable
ru: Значение

source: Allowed %d input channels
de: Verfügbar %d Eingangskanäle

source: Gathering from %d channels. Recieved %.2f MB. Adjusted samplerate %d. Lost frames %g
de: Erfassung von %d Kanälen. Empfangen %.2f MB. Customized Probenahme %d. Verlorenen Frames %g

source: Selected device '%s' is error or default device no allow.
de: Fehler beim ausgewählten Gerät '%s' oder das Standardgerät ist nicht zulässig.

source: No one channel is configured for acquisition.
de: Empfangsskanal ist nicht konfiguriert.

source: Sample type set is error.
de: Fehler Bein Einstellen der Abtastung.

source: Sound input stream is not stopped!
de: Datenerfassung Toneingang ist nicht angehalten!

source: CallBack: Lost frames correct: framesPerBuffer=%lu; sRt=%d; t_sz=%lld; err=%g; diff=%lld.
de: Rückruffunktion: Korrektur Frame-Verlust: framesPerBuffer=%lu; sRt=%d; t_sz=%lld; err=%g; diff=%lld.

source: CallBack: Sound counter difference fix: sRt=%d; dTm=%lld.
de: Rückruffunktion: Klingt Zähler Unterschied fix: sRt=%d; dTm=%lld.

source: Provides an access to the sound card.
ru: Предоставляет доступ к звуковой карте.

source: Table of parameters
ru: Таблица параметров

source: Priority of the acquisition task
ru: Приоритет задачи сбора

source: %d input channels available
ru: Доступно %d входных каналов

source: Acquisition from %d channels, recieved %.2g MB, samplerate corrections %g and the adjusted value %d.
ru: Сбор с %d каналов, получено %.2g МБ, частота выборки скорректирована %g раз на значение %d.

source: Error of the selected device '%s' or default device is not available.
ru: Ошибка выбора устройства '%s' или устройство по умолчанию недоступно.

source: No channel is set up for acquisition.
ru: Не сконфигурировано ни одного канала для сбора.

source: Error setting sample type.
ru: Ошибка установки типа значения.

source: Sound stream is not stopped!
ru: Звуковой входной поток не остановлено!

source: CallBack: Sample rate correction from %g to %g for fix error %ds on time %ds.
ru: CallBack: Корректировка частоты выборки с %g на %g для исправления ошибки %ds на время %ds.
