Repository: aleax/openscada
Catalog: src/moduls/arhiv/FSArch/po/*.po
Languages: de, ru, uk

source: Error compressing for '%s': %d!
de: Fehler beim Komprimieren für '%s': %d!
ru: Ошибка сжатия '%s': %d!
uk: Помилка стиснення '%s': %d!

source: Error decompressing for '%s': %d!
de: Fehler beim Dekomprimieren für '%s': %d!
ru: Ошибка распаковки '%s': %d!
uk: Помилка розпакування '%s': %d!

source: ======================= Module <%s:%s> options ======================= --noArchLimit Disable limit on number of files. Use for archive viewing mode, not for work.
de: ======================= Optionen des Moduls <%s:%s> ======================== --noArchLimit Deaktivieren Sie das Limit für die Anzahl der Dateien. Verwenden Sie für die Archivierung den Anzeigemodus, nicht für die Arbeit.
ru: ======================= Опции модуля <%s:%s> ============================= --noArchLimit Отключить лимит на количество файлов. Используйте для режима просмотра архивов, не для работы.
uk: ======================= Опції модуля <%s:%s> ============================= --noArchLimit Вимкнути обмеження на кількість файлів. Використовуйте для режиму перегляду архівів, не для роботи.

source: Error checking the message archiver '%s'.
de: Fehler beim Überprüfen des Nachrichtenarchivers '%s'.
ru: Ошибка проверки архиватора сообщений '%s'.
uk: Помилка перевірки архіватору повідомлень '%s'.

source: Error checking the value archiver '%s'.
de: Fehler beim Überprüfen des Wertarchivers '%s'.
ru: Ошибка проверки архиватора значений '%s'.
uk: Помилка перевірки архіватору значень '%s'.

source: Cannot create the archive directory '%s'.
de: Das Archivverzeichnis '%s' kann nicht erstellt werden.
ru: Невозможно создать директорию архива '%s'.
uk: Неможливо створити директорію архіву '%s'.

source: Closing the file %d error '%s (%d)'!
uk: Помилка закриття файлу %d - '%s (%d)'!

source: The value archiver '%s' uses the same folder '%s' as an other archiver.
de: Der Wertarchivierer '%s' verwendet denselben Ordner '%s' wie ein anderer Archivierer.
ru: Архиватор значений '%s' использует туже директорию '%s' что и другой.
uk: Архіватор значень '%s' використовую ту саму теку '%s' що й інший.

source: %s: Mess: %s: information
ru: %s: Сообщ.: %s: информация
uk: %s: Повід.: %s: інформація

source: Local information DB for the message archiver '%s'. Created automatically then don't modify, save and remove it!
de: Lokaler Info-DB für den Nachrichtenarchivator '%s'. Automatisch erstellt, dann nicht ändern, speichern und entfernen!
ru: Локальная информационная БД для архиватора сообщений '%s'. Создана автоматически, следовательно не изменяйте, не сохраняйте и не удаляйте её!
uk: Локальна інформаційна БД для архіватору повідомлень '%s'. Створена автоматично, відтак не змінюйте, не зберігайте та не видаляйте її!

source: Archive is not started!
de: Archiv ist nicht gestartet!
ru: Архив не запущен!
uk: Архів не запущено!

source: Error creating a new archive file '%s'!
de: Fehler beim Erstellen einer neuen Archivdatei '%s'!
ru: Ошибка создания файла архива '%s'!
uk: Помилка створення нового архівного файлу '%s'!

source: The archive directory '%s' is not present.
de: Das Archivverzeichnis '%s' ist nicht vorhanden.
ru: Директория архива '%s' отсутствует.
uk: Директорія архіву '%s' відсутня.

source: Overall size of the archiver files
de: Gesamtgröße der Archiver-Dateien
ru: Общий размер файлов архиватора
uk: Загальний розмір файлів архіватору

source: Archiving time
de: Archivierungszeit
ru: Время архивирования
uk: Час архівування

source: Path to a directory for files of messages of the archivator.
de: Pfad zu einem Verzeichnis für Dateien von Meldungen des Archivers.
ru: Путь к директории для файлов архиватора сообщений.
uk: Шлях до теки для файлів архіватору повідомлень.

source: Additional options
de: Zusätzliche Optionen
ru: Дополнительные опции
uk: Додаткові опції

source: Files of the archive in XML
de: Dateien des Archivs in XML
ru: Файлы архивов в XML
uk: Файли архіву у XML

source: Enables messages archiving by files in the XML-format, rather than plain text. Using XML-archiving requires more RAM as it requires full file download, XML parsing and memory holding at the time of use.
de: Ermöglicht die Archivierung von Nachrichten durch Dateien im XML-Format, anstatt Klartext. Die Verwendung von Archivierung im XML-Format erfordert mehr RAM, weil es für das vollständige Herunterladen der Datei benötigt wird, XML-Parsing und Speicherung der Inhalte in den Speicher zum Zeitpunkt der Nutzung.
ru: Включает архивирование сообщений в файлы XML-формата, вместо плоского текста. Использование в архивировании XML-формата требует больше оперативной памяти поскольку необходима полная загрузка файла, XML-разбор и хранение в памяти на момент использования.
uk: Включає архівацію повідомлень до файлів XML-формату, замість плаского тексту. Використання у архівації XML-формату потребує більше оперативної пам'яті оскільки потрібне повне завантаження файлу, XML-розбір та збереження у пам'яті на час використання.

source: Prevent duplicates
de: Duplikate verhindern
ru: Предотвращать дубликаты
uk: Запобігати дублікатам

source: Enables checking for duplicate messages at the time of putting a message into the archive. If there is a duplicate the message does not fit into the archive. This feature some increases the recording time to the archive, but in cases of placing messages in the archive by past time from external sources it allows to eliminate the duplicates.
de: Ermöglicht die Überprüfung auf doppelte Nachrichten zum Zeitpunkt der Einreichung einer Nachricht in das Archiv. Wenn es ein Duplikat gibt, passt die Nachricht nicht in das Archiv. Diese Funktion erhöht die Aufzeichnungszeit zum Archivieren, aber in Fällen der Platzierung von Nachrichten in das Archiv durch vergangene Zeit aus externen Quellen ermöglicht es, die Duplizierung zu beseitigen.
ru: Включает проверку на наличие дублирующих сообщений в момент помещения сообщения в архив. При наличии дубликата сообщение не помещается в архив. Данная функция несколько повышает время записи в архив, но в случаях помещения сообщений в архив обратным числом из внешних источников позволяет исключить дублирование.
uk: Включає перевірку на наявність дублюючих повідомлень в момент розташування повідомлення у архіві. У випадку наявності дублікату повідомлення не розташовується у архіві. Ця функція дещо підвищує час запису до архіву, але у випадках розташування у архіві зворотнім числом та із зовнішніх джерел дозволяє виключити дублювання.

source: Consider duplicates and prevent, for equal time, category, level
de: Betrachten Sie Duplikate und verhindern, für die gleiche Zeit, die Kategorie, Ebene
ru: Считать дубликатами и предотвращать, для равного времени, категории, уровня
uk: Вважати дублікатами та запобігати, для рівного часу, категорії, рівня

source: Enables checking for duplicate messages at the time of putting a message into the archive. As the duplicates there considers messages which equal to time, category and level. If there is a duplicate then the new message will replace the old one into the archive. This feature mostly usable at message text changing in time, for alarm's state to example.
de: Ermöglicht die Überprüfung auf doppelte Nachrichten zum Zeitpunkt der Einreichung einer Nachricht in das Archiv. Als Duplikate bedeuten Meldungen, die gleich Zeit, Kategorie und Ebene sind. Wenn es ein Duplikat gibt, dann wird die neue Nachricht das alte in das Archiv ersetzen. Diese Funktion ist meist verwendbar für Text der Nachrichten, die sich in der Zeit ändern, für den Alarmzustand zum Beispiel.
ru: Включает проверку на наличие дублирующих сообщений в момент помещения сообщения в архив. Дублирующими считаются сообщения с равным временем, категорией и уровнем. Новое дублирующее сообщение заменяет в архиве старое. Данная функция в основном полезна для изменения текста записи сообщения, например, для статуса нарушения.
uk: Включає перевірку на наявність дублюючих повідомлень в момент розташування повідомлення у архіві. Дублюючими вважаються повідомлення із рівним часом, категорією та рівнем. Нове дублююче повідомлення заміняє у архіві старе. Ця функція переважно корисна для зміни тексту запису повідомлення, наприклад, для статусу порушення.

source: Maximum size of archive's file, kB
de: Maximale Größe der Archivdatei, kB
ru: Максимальный размер файла архива, кБ
uk: Максимальний розмір файлу архіву, кБ

source: Sets limit on the size of one archive file. Disabling the restriction can be performed by setting the parameter to zero.
de: Sets begrenzen die Größe einer Archivdatei. Das Deaktivieren der Beschränkung kann durchgeführt werden, indem der Parameter auf Null gesetzt wird.
ru: Устанавливает ограничение на размер одного файла архива. Отключить ограничение можно установив параметр в ноль.
uk: Встановлює обмеження на розмір одного файлу архіва. Виключити обмеження можна встановивши параметр у нуль.

source: Maximum number of the files
de: Maximale Anzahl der Dateien
ru: Максимальное количество файлов
uk: Максимальна кількість файлів

source: Limits the maximum number for files of the archive and additional with the size to single file it determines the size of the archive on disk. Completely removing this restriction can be performed by setting the parameter to zero.
de: Begrenzt die maximale Anzahl für Dateien des Archivs und zusätzlich mit der Größe der einzelnen Datei bestimmt es die Größe des Archivs auf der Festplatte. Das vollständige Entfernen dieser Beschränkung kann durchgeführt werden, indem der Parameter auf Null gesetzt wird.
ru: Ограничивает максимальное количество файлов архива и совместно с размером отдельного файла определяет размер архива на диска. Полностью снять это ограничение можно установив параметр в ноль.
uk: Обмежує максимальну кількість файлів архіву та разом із розміром окремого файлу визначає розмір архіву на диску. Повністю зняти це обмеження можна встановивши параметр у нуль.

source: Time size of the archive files, days
de: Zeitgröße der Archivdateien, Tage
ru: Размер файлов по времени, дней
uk: Розмір файлів за часом, днів

source: Sets limit on the size of single archive file on time.
de: Sets begrenzen die Größe der einzelnen Archivdatei pünktlich.
ru: Устанавливает ограничение на размер одного файла архива по времени.
uk: Встановлює обмеження на розмір одного файлу архіву за часом.

source: Timeout packaging archive files, minutes
de: Zeitüberschreitung beim Packen von Archivdateien, Minuten
ru: Таймаут упаковки файлов архива, минут
uk: Таймаут пакування файлів архіву, хвилин

source: Sets the time after which, in the absence of requests, the archive file will be packaged in a gzip archive. Set to zero for disabling the packing by gzip.
de: Stellt die Zeit ein, nach der in Abwesenheit von Anfragen die Archivdatei in einem gzip-Archiv verpackt wird. Auf Null setzen, um die Verpackung durch gzip zu deaktivieren.
ru: Устанавливает промежуток времени по истечению которого, и в случае отсутствия обращений, файлы архивов будут упаковываться в gzip архив. Установить в ноль для отключения упаковки gzip.
uk: Встановлює проміжок часу за вичерпанням якого, та у випадку відсутності звернень, файли архівів будуть пакуватися у gzip архів. Встановити в нуль для виключення упакування gzip.

source: Period of the archives checking, minutes
de: Zeitraum der Archive Prüfung, Minuten
ru: Период проверки архивов, минут
uk: Період перевірки архівів, хвилин

source: Sets the periodicity of checking the archives for the appearance or deletion files into the archive folder, as well as exceeding the limits and removing old archives files.
de: Sets zur Überprüfung der Häufigkeit der Archive für die Dateien Entstehung oder Löschung in das Verzeichnis des Archivs, sowie Überschreitung der Grenzen und Entfernen für alte Dateien.
uk: Встановлює періодичність перевірки архівів на предмет появи або видалення у теці файлів архівів, а також перевищення лімітів та видалення старих файлів архівів.

source: Use info file for packaged archives
de: Verwenden Sie Info-Datei für verpackte Archiv
ru: Использовать инф. файл для упакованных архивов
uk: Використовувати інф. файл для упакованих архівів

source: Specifies whether to create a file with information about the packed archive files by gzip-archiver. When copying the files of archive to another station, this info file can speed up the target station process of first run by eliminating the need to decompress by gzip-archiver in order to obtain the information.
de: Gibt an, ob eine Datei mit Informationen über die gepackten Archivdateien von gzip-archiver erstellt werden soll. Beim Kopieren von Dateien des Archivs auf eine andere Station kann diese Info-Datei den Zielstationsprozess des ersten Laufes beschleunigen, indem man die Notwendigkeit entzieht, durch gzip-archiver zu dekomprimieren, um die Informationen zu erhalten.
ru: Указывает на необходимость создания файла с информацией о запакованных gzip-архиватором файлах архива. При копировании файлов архива на другую станцию этот информационный файл позволяют ускорить процесс первого запуска целевой станции за счёт исключения необходимости распаковки gzip-архивов для целью получения информации.
uk: Вказує на потребу створення файлу з інформацією про запаковані gzip-архіватором файли архіву. При копіюванні файлів архіву на іншу станцію цей інформаційний файл дозволяє прискорити процес першого запуску цільової станції за рахунок виключення потреби розпакування gzip-архівів для отримання інформації.

source: Check now for the directory of the archiver
de: Überprüfen Sie nun das Verzeichnis des Archivers
ru: Проверить директорию архиватора сейчас
uk: Перевірити директорію архіватору зараз

source: The command, which allows you to immediately start for checking the archives, for example, after some manual changes into the directory of the archiver.
de: Der Befehl, mit dem Sie sofort nach der Überprüfung der Archive beginnen können, z. B. nach einigen manuellen Änderungen in das Archivverzeichnis.
uk: Команда, яка дозволяє запустити перевірку архівів негайно, наприклад, після ручних змін у теці архіватору.

source: Files
de: Dateien
ru: Файлы
uk: Файли

source: Name
ru: Имя
uk: Ім'я

source: Begin
de: Beginn
ru: Начало
uk: Початок

source: End
de: Ende
ru: Конец
uk: Кінець

source: Charset
de: Zeichensatz
ru: Кодировка
uk: Кодування

source: Size
de: Größe
ru: Размер
uk: Розмір

source: Pack
ru: Упак.
uk: Пак.

source: Error
de: Fehler
ru: Ошибка
uk: Помилка

source: Error creating a file '%s': %s(%d).
de: Fehler beim Erstellen einer Datei '%s': %s(%d).
ru: Ошибка создания файла '%s': %s(%d).
uk: Помилка створення файлу '%s': %s(%d).

source: Error header of the file '%s'!
de: Fehlerheader der Datei '%s'!
ru: Ошибка в заголовке файла '%s'!
uk: Помилка у заголовку файла '%s'!

source: Closing the file %p error '%s (%d)'!
uk: Помилка закриття файлу %p - '%s (%d)'!

source: The archive file '%s' is not mine.
de: Die Archivdatei '%s' gehört nicht mir.
ru: Не мой архивный файл '%s'.
uk: Не мій архівний файл: '%s'.

source: Error the archive file '%s'.
de: Fehler in der Archivdatei '%s'.
ru: Ошибка в файле архива '%s'.
uk: Помилка у файлі архіву '%s'.

source: Messages inserting to an error archive file!
de: Nachrichten, die in eine Fehlerarchivdatei einfügen!
ru: Вставка сообщения в архивный файл с ошибкой!
uk: Вставлення повідомлення до архівного файлу з помилкою!

source: The archive file '%s' isn't attached!
de: Die Archivdatei '%s' ist nicht angehängt!
ru: Файл архива '%s' не подключен!
uk: Файл архіву '%s' не під'єднано!

source: Error writing to the archive file '%s': %s(%d)
de: Fehler beim Schreiben in die Archivdatei '%s': %s(%d)
ru: Ошибка записи в файл архива '%s': %s(%d)
uk: Помилка запису до файлу архіву '%s': %s(%d)

source: Messages getting from an error archive file!
de: Nachrichten aus einer Fehlerarchivdatei!
ru: Получение сообщений из архивного файла с ошибкой!
uk: Отримання повідомлень з файлу архіву з помилкою!

source: Archive file isn't attached!
de: Archivdatei ist nicht verbunden!
ru: Файл архива не подключен!
uk: Файл архіву не під'єднано!

source: Error writing to '%s'!
de: Fehler beim Schreiben auf '%s'!
ru: Ошибка записи в '%s'!
uk: Помилка запису до '%s'!

source: %s: Val: %s: information
ru: %s: Знач.: %s: информация
uk: %s: Знач.: %s: інформація

source: Local information DB for the value archiver '%s'. Created automatically then don't modify, save and remove it!
de: Lokaler Info-DB für den Wert Archivierer '%s'. Automatisch erstellt, dann nicht ändern, speichern und entfernen!
ru: Локальная информационная БД для архиватора значений '%s'. Создана автоматически, следовательно не изменяйте, не сохраняйте и не удаляйте её!
uk: Локальна інформаційна БД для архіватору значень '%s'. Створена автоматично, відтак не змінюйте, не зберігайте та не видаляйте її!

source: Unpacking '%s' for information.
de: Entpacken von '%s' für Informationen.
ru: Распаковка '%s' для получения информации.
uk: Розпакування '%s' для отримання інформації.

source: Path to a directory for files to the value archiver.
de: Pfad zu einem Verzeichnis für Dateien zum Wertarchivierer.
ru: Путь к директории для файлов архиватора значений.
uk: Шлях до теки для файлів архіватору значень.

source: Time size of the archive files, hours
de: Zeitgröße der Archivdateien, Stunden
ru: Размер файлов архива по времени, часов
uk: Розмір файлів архіву за часом, годин

source: The parameter is set automatically when changing the periodicity of the values of the archiver and in general proportional to the periodicity of the values of the archiver. WARNING! Large archive files will be longer processed due to the long unpacking of gzip files and primary indexing, while accessing archives is deeply in the history.
de: Der Parameter wird automatisch gesetzt, wenn Sie die Werteperiode durch den Archivierer ändern und generell proportional zur Wertefrequenz des Archivers sind. Aufmerksamkeit! Große Dateien des Archivs werden lange verarbeitet, da es langsames Entpacken für gzip-Dateien und die primäre Indizierung gibt, beim Zugriff auf Teile von tief in den Archiven der Geschichte.
ru: Параметр устанавливается автоматически при смене периодичности значений архиватора и в целом пропорционален периодичности значений архиватора. Внимание! Большие файлы архива будут дольше обрабатываться в виду продолжительной распаковки gzip-файлов и первичной индексации, при доступе к участкам архива глубоко в истории.
uk: Параметр встановлюється автоматично під час зміни періодичності значень архіватору та в цілому э пропорційним до періодичності значень архіватору. Увага! Великі файли архіву будуть довше оброблятися у зв'язку із тривалим розпакуванням gzip-файлів та первинною індексацією, під час доступу до ділянок архіву глибоко у історії.

source: Maximum number of files per archive
de: Maximale Anzahl von Dateien pro Archiv
ru: Максимальное количество файлов одного архива
uk: Максимальна кількість файлів одного архіву

source: Limits the maximum number for files of the archive and additional with the size of single file it determines the size of archive on disk. Completely removing this restriction can be performed by setting the parameter to zero.
de: Begrenzt die maximale Anzahl für Dateien des Archivs und zusätzlich mit der Größe der einzelnen Datei bestimmt es die Größe des Archivs auf der Festplatte. Das vollständige Entfernen dieser Beschränkung kann durchgeführt werden, indem der Parameter auf Null gesetzt wird.
ru: Ограничивает максимальное количество файлов архива и совместно с размером отдельного файла определяет размер архива на диска. Полностью снять это ограничение можно установив параметр в ноль.
uk: Обмежує максимальну кількість файлів архіву та разом із розміром окремого файлу визначає розмір архіву на диску. Повністю зняти це обмеження можна встановивши параметр у нуль.

source: Maximum size of all archives, MB
de: Maximale Größe aller Archive, MB
ru: Максимальный размер всех архивов, МБ
uk: Максимальний розмір всіх архівів, МБ

source: Sets limit to maximum amount of the disk space of all arhive's files of the archiver. The check is carried out with periodicity of checking the archives, as a result, when the limit is exceeded, the oldest files of all archives are removed. To completely remove this restriction you can set it to zero.
de: Sets begrenzen den maximalen Speicherplatz aller arhive-Dateien des Archivers. Die Prüfung führt die periodische Überprüfung der Archive durch, die bei Überschreitung der Grenze für die ältesten Dateien aus allen Archiven resultierte. Um diese Einschränkung vollständig zu entfernen, können Sie sie auf Null setzen.
ru: Устанавливает ограничение на максимально занимаемый объём дискового пространства файлами всех архивов архиватора. Проверка осуществляется с периодичностью проверки архивов, в результате которой, по превышению лимита, производится удаление самых старых файлов всех архивов. Полностью снять это ограничение можно установив параметр в ноль.
uk: Встановлює обмеження на максимально використаний об'єм дискового простору файлами всіх архівів архіватору. Перевірка здійснюється з періодичністю перевірки архівів, в результаті якой, при перевищені ліміту, відбувається видалення най старіших файлів всіх архівів. Повністю зняти це обмеження можна встановивши параметр у нуль.

source: Rounding for numeric values (%)
de: Rundung für numerische Werte (%)
ru: Округление числовых значений (%)
uk: Округлення числових значень (%)

source: Sets the maximum percentage difference between the values of the parameters of the integer and the real types at which they are considered the same and are arranged in the archive as one value, through successive packaging. Allows you to pack lightly changing values beyond the limits of validity. To disable this property you can it set to zero.
de: Setzt den Prozentsatz der Grenzwerte für die Wertdifferenz der Werte in ganzzahlige und reale Typen, bei denen sie als identisch betrachtet werden und als Einzelwert durch die sequentielle Verpackung archiviert werden. Ermöglicht eine gute Verpackung von leicht wechselnden Parametern, die außerhalb der Sicherheit liegen. Um diese Eigenschaft zu deaktivieren, kannst du sie auf Null setzen.
ru: Устанавливает граничный процент различия значений параметров целого и вещественного типов при котором они считаются одинаковыми и помещаются в архив как одно значение, посредством последовательной упаковки. Позволяет хорошо упаковывать слабоменяющиеся значения, за пределами достоверности. Отключить данное свойство можно установив параметр в ноль.
uk: Встановлює граничний відсоток різниці значень параметрів цілого та реального типів при которому вони рахуються однаковими та розташовуються у архіві як одне значення, за посередництвом послідовного упакування. Дозволяє добре упаковувати слабозмінні значення, за межами дійсності. Виключити цю властивість можна встановивши параметр у нуль.

source: Files size
de: Dateiumfang
ru: Размер файлов
uk: Розмір файлів

source: Export
ru: Экспорт
uk: Експорт

source: Archive
de: Archiv
ru: Архив
uk: Архів

source: Type
de: Typ
ru: Тип
uk: Тип

source: To file
de: Zur Datei
ru: В файл
uk: До файлу

source: Period, us
de: Zeit uns
ru: Период, мкс
uk: Період, мкс

source: Unknown
de: Unbekannt
ru: Неизвестный
uk: Невідомий

source: Boolean
ru: Логический
uk: Логічний

source: Int16
ru: Целый16
uk: Цілий16

source: Int32
ru: Целый32
uk: Цілий32

source: Int64
ru: Целый64
uk: Цілий64

source: Float
ru: Веществ.
uk: Реальний

source: Double
ru: Двойной, вещ.
uk: Подвіний, реал.

source: String
ru: Строка
uk: Рядок

source: Error reading parameters of the archive file '%s'!
de: Fehler beim Lesen der Parameter der Archivdatei '%s'!
ru: Ошибка чтения параметров архивного файла '%s'!
uk: Помилка читання параметрів архівного файлу '%s'!
