Repository: aleax/openscada
Catalog: src/moduls/arhiv/FSArch/po/*.po
Languages: de, ru, uk

source: Error parameters of the archive file '%s'!
de: Fehlerparameter der Archivdatei '%s'!
ru: Ошибка параметров архивного файла '%s'!
uk: Помилка параметрів архівного файлу '%s'!

source: Archive file '%s' is not opened!
de: Archivdatei '%s' ist nicht geöffnet!
ru: Файл архива '%s' не открыт!
uk: Файл архіву '%s' не відкрито!

source: Error attaching the file '%s'.
de: Fehler beim Anhängen der Datei '%s'.
ru: Ошибка подключения файла '%s'.
uk: Помилка під'єднання файлу '%s'.

source: Error archive file!
de: Fehler Archivdatei!
ru: Ошибка в файле архива!
uk: Помилка у файлі архіву!

source: Warning! Allocated buffer size %d for indexes lesser for used %d.
de: Achtung! Zugeteilt Puffergröße %d für Indizes geringerem verwendet %d.
ru: Предупреждение! Выделенный размер буфера %d для индексов меньше использованого %d.
uk: Попередження! Виділений розмір %d буферу індексу менше використаного %d.

source: Error writing to the archive '%s' file '%s': %s(%d)
de: Fehler beim Schreiben in die '%s'-Archivdatei '%s': %s(%d)
ru: Ошибка записи в архивный '%s' файл '%s': %s(%d)
uk: Помилка запису до архівного '%s' файлу '%s': %s(%d)

source: Error reading the file '%s' for offset %d!
de: Fehler beim Lesen der Datei '%s' für Offset %d!
ru: Ошибка чтения файла '%s' для смещения %d!
uk: Помилка читання файлу '%s' для зміщення %d!

source: Error writing to the file '%s'!
de: Fehler beim Schreiben in die Datei '%s'!
ru: Ошибка записи в файл '%s'!
uk: Помилка запису до файлу '%s'!

source: Error archive file structure: '%s'. Margin = %d byte. Will try fix that!
de: Fehler in der Dateistruktur: '%s'. Differenz = %d byte. Reparaturversuch!
ru: Ошибка в структуре файла: '%s'. Разница = %d байт. Попробую исправить это!
uk: Помилка структури файлу: '%s'. Різниця = %d байт. Спробую виправити це!

source: Error openning/creating an archive file for the copy here: %s
de: Fehler beim Öffnen/Erstellen einer Archivdatei für die Kopie hier: %s
ru: Ошибка открытия/создания нового файла архива для копирования: %s
uk: Помилка відкриття/створення нового файлу архіву для копіювання: %s

source: Last value for the actual archive file '%s' is not EVAL. Will try fix that!
de: Der letzte Wert für die aktuelle Archivdatei '%s' ist nicht EVAL. Werde versuchen, das zu beheben!
ru: Последнее значение актуального файла архива '%s' не EVAL. Попробую исправить это!
uk: Останнє значення актуального файлу архіву '%s' не EVAL. Спробую виправити це!

source: Archiver on the file system
de: Archiver auf dem Dateisystem
ru: Архиватор на файловую систему
uk: Архіватор на файлову систему

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: The archiver module. Provides functions for messages and values archiving to the file system.
de: Das Archivierungsmodul. Funktionen zum Archivieren von Nachrichten und Werten in dasDateisystem
ru: Модуль архиватора. Предоставляет функции архивирования сообщений и значений на файловую систему.
uk: Модуль архіватору. Надає функції архівації повідомлень та значень на файлову систему.

source: Sets the periodicity of checking the archives for the appearance or deletion files in the archive folder, as well as exceeding the limits and removing old archives files.
ru: Устанавливает периодичность проверки архивов на предмет появления или удаления в директории файлов архивов, а также на превышение лимитов и удаление старых файлов архивов.

source: The command, which allows you to immediately start for checking the archives, for example, after some manual changes in the directory of the archiver.
ru: Команда, которая позволяет запустить проверку архивов немедленно, например, после ручного изменения в директории архиватора.
