Repository: aleax/openscada
Catalog: src/moduls/daq/SNMP/po/*.po
Languages: ru, uk

source: SNMP client
ru: SNMP клиент
uk: SNMP клієнт

source: Roman Savochenko
ru: Роман Савоченко
uk: Роман Савоченко

source: Allow realization of SNMP client service.
ru: Предоставляет реализацию клиентского сервиса протокола SNMP.
uk: Надає реалізацію клієнтського SNMP сервісу.

source: Parameteres table
ru: Таблица параметров
uk: Таблиця параметрів

source: Acquisition schedule
ru: Планирование опроса
uk: Планування опитування

source: Gather task priority
ru: Уровень приоритета задачи сбора данных
uk: Рівень пріоритету задачі збору даних

source: Remote host address
ru: Адрес удалённого хоста
uk: Адреса віддаленого хосту

source: Retries
ru: Попыток
uk: Спроб

source: Timeout (sec)
ru: Время ожидания (сек)
uk: Час очікування (сек)

source: SNMP version
ru: SNMP версия
uk: SNMP версія

source: Server community/user
ru: Сообщество/пользователь сервера
uk: Співтовариство/користувач серверу

source: V3 parameters
ru: V3 параметры
uk: V3 параметри

source: Parameter's attributes limit
ru: Ограничение на количество атрибутов
uk: Обмеження на кількість атрибутів

source: Standard
ru: Стандарт
uk: Стандарт

source: OID list (next line separated)
ru: Список OID (разделение след. строкой)
uk: Перелік OID (поділено наступним рядком)

source: Call now.
ru: Вызов сейчас.
uk: Виклик зараз.

source: Call by period: %s.
ru: Вызовы с периодом: %s.
uk: Виклик за періодом: %s.

source: Call next by cron '%s'.
ru: Следующий вызов по cron '%s'.
uk: Наступний виклик за cron '%s'.

source: Spent time: %s.
ru: Затрачено времени: %s.
uk: Витрачено часу: %s.

source: Error generating Ku from authentication pass phrase.
ru: Ошибка генерации Ku из пароля аутентификации.
uk: Помилка генерації Ku з паролю автентифікації.

source: Error generating Ku from privacy pass phrase.
ru: Ошибка генерации Ku из пароля приватности.
uk: Помилка генерації Ku з паролю приватності.

source: Error SNMP session open.
ru: Ошибка открытия SNMP сессии.
uk: Помилка відкриття SNMP сесії.

source: SNMP agent host in IP address or domain host name. Also you can set port like "localhost:161"
ru: SNMP хост агента в IP адресе или доменном имени хоста. Также Вы можете установить порт, например "localhost:161"
uk: SNMP хост агенту у IP адресі або доменній назві хоста. Також ви можете встановити порт, наприклад "localhost:161"

source: Community group or user.
ru: Группа сообщества или пользователь.
uk: Група спільноти або користувач.

source: Security level
ru: Уровень безопасности.
uk: Рівень безпеки

source: No auth/No privacy;Auth/No privacy;Auth/Privacy
ru: Нет авториз./Нет приватн.;Авториз./Нет приватн.;Авториз./Приватн.
uk: Немає автент./Немає приватн.;Автент./Немає приватн.;Автент./Приватн.

source: Auth
ru: Авторизация
uk: Автентифікація

source: Privacy
ru: Приватность
uk: Приватність

source: ASN type '%d' do not handled.
ru: ASN тип '%d' не поддерживается.
uk: ASN тип '%d' не підтримується.

source: 10:Timeout: No Response from %s.
ru: 10:Истекло время ожидания ответа от %s.
uk: 10:Перевищено час очікування відповіді від %s.

source: SNMP OID list, include directories for get all subitems. OID can write in the methods: ".1.3.6.1.2.1.1" - direct code addressing for object "System"; ".iso.org.dod.internet.mgmt.mib-2.system" - full symbol to direct code addressing for object "System"; "system.sysDescr.0" - simple, not full path, addressing from root alias (object "System"); "SNMPv2-MIB::sysDescr.0" - addressing from MIB base by module name for "system.sysDescr.0".
ru: Список SNMP OID, включая директории для получения подэлементов. OID может быть записан таким образом: ".1.3.6.1.2.1.1" - прямая кодовая адресация для объекта "System"; ".iso.org.dod.internet.mgmt.mib-2.system" - полная символьная к прямой кодовой адресации для объекта "System"; "system.sysDescr.0" - простая, не полным путём, адресация относительно корневого алиаса (объект "System"); "SNMPv2-MIB::sysDescr.0" - адресация из MIB базы от имени модуля для "system.sysDescr.0".
uk: Перелік SNMP OID, включаючи директорії для отримання всіх піделементів. OID може бути записано наступним чином: ".1.3.6.1.2.1.1" - пряма кодова адресація для об'єкту "System"; ".iso.org.dod.internet.mgmt.mib-2.system" - повна символьна для прямої кодової адресації для об'єкта "System"; "system.sysDescr.0" - проста, не повним шляхом, адресація відносно кореневого аліасу (об'єкт "System"); "SNMPv2-MIB::sysDescr.0" - адресація з MIB бази від назви модуля для "system.sysDescr.0".

source: MIB Tree
ru: MIB Дерево
uk: MIB Дерево

source: <<Append current>>
ru: <<Добавить текущий>>

source: 11:No authorized name.
ru: 11:Неавторизированное имя.
uk: 11:Неавторизована назва.

source: OID append
uk: Додати OID
