Repository: aleax/openscada
Catalog: src/moduls/bd/MySQL/po/*.po
Languages: de, ru, uk

source: DB MySQL
ru: БД MySQL
uk: БД MySQL

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: DB module. Provides support of the DBMS MySQL.
de: DB-Modul. Bietet Unterstützung für das DBMS MySQL.
ru: Модуль БД. Предоставляет поддержку СУБД MySQL.
uk: Модуль БД. Надає підтримку СУБД MySQL.

source: Error initializing.
de: Fehler beim Initialisieren.
ru: Ошибка инициализации.
uk: Помилка ініціалізації.

source: Error connecting to the DB: %s
de: Fehler beim Verbinden mit dem DB: %s
ru: Ошибка подключения к БД: %s
uk: Помилка підключення до БД: %s

source: Error querying to the DB: %s
de: Fehler beim Abfragen der DB: %s
ru: Ошибка запроса к БД: %s
uk: Помилка запиту до БД: %s

source: Error opening the table '%s': the DB is disabled.
de: Fehler beim Öffnen der Tabelle '%s': Die DB ist deaktiviert.
ru: Ошибка открытия таблицы '%s'. БД отключена.
uk: Помилка відкриття таблиці '%s': БД вимкнено.

source: Repeated errors of requesting the DB: '%s (%d)'.
de: Wiederholte Fehler beim Anfordern der DB: '%s (%d)'.
ru: Повторяемые ошибки запроса БД: '%s (%d)'.
uk: Повторювані помилки запиту БД: '%s (%d)'.

source: Error connecting to the DB: '%s (%d)'!
de: Fehler beim Verbinden mit dem DB: '%s (%d)'!
ru: Ошибка подключения к БД: '%s (%d)'!
uk: Помилка підключення до БД: '%s (%d)'!

source: Error the query '%s': '%s (%d)'.
de: Fehler bei der Abfrage '%s': '%s (%d)'.
ru: Ошибка запроса '%s': '%s (%d)'.
uk: Помилка запиту '%s': '%s (%d)'.

source: Error querying the DB: '%s (%d)'!
de: Fehler beim Abfragen der DB: '%s (%d)'!
ru: Ошибка запроса БД: '%s (%d)'!
uk: Помилка запиту БД: '%s (%d)'!

source: Error storing the result: %s
de: Fehler beim Speichern des Ergebnisses: %s
ru: Ошибка сохранения результата: %s
uk: Помилка збереження результату: %s

source: Could not execute statement: %s
de: Aussage konnte nicht ausgeführt: %s
ru: Невозможно выполнить выражение: %s
uk: Неможливо виконати заяву: %s

source: MySQL DBMS address must be written as: "{host};{user};{pass};{db};{port}[;{u_sock}[;{charset-collation-engine}[;{tms}]]]". Where: host - hostname on which the DBMS server MySQL works; user - user name of the DB; pass - password of the user for accessing the DB; db - name of the DB; port - port, which listening by the DBMS server (default 3306); u_sock - UNIX-socket name, for local accessing to the DBMS (/var/lib/mysql/mysql.sock); charset-collation-engine - DB charset, collation and storage engine for CREATE DATABASE and SET; tms - MySQL timeouts in the form "{connect},{read},{write}" and in seconds. For local DBMS: ";user;password;OpenSCADA;;/var/lib/mysql/mysql.sock;utf8-utf8_general_ci-MyISAM;5,2,2". For remote DBMS: "server.nm.org;user;password;OpenSCADA;3306".
de: Die MySQL-DBMS-Adresse muss als geschrieben werden: "{host};{user};{pass};{db};{port}[;{u_sock}[;{charset-collation-engine}[;{tms}]]]". Wo: host - Hostname, auf dem der DBMS Server MySQL arbeitet; user - Name des Datenbankbenutzers; pass - Kennwort des Datenbankbenutzers; db - Name der Datenbank; port - Port, der vom DBMS-Server überwacht wird (Default 3306); u_sock - UNIX-Socket-Name für den lokalen Zugriff auf das DBMS (/var/lib/mysql/mysql.sock). charset-collation-engine - DB Zeichensatz, Kollation und Speicher-Engine für CREATE DATABASE und SET; tms - MySQL-Timeouts in Form "{connect},{read},{write}" und in Sekunden. Für lokale DBMS: ";user;password;OpenSCADA;;/var/lib/mysql/mysql.sock;utf8-utf8_general_ci-MyISAM;5,2,2". Für entfernte DBMS: "server.nm.org;user;password;OpenSCADA;3306".
ru: Адрес СУБД MySQL записывается в виде: "{host};{user};{pass};{db};{port}[;{u_sock}[;{charset-collation-engine}[;{tms}]]]". Где: host - имя хоста на котором работает сервер СУБД MySQL; user - имя пользователя БД; pass - пароль пользователя для доступа к БД; db - имя БД; port - порт, который слушает сервер СУБД (по умолчанию 3306); u_sock - имя UNIX-сокета в случае локального доступа к СУБД (/var/lib/mysql/mysql.sock); charset-collation-engine - таблица символов, режим сравнения и движок хранилища БД для CREATE DATABASE и SET; tms - таймауты MySQL в формате "{connect},{read},{write}" и секундах. Для локальной СУБД: ";user;password;OpenSCADA;;/var/lib/mysql/mysql.sock;utf8-utf8_general_ci-MyISAM;5,2,2". Для удалённой СУБД: "server.nm.org;user;password;OpenSCADA;3306".
uk: Адреса СУБД MySQL записується таким чином: "{host};{user};{pass};{db};{port}[;{u_sock}[;{charset-collation-engine}[;{tms}]]]". Де: host - ім'я хосту на якому працює сервер СУБД MySQL; user - ім'я користувача БД; pass - пароль користувача для доступу до БД; db - ім'я БД; port - порт, який слухає сервер СУБД (по замовченню 3306); u_sock - ім'я UNIX-сокету, у випадку локального доступу до СУБД (/var/lib/mysql/mysql.sock); charset-collation-engine - таблиця символів, режим порівняння та рущій сховища БД для CREATE DATABASE та SET; tms - таймаути MySQL у форматі "{connect},{read},{write}" та секундах. Для локальної СУБД: ";user;password;OpenSCADA;;/var/lib/mysql/mysql.sock;utf8-utf8_general_ci-MyISAM;5,2,2". Для віддаленої СУБД: "server.nm.org;user;password;OpenSCADA;3306".

source: Close opened transaction
de: Geöffnete Transaktion schlissen
ru: Закрыть открытую транзакцию
uk: Закрити відкриту транзакцію

source: Table is empty!
de: Tabelle ist leer!
ru: Таблица пуста!
uk: Таблиця порожня!

source: The row "%s" is not present. Are you saved the object?
de: Datensatz "%s" ist nicht vorhanden! Sind Sie das Objekt gespeichert?
ru: Запись "%s" отсутствует! Вы сохраняли этот объект?
uk: Запис "%s" відсутній! Ви зберігали цей об'єкт?
