Repository: aleax/openscada
Catalog: src/moduls/special/SystemTests/po/*.po
Languages: de, ru, uk

source: OpenSCADA and its modules' tests
de: Tests von OpenSCADA und seinen Modulen
ru: Тесты OpenSCADA и её модулей
uk: Тести OpenSCADA та її модулів

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: Provides the group of tests to OpenSCADA and its modules.
de: Stellt die Testgruppe den OpenSCADA- und it-Modulen zur Verfügung.
ru: Предоставляет группу тестов для OpenSCADA и её модулей.
uk: Надає групу тестів для OpenSCADA та її модулів.

source: ======================= Module <%s:%s> options ======================= ---- Parameters of the module section '%s' of the configuration file ---- *** Main options of all the tests *** id test id; on flag enabling test; per period of repeating, seconds. *** Test options ***
de: ========================== Optionen des Moduls <%s:%s> ========================== ------ Parameter des Modulabschnitts '%s' der Konfigurationsdatei ------ *** Gemeinsame Optionen von allen Testen *** id Test-ID; on Flag-Aktivierungstest; per Wiederholungszeitraum, Sekunden. *** Optionen der Teste ***
ru: ========================== Опции модуля <%s:%s> ========================== ------ Параметры модульной секции '%s' конфигурационного файла ------ *** Общие опции всех тестов *** id идентификатор теста; on флаг включения теста; per период повторения, секунд. *** Опции тестов ***
uk: ========================== Опції модуля <%s:%s> ========================== ------ Параметри модульної секції '%s' конфігураційного файлу ------ *** Загальні опції всіх тестів *** id ідентифікатор тесту; on прапор ввімкнення тесту; per період повтору, секунд. *** Опції тестів ***

source: %s{%d "%s", text "%s", childs - %d.
de: %s{%d "%s", Text "%s", der Nachkommen - %d.
ru: %s{%d "%s", текст "%s", потомков - %d.
uk: %s{%d "%s", текст "%s", нащадків - %d.

source: Attr "%s" = "%s".
de: Attribut "%s" = "%s".
ru: Атрибут "%s" = "%s".
uk: Атрибут "%s" = "%s".

source: Test
ru: Тест
uk: Тест

source: Tests
de: Teste
ru: Тесты
uk: Тести

source: Number
de: Zahl
ru: Количество
uk: Кількість

source: All: %d; Accessed: %d
de: Alle: %d; Zugriff: %d
ru: Все: %d; Доступны: %d
uk: Загалом: %d; Доступно: %d

source: Result
de: Resultat
ru: Результат
uk: Результат

source: Value archive
de: Archiv der Werte
ru: Архив значений
uk: Архів значень

source: Period of the values, microseconds
de: Periode der Werte, Mikrosekunden
ru: Период значений, микросекунды
uk: Період значень, мікросекунди

source: Archiver
de: Archivator
ru: Архиватор
uk: Архіватор

source: Test of location in the value archives. Contains 7(8) tests of the value archiver to verify the correct functioning of the sequential packing mechanism.
de: Test des Standorts in den Wertarchiven. Enthält 7(8) Tests des Wertarchivers, um die korrekte Funktionsweise des sequentiellen Packmechanismus zu überprüfen.
ru: Тест размещения в архиве значений. Содержит 7(8) тестов архиватора значений на проверку корректности функционирования последовательного механизма упаковки.
uk: Тест розташування у архіві значень. Містить 7(8) тестів архіватора значень на перевірку коректності функціонування послідовного механізму упакування.

source: Test: Start
ru: Тест: Запуск
uk: Тест: Запуск

source: Test1: Simple fill and check archive.
de: Test1: Einfache Aufname und Prüfung des Archivs.
ru: Тест1: Простое заполнение и проверка архива.
uk: Тест1: Просте заповнення та перевірка архіву.

source: Test1: Failed.
de: Test1: Fehler.
ru: Тест1: Ошибка.
uk: Тест1: Помилка.

source: Test1: Passed.
de: Test1: Gemacht.
ru: Тест1: Пройден.
uk: Тест1: Виконано.

source: Test2: Internal insert for double value (to down).
de: Test2: Innerer Einsatz des reellen Wertes (nach unten).
ru: Тест2: Внутренняя вставка вещественного значения (вниз).
uk: Тест2: Внутрішня вставка реального значення (до долу).

source: Test2: Failed.
de: Test2: Fehler.
ru: Тест2: Ошибка.
uk: Тест2: Помилка.

source: Test2: Passed.
de: Test2: Gemacht.
ru: Тест2: Пройден.
uk: Тест2: Виконано.

source: Test3: Internal insert for double value (to up).
de: Test3: Innerer Einsatz des reellen Wertes (nach oben).
ru: Тест3: Внутренняя вставка вещественного значения (вверх).
uk: Тест3: Внутрішня вставка реального значення (до гори).

source: Test3: Failed.
de: Test3: Fehler.
ru: Тест3: Ошибка.
uk: Тест3: Помилка.

source: Test3: Passed.
de: Test3: Gemacht.
ru: Тест3: Пройден.
uk: Тест3: Виконано.

source: Test4: Internal insert for double value (to down).
de: Test4: Innerer Einsatz des reellen Wertes (nach oben).
ru: Тест4: Внутренняя вставка вещественного значения (вверх).
uk: Тест4: Внутрішня вставка реального значення (до долу).

source: Test4: Failed.
de: Test4: Fehler.
ru: Тест4: Ошибка.
uk: Тест4: Помилка.

source: Test4: Passed.
de: Test4: Gemacht.
ru: Тест4: Пройден.
uk: Тест4: Виконано.

source: Test5: Internal insert for not double value.
de: Test5: Innerer Einsatz des reellen Wertes.
ru: Тест5: Внутренняя вставка не вещественного значения.
uk: Тест5: Внутрішня вставка не реального значення.

source: Test5: Failed.
de: Test5: Fehler.
ru: Тест5: Ошибка.
uk: Тест5: Помилка.

source: Test5: Passed.
de: Test5: Gemacht.
ru: Тест5: Пройден.
uk: Тест5: Виконано.

source: Test6: Internal insert for double value (to up).
de: Test6: Innerer Einsatz des reellen Wertes (nach oben).
ru: Тест6: Внутренняя вставка вещественного значения (вверх).
uk: Тест6: Внутрішня вставка реального значення (до гори).

source: Test6: Failed.
de: Test6: Fehler.
ru: Тест6: Ошибка.
uk: Тест6: Помилка.

source: Test6: Passed.
de: Test6: Gemacht.
ru: Тест6: Пройден.
uk: Тест6: Виконано.

source: Test7: Internal insert for a value instead double value.
de: Test7: Innerer Einsatz des Wertes statt des reellen.
ru: Тест7: Внутренняя вставка значения вместо вещественного.
uk: Тест7: Внутрішня вставка значення замість реального значення.

source: Test7: Failed
de: Test7: Fehler.
ru: Тест7: Ошибка.
uk: Тест7: Помилка.

source: Test7: Passed.
de: Terst7: Gemacht.
ru: Тест7: Пройден.
uk: Тест7: Виконано.

source: Test: Passed
de: Test: Gemacht.
ru: Тест: Пройден.
uk: Тест: Виконано

source: Passed
de: Gemacht
ru: Пройден
uk: Виконано

source: Test: Failed: %s
de: Test: Fehler: %s
ru: Тест: Ошибка: %s
uk: Тест: Помилка: %s

source: Failed: %s
de: Fehler: %s
ru: Ошибка: %s
uk: Помилка: %s

source: Base64 encoding
de: Base64 Kodierung
ru: Base64 кодирование
uk: Base64 кодування

source: Mime Base64 algorithm encoding tests.
de: Test der Kodierung Mime Base64 mit dem Algorithmus.
ru: Тесты кодирования Mime Base64 алгоритмом.
uk: Тести кодування алгоритмом Mime Base64.

source: Test1: Encoding.
de: Test1: Kodierung.
ru: Тест1: Кодирование.
uk: Тест1: Кодування.

source: Encoded text at length %d for time %f ms.
de: Kodierter Text in Länge %d für Zeit %f ms.
ru: Закодировано текст длиной %d за время %f мс.
uk: Закодовано текст довжиною %d за час %f мс.

source: Encoded text: %s
de: Kodierter Text: %s
ru: Закодированный текст: %s
uk: Закодований текст: %s

source: Test2: Decoding.
de: Test2: Decodierung.
ru: Тест2: Декодирование.
uk: Тест2: Декодування.

source: Decoded text at length %d for time %f ms.
de: Dekodierter Text in Länge %d für Zeit %f ms.
ru: Декодировано текст длиной %d за время %f мс.
uk: Декодовано текст довжиною %d за час %f мс.

source: Test2: Failed. Error decoding.
de: Test2: Fehler. Fehler der Decodierung.
ru: Тест2: Ошибка. Ошибка декодирования.
uk: Тест2: Помилка. Помилка декодування.

source: DB type
de: DB-Typ
ru: Тип БД
uk: Тип БД

source: DB address
de: DB-Adresse
ru: Адрес БД
uk: Адреса БД

source: DB table
de: DB-Tabelle
ru: Таблица БД
uk: Таблиця БД

source: Records number
de: Zahl der Einschreibungen
ru: Количество записей
uk: Кількість записів

source: DB test
ru: Тест БД
uk: Тест БД

source: Complete database test. Performs: - create/open DB; - create/open table; - create multiple records for the determined structure; - update multiple records; - update multiple records by a request key; - get and check values for multiple records; - seek records; - seek records in preload; - modify a record and the table structure; - remove multiple records; - close/remove table; - close/remove DB.
de: Kompletter Datenbank-Test Führt aus: - erstelle/öffne DB; - erstelle/öffne Tabelle; - erstellen Sie mehrere Datensätze für die ermittelte Struktur - mehrere Datensätze aktualisieren; - mehrere Datensätze aktualisieren von einem Anforderungsschlüssel; - Werte für mehrere Datensätze abrufen und überprüfen; - suche nach Datensätzen; - suche nach Datensätzen im Preload; - modifizieren, um einen Datensatz und die Tabellenstruktur; - entfernen mehrere Datensätze; - schließen/entfernen Tabelle; - schließen/entfernen DB.
ru: Полный тест БД. Выполняет: - создание/открытие БД; - создание/открытие таблицы; - создание множества записей (строк) предопределённой структуры; - обновление множества записей; - обновление множества записей по ключу запроса; - получение и проверка значений множества записей; - сканирование записей; - сканирование записей предзагрузкой; - модификация структуры записи и таблицы; - удаление записей; - закрытие/удаление таблицы; - закрытие/удаление БД.
uk: Повний тест БД. Здійснює: - створення/відкриття БД; - створення/відкриття таблиці; - створення множини записів визначеної структури; - оновлення множини записів; - оновлення множини записів за ключем запиту; - отримання та перевірка значень множини записів; - сканування записів; - сканування записів предзавантаженням; - модифікація структури запису та таблиці; - видалення записів; - закриття/видалення таблиці; - закриття/видалення БД.

source: Open the DB '%s'.
de: Öffne den DB '%s'.
ru: Открытие БД '%s'.
uk: Відкриття БД '%s'.

source: Open the table '%s'.
de: Öffnen Sie die Tabelle '%s'.
ru: Открытие таблицы '%s'.
uk: Відкриття таблиці '%s'.

source: Connect to the table '%s'.
de: Anschluss an die Tabelle '%s'.
ru: Подключение к таблице '%s'.
uk: Підключення до таблиці '%s'.

source: Create a DB configuration.
de: Erschaffung der Konfiguration der DB.
ru: Создание конфигурации БД.
uk: Створення конфігурації БД.

source: Name
ru: Имя
uk: Ім'я

source: Description
de: Beschreibung
ru: Описание
uk: Опис

source: Value
de: Wert
ru: Значение
uk: Значення

source: Identifier
de: Identifikator
ru: Идентификатор
uk: Ідентифікатор

source: State
de: Zustand
ru: Состояние
uk: Стан

source: Request's key
de: Schlüssel Antrag
ru: Ключ запроса
uk: Ключ запиту

source: Request's value
de: Wert Antrag
ru: Значение запроса
uk: Значення запиту

source: Create records.
de: Erschaffung von Aufschreibungen.
ru: Создание записей.
uk: Створення записів.

source: Created %d records for time %f sec.
de: Gemacht %d der Aufschreibungen im Laufe von %f Sekunden.
ru: Создано %d записей в течении %f секунд.
uk: Створено %d записів за час %f сек.

source: Update records.
de: Erneuerung der Aufschreibungen.
ru: Обновление записей.
uk: Оновлення записів.

source: Updated %d records for time %f sec.
de: Erneut %d der Aufschreibungen im Laufe von %f Sekunden.
ru: Обновлено %d записей в течении %f секунд.
uk: Оновлено %d записів за час %f сек.

source: Update records by a request key for %d records.
de: Aktualisieren Sie Datensätze mit einem Anforderungsschlüssel für %d-Datensätze.
ru: Обновление записей по ключу запроса для %d записей.
uk: Оновлення записів за ключем запиту для %d записів.

source: Updated %d records by a request key for time %f sec.
de: Aktualisierte %d-Datensätze mit einem Anforderungsschlüssel für die Zeit %f Sekunden.
ru: Обновлено %d записей по ключу запроса в течении %f секунд.
uk: Оновлено %d записів за ключем запиту за час %f сек.

source: Check records.
de: Prüfung der Aufschreibungen.
ru: Проверка записей.
uk: Перевірка записів.

source: Record #155='%s'; Descr='%s'; Value=%f; Id=%d; Stat=%d.
de: Aufschreibung #155='%s'; Beschreibung='%s'; Wert=%f; Id=%d; Zustand=%d.
ru: Запись #155='%s'; Описание='%s'; Значение=%f; Id=%d; Состояние=%d.
uk: Запис #155='%s'; Опис='%s'; Значення=%f; Id=%d; Стан=%d.

source: Field <Sh> '%s' != '%s' error.
de: Fehler des Feldes <Sh> '%s' != '%s'.
ru: Ошибка поля <Sh> '%s' != '%s'.
uk: Помилка поля <Sh> '%s' != '%s'.

source: Field <descr> '%s' != '%s' error.
de: Fehler des Feldes <descr> '%s' != '%s'.
ru: Ошибка поля <descr> '%s' != '%s'.
uk: Помилка поля <descr> '%s' != '%s'.

source: Field <id> %d != %d error.
de: Fehler des Feldes <id> %d != %d
ru: Ошибка поля <id> %d != %d.
uk: Помилка поля <id> %d != %d.

source: Field <stat> %d != %d error.
de: Fehler des Feldes <stat> %d != %d.
ru: Ошибка поля <stat> %d != %d.
uk: Помилка поля <stat> %d != %d.

source: Field <reqKey> '%s' != '%s' error.
de: Fehler des Feldes <reqKey> '%s' != '%s'.
ru: Ошибка поля <reqKey> '%s' != '%s'.
uk: Помилка поля <reqKey> '%s' != '%s'.

source: Field <reqVal> '%s' != '%s' error.
de: Fehler des Feldes <reqVal> '%s' != '%s'.
ru: Ошибка поля <reqVal> '%s' != '%s'.
uk: Помилка поля <reqVal> '%s' != '%s'.

source: Got %d records for time %f sec.
de: Bekommen %d der Felder im Laufe von %f Sekunden.
ru: Получено %d полей в течении %f секунд.
uk: Отримано %d записів за час %f сек.

source: Seek records.
de: Suche Aufzeichnungen.
ru: Сканирование записей.
uk: Сканування записів.

source: Sought %d records for time %f sec.
de: Gesucht %d Aufzeichnungen für die Zeit %f sek.
ru: Просканировано %d записей в течении %f секунд.
uk: Проскановано %d записів за час %f сек.

source: Seek records in preload.
de: Sucht Datensätze im Preload.
ru: Сканирование записей предзагрузкой.
uk: Сканування записів предзавантаженням.

source: Sought %d records in preload for time %f sec.
de: Gesucht %d Aufzeichnungen in Vorspannung für die Zeit %f sek.
ru: Просканировано %d предозагруженных записей в течении %f секунд.
uk: Проскановано %d передзавантажених записів за час %f сек.

source: Change DB structure.
de: Veränderung der DB-Struktur.
ru: Изменение структуры БД.
uk: Зміна структури БД.

source: DB fix test
de: Prüfung der DB-Veränderung
ru: Проверка исправления БД
uk: Тест виправлення БД

source: Record #2='%s'; Descr='%s'; Value=%f; Id=%d; Stat=%d.
de: Aufschreibung #2='%s'; Beschreibung='%s'; Wert=%f; Id=%d; Zustand=%d.
ru: Запись #2='%s'; Описание='%s'; Значение=%f; Id=%d; Состояние=%d.
uk: Запис #2='%s'; Опис='%s'; Значення=%f; Id=%d; Стан=%d.

source: Error adding a column.
de: Fehler beim Hinzufügen einer Spalte.
ru: Ошибка добавления колонки.
uk: Помилка додання стовпчика.

source: OK adding a column.
de: OK Hinzufügen einer Spalte.
ru: Успешное добавление колонки.
uk: Вдале додання стовпчика.

source: Error deleting a column.
de: Fehler beim Löschen einer Spalte.
ru: Ошибка удаления колонки.
uk: Помилка видалення стовпчика.

source: OK deleting a column.
de: OK Löschen einer Spalte.
ru: Успешное удаление колонки.
uk: Вдале видалення стовпчика.

source: Deleted %d records for time %f sec.
de: Gelöscht %d Felder im Laufe von %f Sekunden.
ru: Удалено %d полей в течении %f секунд.
uk: Видалено %d записів за час %f сек.

source: Close and delete the table '%s'.
de: Tabelle '%s' schließen und löschen.
ru: Закрытие и удаление таблицы '%s'.
uk: Закриття та видалення таблиці '%s'.

source: Close and delete the DB '%s'.
de: DB '%s' schließen und löschen.
ru: Закрытие и удаление БД '%s'.
uk: Закриття та видалення БД '%s'.

source: Template of the messages category
de: Vorlage der Nachrichtenkategorie
ru: Шаблон категории сообщения
uk: Шаблон категорії повідомлення

source: Messages depth, seconds
de: Tiefe der Nachricht, Sekunden
ru: Глубина сообщения, секунд
uk: Глибина повідомлень, секунд

source: Messages
de: Nachrichten
ru: Сообщения
uk: Повідомлення

source: Test the archive of messages. Periodically reads new messages from the archive for the specified archiver.
de: Testen Sie das Archiv der Nachrichten. Liest regelmäßig neue Nachrichten aus dem Archiv für den angegebenen Archivierer.
ru: Тест архива сообщений. Периодически вычитывает новые сообщения из архива, для указанного архиватора.
uk: Тест архіву повідомлень. Періодично вичитує нові повідомлення з архіву, для вказаного архіватору.

source: %d new messages present.
de: %d neue Nachrichten vorhanden.
ru: Доступно %d новых сообщений.
uk: Наявно %d нових повідомлень.

source: Address of the DAQ parameter
de: Adresse des DAQ-Parameters
ru: Адрес DAQ параметра
uk: Адреса DAQ параметру

source: Parameter
ru: Параметр
uk: Параметр

source: Test of the DAQ parameters. Reads the attributes and configuration fields of the parameter.
de: DAQ-Testparameter. Liest die Attribute und Konfigurationsfelder des Parameters.
ru: Тест DAQ параметров. Вычитывает атрибуты и конфигурационные поля параметра.
uk: Тест DAQ параметрів. Вичитує атрибути та конфігураційні поля параметру.

source: Value attributes: %d
de: Wertattribute: %d
ru: Атрибутов значений: %d
uk: Атрибутів значень: %d

source: %s(SELECT): %s
de: %s(AUSWAHL): %s
ru: %s(ВЫБОР): %s
uk: %s(ВИБІР): %s

source: %s(STRING): %s
de: %s(ZEILE): %s
ru: %s(СТРОКА): %s
uk: %s(СТРОКА): %s

source: %s(INTEGER): %d
de: %s(GANZE): %d
ru: %s(ЦЕЛОЕ): %d
uk: %s(ЦІЛЕ): %d

source: %s(REAL): %f
de: %s(REELE): %f
ru: %s(ВЕЩЕСТВЕННОЕ): %f
uk: %s(РЕАЛЬНЕ): %f

source: %s(BOOLEAN): %d
de: %s(LOGISCH): %d
ru: %s(ЛОГИЧЕСКИЙ): %d
uk: %s(ЛОГІЧНЕ): %d

source: Configuration fields: %d
de: Felder der Konfiguration: %d
ru: Поля конфигурации: %d
uk: Полів конфігурації: %d

source: Path to the module
de: Pfad zum Modul
ru: Путь к модулю
uk: Шлях до модуля

source: Mode (1-attach;-1-detach;0-change)
de: Regime (1-Anschalte.;-1-Ausschalte.;0-Veränderung)
ru: Режим (1-подключение;-1-отключение;0-изменение)
uk: Режим (1-підключити;-1-виключити;0-змінити)

source: Complete attach (when start)
de: Komplette Anlage (Startup)
ru: Полное подключение (при старте)
uk: Повне підключення (на старті)

source: Attaching SO
de: Anbringen SO
ru: Подключение SO
uk: Підключення SO

source: Test the module to attach/detach.
de: Test Anbringen/Abnehmen Modul.
ru: Тест подключения/отключения модуля.
uk: Тест підключення/виключення модуля.

source: Path to the language element
de: Pfad zum Sprachelement
ru: Путь к элементу языка
uk: Шлях до елементу мови

source: Control language of the program
de: Die Steuerungssprache des Programms
ru: Язык управления программы
uk: Мова контролю програми

source: Test of the control language of the program. Performs query of language elements through a complete path. The full path to the language element looks like </Archive/%2fbd%2fm_per>. The complete path consists of two nested paths. The first </Archive/> is the path to the node of the control tree. The second </bd/m_per> is the path to the specific node element.
de: Der Test der Steuerungssprache des Programms. Führt die Abfrage von Sprachelementen über einen vollständigen Pfad durch. Der vollständige Pfad zum Sprachelement sieht wie folgt aus: </Archive/%2fbd%2fm_per>. Der vollständige Pfad besteht aus zwei verschachtelten Pfaden. Der erste </Archive/> ist der Pfad zum Knoten des Kontrollbaums. Der zweite </bd/m_per> ist der Pfad zu dem spezifischen Knotenelement.
ru: Тест языка управления программой. Производит запрос элементов языка посредством полного пути. Полный путь к элементу языка имеет вид </Archive/%2fbd%2fm_per>. Полный путь состоит из двух вложенных путей. Первый </Archive/> это путь к узлу дерева контроля. Второй </bd/m_per> это путь к конкретному элементу узла.
uk: Тест мови контролю програми. Виконує запит елементів мови за посередництвом повного шляху. Повний шлях до елемента мови має вигляд </Archive/%2fbd%2fm_per>. Повний шлях складається з двох вкладених шляхів. Перший </Archive/> це шлях до вузла дерева контролю. Другий </bd/m_per> це шлях до конкретного елементу вузла.

source: SysContr test for the path '%s'.
de: Test SysContr für den Weg '%s'.
ru: Тест SysContr для пути '%s'.
uk: Тест SysContr за шляхом '%s'.

source: Address
de: Adresse
ru: Адрес
uk: Адреса

source: Transport module
de: Modul des Transports
ru: Модуль транспорта
uk: Модуль транспорту

source: Text of the request
de: Text der Anfrage
ru: Текст запроса
uk: Текст запиту

source: Transport
ru: Транспорт
uk: Транспорт

source: Test of the output and/or input transports. Performs testing of the original transport sending a request to the specified input transport.
de: Test des Output und/oder Input Transports. Testet den ursprünglichen Transport, indem eine Anforderung an den angegebenen eingehenden Transport gesendet wird.
ru: Тест выходного и/или входного транспортов. Выполняет тестирование выходного транспорта путём отправки запроса к указанному входному транспорту.
uk: Тест вихідного та/або вхідного транспорту. Виконує тестування вихідного транспорту шляхом надсилання запиту до вказаного вхідного транспорту.

source: %s: Put '%s'. Get: '%s'. Time = %g ms.
de: %s: Übergeben '%s'. Empfangen: '%s'. Zeit = %g ms.
ru: %s: Передано '%s'. Получено: '%s'. Время = %g мс.
uk: %s: Надіслано '%s'. Отримано: '%s'. Час = %g мс.

source: Passed. Time = %g ms.
de: Gemacht. Zeit = %g ms.
ru: Пройден. Время = %g мс.
uk: Виконано. Час = %g мс.

source: Value buffer
de: Wertebuffer
ru: Буфер значений
uk: Буфер значень

source: Tests of the value buffer. Contains 13 tests of all aspects of the value buffer (the subsystem "Archives-History").
de: Die Tests der Werte puffern. Enthält 13 Tests aller Aspekte des Wertepuffers (das Subsystem "Archive-History").
ru: Тесты буфера значений. Содержит 13 тестов всех аспектов буфера значений (подсистема "Архивы-История").
uk: Тести буферу значень. Містить 13 тестів всіх аспектів буферу значень (підсистема "Архіви-Історія").

source: Test%d
ru: Тест%d
uk: Тест%d

source: %s: Create buffer: Data = string, Size = 10, Period = 1s, HardGrid = yes, HighRes = no.
de: %s: Erschaffung des Buffers: Angaben = Zeile, Umfang = 10, Periode = 1sek, HarterGitter = ja, HoheAuflösung = nein.
ru: %s: Создание буфера: Данные = строка, Размер = 10, Период = 1с, ЖёсткаяСетка = да, ВысокоеРазрешение = нет.
uk: %s: Створення буферу: Дані = строка, Розмір = 10, Період = 1с, ЖорстГратка = так, ВисРоздЗд = ні.

source: %s: Passed.
de: %s: Durchgenommen.
ru: %s: Пройден.
uk: %s: Виконано.

source: Error creating a buffer.
de: Fehler beim Erstellen eines Puffers.
ru: Сбой создания буфера.
uk: Помилка створення буферу.

source: %s: Change the buffer mode.
de: %s: Ändern Sie den Puffermodus.
ru: %s: Изменение режима буфера.
uk: %s: Зміна режиму буфера.

source: OK disabling the hard grid.
de: OK Deaktivieren des harten Gitters.
ru: Успешное отключение жёсткой сетки.
uk: Вдале відключення жорсткої ґратки.

source: Fail disabling the hard grid.
de: Fehler beim Deaktivieren des harten Gitters.
ru: Сбой отключения жёсткой сетки.
uk: Збій відключення жорсткої ґратки.

source: OK setting the high resolution time.
de: OK Einstellen der Hochauflösungszeit.
ru: Успешная установка высокого разрешения времени.
uk: Вдале встановлення високої роздільної здатності часу.

source: Fail setting the high resolution time.
de: Fehler beim Einstellen der Hochauflösungszeit.
ru: Сбой установки высокого разрешения времени.
uk: Збій встановлення високої роздільної здатності часу.

source: OK changing the buffer size.
de: OK Ändern der Puffergröße.
ru: Успешное изменение размера буфера.
uk: Вдала зміна розміру буфера.

source: Fail changing the buffer size.
de: Fehler beim Ändern der Puffergröße.
ru: Сбой изменения размера буфера.
uk: Збій зміни розміру буфера.

source: OK changing the period.
de: OK Ändern der Periode.
ru: Успешное изменение периода.
uk: Вдала зміна періоду.

source: Fail changing the period.
de: Fehler beim Ändern der Periode.
ru: Сбой изменения периода.
uk: Збій зміни періоду.

source: %s: Destroy buffer.
de: %s: Verfall des Puffer.
ru: %s: Разрушение буфера.
uk: %s: Видалення буферу.
