Repository: aleax/openscada
Catalog: src/moduls/special/SystemTests/po/*.po
Languages: de, ru, uk

source: %s: Fill and check the hard time grid string buffer.
de: %s: Füllen und Prüfung des Zeilenbuffers mit dem harten Zeitgitter.
ru: %s: Заполнение и проверка строкового буфера с жёсткой сеткой времени.
uk: %s: Заповнення та перевірка строкового буферу з жорсткою граткою часу.

source: Error the buffer begin or/and end at filling a half buffer.
de: Fehler beim Pufferanfang oder/und beim Füllen eines halben Puffers.
ru: Сбой начала и/или конца буфера при заполнении половины буфера.
uk: Збій початку або/та кінця буферу під час заповнення половини буферу.

source: Error writing to half of the value buffer.
de: Fehler beim Schreiben auf die Hälfte des Wertepuffers.
ru: Сбой записи половины буфера значений.
uk: Збій запису половини буферу значень.

source: OK writing a half buffer.
de: OK schreibe einen halben Puffer.
ru: Успешная запись половины буфера значений.
uk: Вдалий запис половини буферу.

source: Error the buffer begin and/or end when filling in a circle.
de: Fehler beim Beginn und/oder Ende des Puffers beim Ausfüllen eines Kreises.
ru: Сбой начала и/или конца буфера при кольцевом заполнении буфера.
uk: Збій початку або/та кінця буферу під час заповнення по колу.

source: Error writing the value buffer in a circle.
de: Fehler beim Schreiben des Wertpuffers in einen Kreis.
ru: Сбой кольцевой записи значений в буфер.
uk: Збій запису буферу по колу.

source: OK writing the value buffer in a circle.
de: OK Schreiben des Wertpuffers in einen Kreis.
ru: Успешная кольцевая запись значений в буфер.
uk: Вдалий запис буферу по колу.

source: Error updating the buffer end.
de: Fehler beim Aktualisieren des Pufferendes.
ru: Сбой обновления конца буфера.
uk: Збій оновлення кінця буферу.

source: OK updating the buffer end.
de: OK Aktualisieren des Pufferendes.
ru: Успешное обновления конца буфера.
uk: Вдале оновлення кінця буферу.

source: Wrote 1000 values for time %f ms.
de: 1000 Werte gespeichert im Laufe von %f usek.
ru: Записано 1000 значений в течении %f мс.
uk: Записано 1000 значень за час %f мс.

source: Read 1000 values for time %f ms.
de: 1000 Aufschreibungen gelesen im Laufe von %f usek.
ru: Прочитано 1000 записей в течении %f мс.
uk: Прочитано 1000 значень за час %f мс.

source: %s: Fill and check the hard time grid integer buffer.
de: %s: Füllen und Prüfung des ganzzahligen Puffer mit dem weichen Zeitgitter.
ru: %s: Заполнение и проверка целочисленного буфера с жёсткой сеткой времени.
uk: %s: Заповнення та перевірка цілочислового буферу з жорсткою ґраткою часу.

source: %s: Fill and check the soft time grid string buffer (high time).
de: %s: Füllen und Prüfung des Zeilenbuffers mit dem weichen Zeitgitter (hohe Zeitauflösung).
ru: %s: Заполнение и проверка строкового буфера с мягкой сеткой времени (высокое разрешение времени).
uk: %s: Заповнення та перевірка строкового буферу з м'якою ґраткою часу (висока розд. здатн. часу).

source: %s: Fill and check the soft time grid integer buffer (high time).
de: %s: Füllen und Prüfung des ganzzahligen Puffer mit dem weichen Zeitgitter (hohe Zeitauflösung).
ru: %s: Заполнение и проверка целочисленного буфера с мягкой сеткой времени (высокое разрешение времени).
uk: %s: Заповнення та перевірка цілочисельного буферу з м'якою ґраткою часу (висока розд. здатн. часу).

source: %s: Fill and check the soft time grid string buffer (low time).
de: %s: Füllen und Prüfung des Zeilenbuffers mit dem weichen Zeitgitter (niedrige Zeitauflösung).
ru: %s: Заполнение и проверка строкового буфера с мягкой сеткой времени (низкое разрешение времени).
uk: %s: Заповнення та перевірка строкового буферу з м'якою ґраткою часу (низька розд. здатн. часу).

source: %s: Fill and check the soft time grid integer buffer (low time).
de: %s: Füllen und Prüfung des ganzzahligen Puffer mit dem weichen Zeitgitter (niedrige Zeitauflösung).
ru: %s: Заполнение и проверка целочисленного буфера с мягкой сеткой времени (низкое разрешение времени).
uk: %s: Заповнення та перевірка цілочислового буферу з м'якою ґраткою часу (низька розд. здатн. часу).

source: %s: Fill and check the free time string buffer (high time).
de: %s: Füllen und Prüfung des Zeilenbufers mit der freien Zeit (hohe Zeitauflösung).
ru: %s: Заполнение и проверка строкового буфера со свободным временем (высокое разрешение времени).
uk: %s: Заповнення та перевірка строкового буферу з вільним часом (висока розд. здатн. часу).

source: %s: Fill and check the free time integer buffer (high time).
de: %s: Füllen und Prüfung des ganzzahligen Puffer mit der freien Zeit (hohe Zeitauflösung).
ru: %s: Заполнение и проверка целочисленного буфера со свободным временем (высокое разрешение времени).
uk: %s: Заповнення та перевірка цілочислового буферу з вільним часом (висока розд. здатн. часу).

source: %s: Fill and check the free time string buffer (low time).
de: %s: Füllen und Prüfung des Zeilenbuffers mit der freien Zeit (niedrige Zeitauflösung).
ru: %s: Заполнение и проверка строкового буфера со свободным временем (низкого разрешение времени).
uk: %s: Заповнення та перевірка строкового буферу з вільним часом (низька розд. здатн. часу).

source: %s: Fill and check the free time integer buffer (low time).
de: %s: Füllen und Prüfung des ganzzahligen Puffer mit der freien Zeit (niedrige Zeitauflösung).
ru: %s: Заполнение и проверка целочисленного буфера со свободным временем (низкого разрешение времени).
uk: %s: Заповнення та перевірка цілочислового з вільним часом (низька розд. здатн. часу).

source: %s: Failed: %s
de: %s: Fehler: %s
ru: %s: Ошибка: %s
uk: %s: Помилка: %s

source: Failed: %s: %s
de: Fehler: %s: %s
ru: Ошибка: %s: %s
uk: Помилка: %s: %s

source: Path to the parameter attribute
de: Pfad zum Parameterattribut
ru: Путь к атрибуту параметра
uk: Шлях до атрибуту параметру

source: Depth of getting of archive values, seconds
de: Die Tiefe des Erhaltens der Archivwerte, Sekunden
ru: Глубина получения архивных значений, секунд
uk: Глибина отримання архівних значень, секунд

source: Period of getting of archive values, microseconds
de: Zeitraum des Erhaltens von Archivwerten, Mikrosekunden
ru: Период получения архивных значений, микросекунды
uk: Період отримання архівних значень, мікросекунди

source: Parameter attribute
de: Attribut des Parameters
ru: Атрибут параметра
uk: Атрибут параметру

source: Test for values of the parameter attribute. Performs the periodic acquisition of the last value of the specified attribute, as well as the archive questioning to the required depth.
de: Test für Werte des Parameters Attribut. Führt eine periodische Erfassung des letzten Werts des angegebenen Attributs sowie der Archivfragestellung in der erforderlichen Tiefe durch.
ru: Тест значений атрибута параметра. Выполняет периодический опрос последнего значения указанного атрибута, а также опрос архива на указанную глубину.
uk: Тест значень атрибуту параметра. Виконує періодичне опитування останнього значення вказаного атрибуту, а також опитування архіву на потрібну глибину.

source: Value of: %s.
de: Wert aus: %s.
ru: Значение из: %s.
uk: Значення з: %s.

source: Last value = %s
de: Letzter Wert = %s
ru: Последнее значение = %s
uk: Останнє значення = %s

source: Value %d = %s.
de: Wert %d = %s.
ru: Значение %d = %s.
uk: Значення %d = %s.

source: XML file
de: XML-Datei
ru: XML файл
uk: XML файл

source: XML parsing
de: Analyse der XML
ru: Разбор XML
uk: Розбір XML

source: Test for XML file parsing. Disassembles and displays the structure of the specified file.
de: Testen Sie das Parsen von XML-Dateien. Zerlegt und zeigt die Struktur der angegebenen Datei an.
ru: Тест разбора файла XML. Разбирает и отображает структуру указанного файла.
uk: Тест розбору XML файлу. Розбирає та відображає структуру вказаного файлу.

source: Error opening the file '%s'.
de: Fehler beim Öffnen der Datei '%s'.
ru: Ошибка открытия файла '%s'.
uk: Помилка відкриття файлу '%s'.

source: Error reading the file '%s': %s.
de: Fehler beim Lesen der Datei '%s': %s.
ru: Ошибка чтения файла '%s': %s.
uk: Помилка читання файлу '%s': %s.

source: Read the file '%s' only %d from %d.
de: Lesen Sie die Datei '%s' nur %d von %d.
ru: Чтение файла '%s' только %d из %d.
uk: Читання файлу '%s' тільки для %d із %d.

source: Test: Passed: %f ms.
de: Test: Gemacht: %f ms.
ru: Тест: Пройден: %f ms.
uk: Тест1: Виконано: %f ms.
