Repository: aleax/openscada
Catalog: src/moduls/daq/ICP_DAS/po/*.po
Languages: de, ru, uk

source: 4mA to 20mA;-10V to 10V;-5V to 5V;-1V to 1V;-500mV to 500mV;-150mV to 150mV;-20mA to 20mA;0mA to 20mA;
ru: 4мА до 20мА;-10В до 10В;-5В до 5В;-1В до 1В;-500мВ до 500мВ;-150мВ до 150мВ;-20мВ to 20мВ;0мА до 20мА;
uk: 4мА до 20мА;-10В до 10В;-5В до 5В;-1В до 1В;-500мВ до 500мВ;-150мВ до 150мВ;-20мВ to 20мВ;0мА до 20мА;

source: -15mV to +15mV;-50mV to +50mV;-100mV to +100mV;-500mV to +500mV;-1V to +1V;-2.5V to +2.5V;-20mA to +20mA (with 125 ohms resistor);-10V to +10V;-5V to +5V;-1V to +1V;-500mV to +500mV;-150mV to +150mV;-20mA to +20mA (with 125 ohms resistor);J Type;K Type;T Type;E Type;R Type;S Type;B Type;N Type;C Type;L Type;M Type;L Type (DIN43710C Type)
de: -15mV bis +15mV;-50mV bis +50mV;-100mV bis +100mV;-500mV bis +500mV;-1V bis +1V;-2.5V bis +2.5V;-20mA bis +20mA (mit dem Resistor 125 Om);-10V bis +10V;-5V bis +5V;-1V bis +1V;-500mV bis +500mV;-150mV bis +150mV;-20mA bis +20mA (mit dem Resistor 125 Om);J Typ;K Typ;T Typ;E Typ;R Typ;S Typ;B Typ;N Typ;C Typ;L Typ;M Typ;L Typ (DIN43710C Typ)
ru: -15мВ до +15мВ;-50мВ до +50мВ;-100мВ до +100мВ;-500мВ до +500мВ;-1В до +1В;-2.5В до +2.5В;-20мА до +20мА (с резистором 125 Ом);-10В до +10В;-5В до +5В;-1В до +1В;-500мВ до +500мВ;-150мВ до +150мВ;-20мА до +20мА (с резистором 125 Ом);J Тип;K Тип;T Тип;E Тип;R Тип;S Тип;B Тип;N Тип;C Тип;L Тип;M Тип;L Тип (DIN43710C Тип)
uk: -15мВ до +15мВ;-50мВ до +50мВ;-100мВ до +100мВ;-500мВ до +500мВ;-1В до +1В;-2.5В до +2.5В;-20мА до +20мА (з резистором 125 ом);-10В до +10В;-5В до +5В;-1В до +1В;-500мВ до +500мВ;-150мВ до +150мВ;-20мА до +20мА (з резистором 125 ом);J Тип;K Тип;T Тип;E Тип;R Тип;S Тип;B Тип;N Тип;C Тип;L Тип;M Тип;L Тип (DIN43710C Тип)

source: Cold-Junction Compensation(CJC) temperature
de: Temperatur der Kompensation der kalten Fugen
ru: Температура компенсации холодных спаев
uk: Температура компенсації холодних спаїв

source: Input %d
de: Eingang %d
ru: Вход %d
uk: Вхід %d

source: Out %d
de: Ausgang %d
ru: Выход %d
uk: Вихід %d

source: Digital input %d.%d
de: Digital-Eingang %d.%d
ru: Дискретный вход %d.%d
uk: Дискретний вхід %d.%d

source: Digital out %d.%d
de: Digital-Ausgang %d.%d
ru: Дискретный выход %d.%d
uk: Дискретний вихід %d.%d

source: Counter %d
de: Messuhr %d
ru: Счётчик %d
uk: Лічильник %d

source: 10:Request to module error.
de: 10:Fehler der Anfrage ans Modul.
ru: 10:Ошибка запроса к модулю.
uk: 10:Помилка запиту до модуля.

source: 11:Respond from module error.
de: 11:Fehler in der Antwort des Moduls.
ru: 11:Ошибка в ответе модуля.
uk: 11:Помилка у відповіді модуля.

source: CRC control
de: CRC Kontrolle
ru: Контроль CRC
uk: Контроль CRC

source: AI number
de: Anzahl AI
ru: Количество AI
uk: Кількість AI

source: AO number, #AAN(Data)
de: Anzahl AO, #AAN(Data)
ru: Количество AO, #AAN(Data)
uk: Кількість AO, #AAN(Data)

source: DI number (ports x8)
de: Anzahl DI (Ports x8)
ru: Количество DI (порты x8)
uk: Кількість DI (порти x8)

source: DO number (ports x8)
de: Anzahl DO (Ports x8)
ru: Количество DO (порты x8)
uk: Кількість DO (порти x8)

source: Counters number, #AAN
de: Anzahl Messuhr, #AAN
ru: Количество счётчиков, #AAN
uk: Кількість лічильників, #AAN

source: Configuration
de: Konfiguration
ru: Конфигурация
uk: Конфігурація

source: Input %d type
de: Eingangstyp %d
ru: Тип входа %d
uk: Тип входу %d

source: Error;
de: Fehler;
ru: Ошибка;
uk: Помилка;

source: Host watchdog timeout (s)
de: Zeit des Hostwatchdogs (s)
ru: Время хостового сторожевого таймера (с)
uk: Час хостового сторожового таймеру (с)

source: Module
de: Modul
ru: Модуль
uk: Модуль

source: Host watchdog status
de: Zustand des Hostwatchdogs
ru: Состояние хостового сторожевого таймера
uk: Стан хостового сторожового таймеру

source: Power on values
de: Werte beim Einschalten der Speisung
ru: Значения при включении питания
uk: Значення при включені

source: Set power on values from current
de: Wiederherstellung der Werte beim Einschalten der Speisung aus den laufenden
ru: Установка значений при включении питания из текущих
uk: Встановити значення при включені у поточні

source: Safe values
de: Sichere Werte
ru: Безопасные значения
uk: Безпечні значення

source: Set safe values from current
de: Wiederherstellung der sicheren Werte aus den laufenden
ru: Установка безопасных значений из текущих
uk: Встановити безпечні значення у поточні

source: DI %d reverse
de: DI %d Wechselschaltung
ru: DI %d, инверсия
uk: DI %d, реверс

source: DO %d reverse
de: DO %d Wechselschaltung
ru: DO %d, инверсия
uk: DO %d, реверс

source: Set.
de: Installiert.
ru: Установлен.
uk: Встановлений.

source: Clear.
de: Rein.
ru: Чист.
uk: Чистий.

source: Enabled,
de: Eingeschaltet,
ru: Включен,
uk: Включений,

source: Disabled,
de: Ausgeschaltet,
ru: Выключен,
uk: Виключений,

source: s.
ru: с.
uk: с.

source: Error
de: Fehler
ru: Ошибка
uk: Помилка

source: Analog input %d
de: Analogeingang %d
ru: Аналоговый вход %d
uk: Аналоговий вхід %d

source: Analog output %d
de: Analogausgang %d
ru: Аналоговый выход %d
uk: Аналоговий вихід %d

source: Analog input settle timeout (us)
de: Setup-Zeit der analogen Eingang (mcs)
ru: Время установки аналогового входа (мкс)
uk: Час встановлення аналогового входу (мкс)

source: AI %d gain
de: AI %d Steigerung
ru: AI %d усиление
uk: AI %d підсилення

source: Channel %d out
de: Kanal %d Ausgang
ru: Канал %d выход
uk: Канал %d вихід

source: IO %d reverse
de: IO %d Wechselschaltung
ru: IO %d, инверсия
uk: IO %d, реверс

source: Serial number
de: Seriennummer
ru: Серийный номер
uk: Серійний номер

source: SDK version
ru: Версия SDK
uk: Версія SDK

source: DIP switch
de: DIP-Umschalter
ru: DIP переключатель
uk: DIP перемикач

source: Rotary switch
de: Drehschalter
ru: Поворотный переключатель
uk: Поворотний перемикач

source: Output %d
de: Ausgang %d
ru: Выход %d
uk: Вихід %d

source: Process parameters
de: Parameterbearbeitung
ru: Обработка параметров
uk: Обробка параметрів

source: Fast data get period (s)
de: Periode der schnellen Datenerfassun (s)
ru: Период быстрого сбора данных (с)
uk: Період швидкого збору даних (с)

source: Use 0 for disable
de: Mit 0 deaktivieren
ru: Используйте 0 для отключения
uk: Використати 0 для вимкнення

source: Mode
de: Modus
ru: Режим
uk: Режим

source: -10V to +10V;-5V to +5V;-2.5V to +2.5V;-1.25V to +1.25V;-20mA to +20mA (with 125 ohms resistor)
de: -10V bis +10V;-5V bis +5V;-2.5V bis +2.5V;-1.25V bis +1.25V;-20mA bis +20mA (mit dem Resistor 125 Om)
ru: -10В до +10В;-5В до +5В;-2.5В до +2.5В;-1.25В до +1.25В;-20мА до +20мА (с резистором 125ом)
uk: -10В до +10В;-5В до +5В;-2.5В до +2.5В;-1.25В до +1.25В;-20мА до +20мА (з резистором 125 ом)

source: ICP DAS hardware
de: Ausstattung ICP DAS
ru: Оборудование ICP DAS
uk: Обладнання ICP DAS

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: Allow implementation for 'ICP DAS' hardware support. Include main I-87xxx DCON modules, I-8xxx fast modules and boards on ISA bus.
de: Lassen Realisierung von 'ICP DAS' Hardware-Unterstützung. Umfasst Unterstützung für grundlegende I-87xxx DCON Module, I-8xxx schnelle Module und Karten auf dem Bus ISA.
ru: Предоставляет реализацию поддержки оборудования 'ICP DAS'. Включает поддержку основных I-87xxx DCON модулей, I-8xxx быстрых модулей и плат на шине ISA.
uk: Надає реалізацію підтримки обладнання 'ICP DAS'. Включає підтримку основних I-87xxx DCON модулів, I-8xxx швидких модулів та плат на шині ISA.

source: Parameteres table
de: Tabelle der Parameter
ru: Таблица параметров
uk: Таблиця параметрів

source: Acquisition schedule
de: Planung der Befragung
ru: Планирование опроса
uk: Планування опитування

source: Gather task priority
de: Priorität der Datenerfassung
ru: Приоритет задачи сбора
uk: Пріоритет задачі збору даних

source: Bus
ru: Шина
uk: Шина

source: ISA;COM 1 (Master LP-8xxx);COM 1;COM 2;COM 3;COM 4;COM 5;COM 6;COM 7;COM 8;COM 9;COM 10
ru: ISA;COM 1 (Мастер LP-8xxx);COM 1;COM 2;COM 3;COM 4;COM 5;COM 6;COM 7;COM 8;COM 9;COM 10
uk: ISA;COM 1 (Мастер LP-8xxx);COM 1;COM 2;COM 3;COM 4;COM 5;COM 6;COM 7;COM 8;COM 9;COM 10

source: Transport
ru: Транспорт
uk: Транспорт

source: Baudrate
de: Geschwindigkeit
ru: Скорость
uk: Швидкість

source: LinPAC parameters
de: Parameter LinPAC
ru: Параметры LinPAC
uk: Параметри LinPAC

source: Serial request tries
de: Versuche der konsequenten Anfragen
ru: Попыток последов. запросов
uk: Спроб послід. запитів

source: Standard
ru: Стандарт
uk: Стандарт

source: Module type
de: Typ des Moduls
ru: Тип модуля
uk: Тип модуля

source: Module address
de: Adresse des Moduls
ru: Адрес модуля
uk: Адреса модуля

source: Module slot
de: Slot des Moduls
ru: Слот модуля
uk: Слот модуля

source: Module addition parameters
de: Zusätzliche Parameter des Moduls
ru: Дополнительные параметры модуля
uk: Додаткові параметри модуля

source: Call now.
de: Rufen Sie jetzt an.
ru: Вызов сейчас.
uk: Виклик зараз.

source: Call by period: %s.
de: Aufruf mit einer Periode: %s.
ru: Вызовы с периодом: %s.
uk: Виклик за періодом: %s.

source: Call next by cron '%s'.
de: Call nächsten durch cron '%s'.
ru: Следующий вызов по cron '%s'.
uk: Наступний виклик за cron '%s'.

source: Spent time: %s. Serial requests %g, errors %g.
de: Verbrauchte Zeit: %s. Konsequente Anfragen %g, Fehler %g.
ru: Затрачено времени: %s. Последов. запросов %g, ошибок %g.
uk: Витрачено часу: %s. Послід. запитів %g, помилок %g.

source: Open All LP-slots error.
de: Fehler der Öffnung aller LP-Slots.
ru: Ошибка открытия всех LP-слотов.
uk: Помилка відкриття всіх LP-слотів.

source: Open LP-slot 9 error.
de: Fehler der Öffnung des LP-Slots 9.
ru: Ошибка открытия LP-слота 9.
uk: Помилка відкриття LP-слоту 9.

source: Open COM%d port error.
de: Fehler der Öffnung des COM%d Ports.
ru: Ошибка открытия COM%d порта.
uk: Помилка відкриття COM%d порту.

source: Set watchdog to %d ms.
de: Set Watchdog %d ms.
ru: Установка watchdog в %d мс.
uk: Встановлення watchdog у %d мс.

source: REQ -> '%s'
de: Anfrage -> '%s'
ru: Запрос -> '%s'
uk: Запит -> '%s'

source: 13:Error respond: Not full.
de: 13:Fehler reagieren: Nicht voll.
ru: 13:Ошибка ответа: Неполный.
uk: 13:Помилка відповіді: Не повна.

source: 21:Invalid module CRC.
de: 21:Ungültige Modul CRC.
ru: 21:Ошибка контрольной суммы модуля.
uk: 21:Помилка контрольної суми.

source: RESP -> '%s'
de: Antwort -> '%s'
ru: Ответ -> '%s'
uk: Відпов. -> '%s'

source: ERR -> '%s': %s
de: Fehler -> '%s': %s
ru: Ошибка -> '%s': %s
uk: Помилка -> '%s': %s

source: 13:Send_Receive_Cmd() error: %d.
de: 13:Send_Receive_Cmd() Fehler: %d.
ru: 13:Send_Receive_Cmd() ошибка: %d.
uk: 13:Send_Receive_Cmd() помилка: %d.

source: Watchdog timeout (s)
de: Zeit des Watchdogs (s)
ru: Время сторожевого таймера (с)
uk: Час сторожового таймеру (с)

source: No a device selected.
de: Nr. ein Gerät ausgewählt.
ru: Ни одного устройства не выбрано.
uk: Жодного пристрою не обрано.

source: 1:Parameter is disabled.
de: 1:Parameter ist abgeschaltet.
ru: 1:Параметр отключен.
uk: 1:Параметр вимкнено.

source: 2:Acquisition is stopped.
de: 2:Erfassung ist angehalten.
ru: 2:Опрос остановлен.
uk: 2:Збір зупинено.

source: Write value to attribute '%s' error: %s
de: Fehler der Speicherung der Werte ins Attribut '%s': %s
ru: Ошибка записи значения в атрибут '%s': %s
uk: Помилка запису значення до атрибуту '%s': %s

source: <No select>
de: <Nicht gewählt>
ru: <Не выбрано>
uk: <Не обрано>

source: I-8700, I-7000 serial bus
ru: I-8700, I-7000 последовательная шина
uk: I-8700, I-7000 послідовна шина

source: ISA DAQ boards
de: ISA DAQ Board
ru: ISA DAQ платы
uk: ISA DAQ плати

source: LP-8000, I-8000 parallel bus
ru: LP-8000, I-8000 параллельная шина
uk: LP-8000, I-8000 паралельна шина
