Repository: aleax/openscada
Catalog: src/moduls/special/FLibMath/po/*.po
Languages: de, ru, uk

source: Math functions
de: Mathematische Funktionen
ru: Математические функции
uk: Математичні функції

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: Provides a library of the standard mathematical functions.
de: Bietet eine Bibliothek der mathematischen Standardfunktionen.
ru: Предоставляет библиотеку стандартных математических функций.
uk: Надає бібліотеку стандартних математичних функцій.

source: Function
de: Funktion
ru: Функция
uk: Функція

source: Functions
de: Funktionen
ru: Функции
uk: Функції

source: Y(rad.)
ru: Y(рад.)
uk: Y(рад.)

source: Arccosine
de: Arkuskosinus
ru: Арккосинус
uk: Арккосинус

source: Arccosine math function.
de: Mathematische Funktion Arkuskosinus.
ru: Математическая функция арккосинус.
uk: Математична функція арккосинус.

source: Arcsine
de: Arcussinus
ru: Арксинус
uk: Арксинус

source: Arcsine math function.
de: Mathematische Funktion Arcussinus.
ru: Математическая функция арксинус.
uk: Математична функція арксинус.

source: Arctangent
de: Arcustangens
ru: Арктангенс
uk: Арктангенс

source: Arctangent math function.
de: Mathematische Funktion Arcustangens.
ru: Математическая функция арктангенс.
uk: Математична функція арктангенс.

source: X(rad.)
ru: X(рад.)
uk: X(рад.)

source: Cosine
de: Kosinus
ru: Косинус
uk: Косинус

source: Cosine math function.
de: Mathematische Funktion Kosinus.
ru: Математическая функция косинус.
uk: Математична функція косинус.

source: Cosine hyperbolic
de: Hyperbolischer Kosinus
ru: Косинус гиперболический
uk: Косинус гіперболічний

source: Cosine hyperbolic math function.
de: Mathematische Funktion Kosinus hyperbolisch.
ru: Математическая функция косинус гиперболический.
uk: Математична функція косинус гіперболічний.

source: Exponent
ru: Экспонента
uk: Експонента

source: Exponent math function.
de: Mathematische Funktion des Exponent.
ru: Математическая функция экспонента.
uk: Математична функція експонента.

source: Natural logarithm
de: Natürlicher Logarithmus
ru: Натуральный логарифм
uk: Натуральний логарифм

source: Natural logarithm math function.
de: Mathematische Funktion natürlicher Logarithmus.
ru: Математическая функция натуральный логарифм.
uk: Математична функція натуральний логарифм.

source: Decimal logarithm
de: Dezimallogarithmus
ru: Десятичный логарифм
uk: Десятковий логарифм

source: Decimal logarithm math function.
de: Mathematische Funktion Dezimallogarithmus.
ru: Математическая функция десятичный логарифм.
uk: Математична функція десятковий логарифм.

source: Power
de: Potenz
ru: Степень
uk: Ступінь

source: Power math function.
de: Mathematische Funktion zur Berechnung der Potenz.
ru: Математическая функция возведение в степень.
uk: Математична функція зведення у ступінь.

source: Sine
de: Sinus
ru: Синус
uk: Синус

source: Sine math function.
de: Mathematische Funktion Sinus.
ru: Математическая функция синус.
uk: Математична функція синус.

source: Sine hyperbolic
de: Hyperbolischer Sinus
ru: Синус гиперболический
uk: Синус гіперболічний

source: Sine hyperbolic math function.
de: Mathematische Funktion Sinus hyperbolisch.
ru: Математическая функция синус гиперболический.
uk: Математична функція синус гіперболічний.

source: Square root
de: Quadratwurzel
ru: Корень квадратный
uk: Корінь квадратний

source: Square root math function.
de: Mathematische Funktion Quadratwurzel.
ru: Математическая функция корень квадратный.
uk: Математична функція корінь квадратний.

source: Tangent
de: Tangens
ru: Тангенс
uk: Тангенс

source: Tangent math function.
de: Mathematische Funktion Tangens.
ru: Математическая функция тангенс.
uk: Математична функція тангенс.

source: Tangent hyperbolic
de: Hyperbolischer Tangens
ru: Тангенс гиперболический
uk: Тангенс гіперболічний

source: Tangent hyperbolic math function.
de: Mathematische Funktion Tangens hyperbolisch.
ru: Математическая функция тангенс гиперболический.
uk: Математична функція тангенс гіперболічний.

source: Ceil
ru: Большее
uk: Найбільше

source: Math function of rounding up to the largest integer.
de: Mathematische Funktion Aufrundung zur nächst grösseren Zahl.
ru: Математическая функция округления до большего целого.
uk: Математична функція округлення до більшого цілого.

source: Absolute
de: Absolut
ru: Модуль
uk: Модуль

source: Absolute math function.
de: Mathematische Funktion Absolutwert der Zahl.
ru: Математическая функция модуль от числа.
uk: Математична функція модуля від числа.

source: Floor
de: Abrundung
ru: Меньшее
uk: Найменше

source: Math function of rounding down to the lowest integer.
de: Mathematische Funktion Abrundung zur nächst kleineren Zahl.
ru: Математическая функция округления до меньшего целого.
uk: Математична функція округлення до меншого цілого.

source: Random number
de: Zufallszahl
ru: Случайное число
uk: Випадкове число

source: Math function of the random numbers generation.
de: Mathematische Funktion für Zufallszahlen.
ru: Математическая функция генерации случайных чисел.
uk: Математична функція генерації випадкових чисел.

source: Condition
de: Bedingung
ru: Условие
uk: Умова

source: True value
de: Richtiger Wert
ru: Верное знач.
uk: Дійсне значення

source: False value
de: Falscher Wert
ru: Ошибочное знач.
uk: Помилкове значення

source: IF condition
de: IF-Bedingung
ru: Условие Если
uk: Умова Якщо

source: Function of the type 'if'-condition.
de: Funktion des Typs 'if'-Bedingung.
ru: Функция типа 'если'-условие.
uk: Функція типу 'якщо'-умова.
