Repository: aleax/openscada
Catalog: src/moduls/daq/AMRDevs/po/*.po
Languages: de, ru

source: 13:Error respond: Too short.
de: 13:Fehler der Antwort: Zu kurz.
ru: 13:Ошибка ответа: Не полный.

source: 13:Error respond: CRC check error.
de: 13:Fehler der Antwort :Der CRC Checkfehler.
ru: 13:Ошибка ответа: Ошибка проверки CRC.

source: 14:Connection error - %s
de: 14:Fehler der Verbindung - %s
ru: 14:Ошибка соединения - %s

source: 15:Response PDU size error.
de: 15:Fehler in der Grösse der PDU - Antwort.
ru: 15:Ошибка в размере PDU ответа.

source: Attributes list
de: Die Attributenliste
ru: Список атрибутов

source: Attributes configuration list. List must be written by lines in format: [dt:numb:id:name] Where: dt - data type: I-integer(16),LI-long integer(32),F-float; numb - register number (dec, hex or octal); id - created attribute identifier; name - created attribute name. Example: 'I:0x300:var:Variable' - integer access; 'F:200:float:Float' - get float from registers 200 and 201; 'LI:300:int32:Int32' - get int32 from registers 300 and 301.
de: Die Liste der Konfiguration der Attribute. Die Liste muss mit den Zeilen gebildet werden im Format: [dt:numb:id:name] Wo: dt - Der Datentyp: I-die ganye Zahl(16),LI-die lange ganze Zahl (32),F-die reelle Zahl; numb - die Registernummer (dec., hex., oder oktal.); id - der Bezeichner des gebildeten Attributs; name - der Name des gebildeten Attributs. Пример: 'I:0x300:var:Variable' - der Zugang wie zum Ganzen; 'F:200:float:Float' - das Erhalten der reellen Zahl aus den Registern 200 und 201; 'LI:300:int32:Int32' -das Erhalten von int32 aus den Registern 300 und 301.
ru: Список конфигурации атрибутов. Список должен формироваться строками в формате: [dt:numb:id:name] Где: dt - тип данных: I-целое(16),LI-целое длинное(32),F-вещественное; numb - номер регистра (десят., шестн., или восьмеричн.); id - идентификатор создаваемого атрибута; name - имя создаваемого атрибута. Пример: 'I:0x300:var:Variable' - доступ как к целому; 'F:200:float:Float' - получение вещественного из регистров 200 и 201; 'LI:300:int32:Int32' - получение int32 из регистров 300 и 301.

source: Registers' fragments merge
de: Die Verbindung der Registerfragmente
ru: Объединение фрагментов регистров

source: Value
de: Die Bedeutung
ru: Значение

source: Pressure
de: Der Druck
ru: Давление

source: Temperature
de: Die Temperatur
ru: Температура

source: Current flow
de: Laufender Verbrauch
ru: Текущий расход

source: Quantity for start day
de: Die Quantität seit dem Tagesanfang
ru: Количество с начала суток

source: Quantity for last day
de: Die Quantität für die letzten vierundzwanzig Stunden
ru: Количество за предыдущие сутки

source: Quantity for start
de: Die Quantität nach dem Starten der Kontrolle
ru: Количество с начала наблюдений

source: Caloric
de: Kaloriengehalt
ru: Калорийность

source: 14:Connection error or respond size short.
de: 14:Fehler der Verbindung oder die Antwort ist kurz.
ru: 14:Ошибка соединения или ответ короткий.

source: 10:Respond error.
de: 10:Fehler der Antwort.
ru: 10:Ошибка ответа.

source: 11:Request broken.
de: 11:Requestfehler.
ru: 11:Ошибка запроса.

source: 15:Respond thread broken.
de: 15:Fehler des Antwortsfadens.
ru: 15:Ошибка нити ответа.

source: Thread number
de: Nummer des Fadens
ru: Номер нитки

source: Firmware version
de: Die Firmwareversion
ru: Версия ПО

source: Input transport
de: Eingabetransport
ru: Входной транспорт

source: Master password
de: Master Passwort
ru: Мастер пароль

source: Master PLC serial number
de: Master-SPS-Seriennummer
ru: Серийный номер Мастер ПЛК

source: Controllers network config-file
de: Controller-Netzwerkkonfigurationsdatei
ru: Конфиг. файл сети контроллеров

source: PLC serial number
de: SPS-Seriennummer
ru: Серийный номер ПЛК

source: Set PLC clock on different for more (s)
ru: Уст. часы ПЛК при отклонении более (с)

source: PLC clock's zone
de: Zeitzone der SPS-Uhr
ru: Зона часов ПЛК

source: List
de: Liste
ru: Список

source: Parameter
ru: Параметр

source: Master PLC ID Request: '%s'
de: Master-PLC-ID-Anfrage: '%s'
ru: Запрос ID Мастер ПЛК: '%s'

source: Connection from PLC Kontar %xh.
de: Verbindung von SPS Kontar %xh.
ru: Подключение с ПЛК Kontar %xh.

source: Password sequence set: '%s'.
de: Passwortreihenfolge: '%s'.
ru: Установка последовательности пароля: '%s'.

source: Master PLC ID Response: '%s'
de: Master-SPS-ID-Antwort: '%s'
ru: Ответ ID Мастер ПЛК: '%s'

source: No a propper connection from PLC.
de: Keine ordnungsgemäße Verbindung von der SPS.
ru: Нет подходящего подключения от ПЛК.

source: Request: '%s'
de: Anfordern: '%s'
ru: Запрос: '%s'

source: Request (enc): '%s'
de: Anfrage (enc): '%s'
ru: Запрос (код): '%s'

source: 13:Unapt MasterPLC ID: %xh != %xh
ru: 13:Неподходящий ID МастерПЛК: %xh != %xh

source: 12:PLC: The password encripted by master key.
ru: 12:ПЛК: Пароль кодирован мастер ключём.

source: 12:PLC: Error.
de: 12:SPS: Fehler.
ru: 12:ПЛК: Ошибка.

source: 12:PLC: Unknown command.
de: 12:SPS: Unbekannter Befehl.
ru: 12:ПЛК: Неизвестная команда.

source: 12:PLC: Wrong command format.
de: 12:SPS: Falsches Befehlsformat.
ru: 12:ПЛК: Ошибка формата команды.

source: 12:PLC: Error read from slave.
de: 12:SPS: Fehler vom Slave gelesen.
ru: 12:ПЛК: Ошибка чтения из подчинённого.

source: 12:PLC: Network update in process.
de: 12:SPS: Netzwerkaktualisierung läuft.
ru: 12:ПЛК: Обновление сети в процессе.

source: Response (enc): '%s'
de: Antwort (enc): '%s'
ru: Ответ (код): '%s'

source: Response: '%s'
de: Antwort: '%s'
ru: Ответ: '%s'

source: Error: '%s': '%s'
de: Fehler: '%s': '%s'
ru: Ошибка: '%s': '%s'

source: 15:Response PDU size (%d from %d) error.
de: 15:Antwort PDU-Größe (%d von %d) Fehler.
ru: 15:Ошибка размера PDU (%d из %d) ответа.

source: <No select>
de: <Keine Auswahl>
ru: <Не выбрано>

source: AMR devices
de: Die AMR-Devices
ru: Устройства АСКУ

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко

source: Allow access to automatic meter reading devices. Supported devices: Kontar (http://www.mzta.ru).
ru: Предоставляет доступ к устройствам счётчиков коммерческого учёта. Поддерживаются устройства: Kontar (http://www.mzta.ru).

source: Acquisition schedule
de: Planung der Befragung
ru: Планирование опроса

source: Gather task priority
ru: Уровень приоритета задачи сбора данных

source: Restore timeout (s)
ru: Время восстановления (с)

source: Request tries
de: Anfrageversuche
ru: Попыток запроса

source: Call by period: %s.
de: Anrufung mit der Periode: %s.
ru: Вызовы с периодом: %s.

source: Call next by cron '%s'.
de: Anrufung nach dem Plan '%s'.
ru: Следующий вызов по cron '%s'.

source: Spent time: %s.
de: Zeit genommen: %s.
ru: Затрачено времени: %s.

source: Status
ru: Статус

source: Disabled
de: Deaktiviert
ru: Отключен

source: Enabled
de: Eingeschaltet
ru: Включен

source: Processed
de: Bearbeitung
ru: Обработка

source: 11:Value not gathered.
de: 11:Der Wert ist nicht empfangen.
ru: 11:Значение не получено.

source: Set PLC clock on different for more, seconds
de: Stellen Sie SPS-Uhr auf verschiedenen für mehr Sekunden

source: 13:Inapt MasterPLC ID: %xh != %xh
de: 13:Eingebaute Master-SPS-ID: %xh != %Xh

source: 12:PLC: The password encrypted by master key.
de: 12:SPS: Das Passwort wird mit dem Hauptschlüssel verschlüsselt.

source: Closing the file %d error '%s (%d)'!
de: Schließen der Datei %d Fehler '%s (%d)'!

source: Provides access to automatic meter reading devices. Supported devices: Kontar (http://www.mzta.ru).
de: Ermöglicht den Zugang zu den Zählerwerken der kommerziellen Inventur. Es werden die Anlagen unterstützt: Kontar (http://www.mzta.ru).

source: Priority of the acquisition task
de: Priorität der Erfassungsaufgabe

source: Restore timeout, seconds
de: Wiederaufbauzeit, Sekunden
