Repository: aleax/openscada
Catalog: src/moduls/daq/Siemens/po/*.po
Languages: de, ru, uk

source: Special address format: Siemens-DB address writes in the form "(DB{N}|F).{off}[.[{tp}]{SzBit}]", where: DB{N} - Data Block number in decimal, can be negative one for the specific data areas of the ISO_TCP connection types; F - the Flags/Markers specific data area (131) of the ISO_TCP connection types; off - offset in the Data Block; tp - type in one symbol from the list: b-Boolean, i-Signed integer, u-Unsigned integer, r-Real, s-String; SzBit - type size for non Boolean or bit of byte for it: b=[0...7], iu=[1,2(def),4,8], r=[4(def).8], s=[0(def10)...100]. Examples: "DB1.12.2", "DB1.0xC.2", "DB1.12.b2" - Boolean in DB 1, offset 12 and bit 2; "DB2.24", "DB2.0x18.8" - Integer or Real, taken from the template's IO type, in DB 2, offset 24, size default and 8; "DB3.36.i4", "DB3.0x24.r8" - directly specified Integer and Real in DB 3, offset 36, size 4 and 8; "DB4.48.20", "DB4.0x30.s20" - implicitly, from the template IO type, and directly specified String in DB 4, offset 48 and size 20; "F.12.5" - Boolean in the Flags/Markers data area, offset 12 and bit 5. Link's template, of the column "Value" on the template forming side, writes in the form "{LnkName}|{OffDB}[.{bit}][|[{tp}]{sz}]", where: LnkName - name of the group link; all references with the same name are grouped and indicated as one reference to the data block or data block with the specified offset; OffDB - offset number in the data block; if you specify only the data block, when configuring the template, this offset will be specified for the parameter; if the configuration of the template also specifies an offset, both offsets will be summed together; the data block number and the offset can be specified both in the decimal (3245) and hexadecimal format (0xCAD); bit - bit number for Boolean, [0...7]; tp - type in one symbol from the list: i-Signed integer, u-Unsigned integer, r-Real, s-String; sz - type size: iu=[1,2(def),4,8], r=[4(def).8], s=[0(def10)...100]. Examples: "Grp 1|0.0" - Boolean in "Grp 1", offset 0 and bit 0; "Grp 2|10|1", "Grp 2|0xA|i1" - Integer, from the template IO type and directly, in "Grp 2", offset 10 and size 1; "Grp 3|20|20", "Grp 3|0x13|s20" - String, from the template IO type and directly, in "Grp 3", offset 20 and size 20. Common address format:
ru: Формат специального адреса: Адрес Siemens-БД записывается в форме "(DB{N}|F).{off}[.[{tp}]{SzBit}]", где: DB{N} - десятичный номер Блока Данных, может быть отрицательным для специфических областей данных типов подключения ISO_TCP; F - специфическая область данных Флагов/Маркеров (131) типов подключения ISO_TCP; off - смещение в Блоке Данных; tp - тип одним символом из перечня: b-Логический, i-Знаковое целое, u-Беззнаковое целое, r-Вещественное, s-Строка; SzBit - размер типа для не Логического или бит байта для него: b=[0...7], iu=[1,2(тип.),4,8], r=[4(тип.),8], s=[0(тип.10)...100]. Примеры: "DB1.12.2", "DB1.0xC.2", "DB1.12.b2" - Логический в БД 1, смещение 12 и біт 2; "DB2.24", "DB2.0x18.8" - Целое или Вещественное, полученное из типа ВВ шаблона, в БД 2, смещение 24, размер типовой и 8; "DB3.36.i4", "DB3.0x24.r8" - прямо определённое Целое и Вещественное в БД 3, смещение 36, размер 4 и 8; "DB4.48.20", "DB4.0x30.s20" - неявно, из типа ВВ шаблона, и прямо определённая Строка в БД 4, смещение 48 и размер 20; "F.12.5" - Логическое в области данных Флаги/Маркеры, смещение 12 и бит 5. Шаблон связи, колонки "Значение" на стороне формирования шаблона, записывается в форме "{LnkName}|{OffDB}[.{bit}][|[{tp}]{sz}]", где: LnkName - имя групповой ссылки; все ссылки с одинаковым именем группируются и указываются как одна ссылка на блок данных или блок данных с указанным смещением; OffDB - номер смещения в блоке данных; при указании только блока данных, при конфигурации шаблона, это смещение будет указанно для параметра; если-же при конфигурации шаблона будет указано и смещение, то оба смещения будут суммироваться вместе; номер блока данных и смещение можно указывать в десятичном (3245) и шестнадцатеричном формате (0xCAD); bit - номер бита для Логического, [0...7]; tp - тип одним символом из перечня: i-Знаковое целое, u-Беззнаковое целое, r-Вещественное, s-Строка; sz - размер типа: iu=[1,2(тип.),4,8], r=[4(тип.),8], s=[0(тип.10)...100]. Примеры: "Grp 1|0.0" - Логический в "Grp 1", смещение 0 и бит 0; "Grp 2|10|1", "Grp 2|0xA|i1" - Целое, из типа ВВ шаблона и прямо, в "Grp 2", смещение 10 и размер 1; "Grp 3|20|20", "Grp 3|0x13|s20" - Строка, из типа ВВ шаблона и прямо, в "Grp 3", смещение 20 и размер 20. Формат общего адреса:
uk: Формат спеціальної адреси: Адреса Siemens-БД записується у формі "(DB{N}|F).{off}[.[{tp}]{SzBit}]", де: DB{N} - десятковий номер Блоку Даних, може бути негативним для специфічних областей даних типів підключення ISO_TCP; F - специфічна область даних Прапорців/Маркерів (131) типів підключення ISO_TCP; off - зсув у Блоку Даних; tp - тип одним символом з переліку: b-Логічний, i-Знакове ціле, u-Беззнакове ціле, r-Реальне, s-Рядок; SzBit - розмір типу для не Логічного або біт байту для нього: b=[0...7], iu=[1,2(тип.),4,8], r=[4(тип.),8], s=[0(тип.10)...100]. Приклади: "DB1.12.2", "DB1.0xC.2", "DB1.12.b2" - Логічний у БД 1, зсув 12 та біт 2; "DB2.24", "DB2.0x18.8" - Ціле або Реальне, отримане з типу ВВ шаблону, у БД 2, зсув 24, розмір типовий та 8; "DB3.36.i4", "DB3.0x24.r8" - прямо визначене Ціле та Реальне у БД 3, зсув 36, розмір 4 та 8; "DB4.48.20", "DB4.0x30.s20" - неявно, з типу ВВ шаблону, та прямо визначений Рядок у БД 4, зсув 48 та розмір 20; "F.12.5" - Логічне у області даних Прапорці/Маркери, зміщення 12 та біт 5. Шаблон зв'язку, стовпчику "Значення" на боці формування шаблону, записується у формі "{LnkName}|{OffDB}[.{bit}][|[{tp}]{sz}]", де: LnkName - назва групового посилання. Всі посилання із однаковою назвою групуються та вказуються як одне посилання на блок даних або блок даних з вказаним зсувом; OffDB - номер зсуву у блоці даних; при зазначені тільки блоку даних, при конфігурації шаблону, цей зсув буде вказано для параметру; якщо-ж при конфігурації шаблону буде вказано і зсув, то обидва зсуви будуть сумуватися разом; номер блоку даних та зсув можна вказувати у десятковому (3245) та шістнадцятковому форматі (0xCAD); bit - номер біта для Логічного, [0...7]; tp - тип одним символом з переліку: i-Знакове ціле, u-Беззнакове ціле, r-Реальне, s-Рядок; sz - розмір типу: iu=[1,2(тип.),4,8], r=[4(тип.),8], s=[0(тип.10)...100]. Приклади: "Grp 1|0.0" - Логічний у "Grp 1", зсув 0 та біт 0; "Grp 2|10|1", "Grp 2|0xA|i1" - Ціле, з типу ВВ шаблону та прямо, у "Grp 2", зсув 10 та розмір 1; "Grp 3|20|20", "Grp 3|0x13|s20" - Рядок, з типу ВВ шаблону та прямо, у "Grp 3", зсув 20 та розмір 20. Формат загальної адреси:

source: Acquisition with the period: %s.
de: Erwerb mit dem Zeitraum: %s.
uk: Збір з періодом: %s.

source: Spent time: %s[%s]. Read %s. Wrote %s. Connection errors %g.
de: Verbrachte Zeit: %s[%s]. Lesen %s. Schrieb %s. Verbindungsfehler %g.
uk: Витрачено часу: %s[%s]. Прочитано %s. Записано %s. Помилок підключення %g.

source: Task is terminated!
de: Aufgabe ist beendet!

source: Error calculating template.
de: Fehler beim Berechnen der Vorlage.

source: Parameter disabled or error.
de: Parameter ist abgeschaltet oder Fehler.

source: Special address format: Siemens-DB address writes in the form "DB{N}.{off}[.{BOff}|{TpSz}]", where: N - Data Block number; off - offset in the Data Block; BOff- bit of the byte for Boolean; TpSz- type and size for other to Boolean types in the form "[{tp}]{sz}", where: tp - type in one symbol from the list: b-Boolean, i-Signed integer, u-Unsigned integer, r-Real, s-String; sz - the type size: b=[0...7], iu=[1,2(def),4,8], r=[4(def).8], s=[0(def10)...100]. Examples: "DB1.12.2", "DB1.0xC.2", "DB1.12.b2" - Boolean in DB 1, offset 12 and bit 2; "DB2.24", "DB2.0x18.8" - Integer or Real, taken from the template's IO type, in DB 2, offset 24, size default and 8; "DB3.36.i4", "DB3.0x24.r8" - directly specified Integer and Real in DB 3, offset 36, size 4 and 8; "DB4.48.20", "DB4.0x30.s20" - implicitly, from the template IO type, and directly specified String in DB 4, offset 48 and size 20. Link's template, of the column "Value" on the template forming side, writes in the form "{LnkName}|{OffDB[.{bit}]}[|{TpSz}]", where: LnkName - name of the group link; all references with the same name are grouped and indicated as one reference to the data block or data block with the specified offset; OffDB - offset number in the data block; if you specify only the data block, when configuring the template, this offset will be specified for the parameter; if the configuration of the template also specifies an offset, both offsets will be summed together; the data block number and the offset can be specified both in the decimal (3245) and hexadecimal format (0xCAD); bit - bit number for Boolean; TpSz - equal to the same field above. Examples: "Grp 1|0.0" - Boolean in "Grp 1", offset 0 and bit 0; "Grp 2|10|1", "Grp 2|0xA|i1" - Integer, from the template IO type and directly, in "Grp 2", offset 10 and size 1; "Grp 3|20|20", "Grp 3|0x13|s20" - String, from the template IO type and directly, in "Grp 3", offset 20 and size 20. Common address format:
de: Spezielles Adressformat: Die Siemens-DB-Adresse schreibt in der Form "DB{N}.{off}[.{BOff}|{TpSz}]", wobei: N - Datenblocknummer; off - Offset im Datenblock; BOff- Bit des Bytes für Boolean; TpSz- Typ und Größe für andere Boolesche Typen im Formular "[{tp}]{sz}", wobei: tp - Geben Sie ein Symbol aus der Liste ein: b-Boolean, i-Signed Integer, u-Unsigned Integer, r-Real, s-String; sz - die Schriftgröße: b=[0...7], iu=[1,2(def),4,8], r=[4(def).8], s=[0(def10)...100]. Beispiele: "DB1.12.2", "DB1.0xC.2", "DB1.12.b2" - Boolean in DB 1, Offset 12 und Bit 2; "DB2.24", "DB2.0x18.8" - Ganzzahl oder Real, aus dem IO-Typ der Vorlage, in DB 2, Offset 24, Größe standard und 8; "DB3.36.i4", "DB3.0x24.r8" - direkt angegeben Integer und Real in DB 3, Offset 36, Größe 4 und 8; "DB4.48.20", "DB4.0x30.s20" - implizit aus dem Vorlagen IO-Typ und direkt angegebener String in DB 4, Offset 48 und Größe 20. Link-Vorlage, der Spalte "Value" ist die Vorlage bildende Seite, schreibt in das Formular "{LnkName}|{OffDB[.{bit}]}[|{TpSz}]", wobei: LnkName - Name des Gruppenlinks; Alle Referenzen gleichen Namens werden gruppiert und als eine Referenz auf den Datenbaustein bzw; Datenbaustein mit dem angegebenen Offset angezeigt; OffDB - Offset-Nummer im Datenblock; Wenn Sie nur den Datenblock angeben, wird dieser Offset beim Konfigurieren der Vorlage für den Parameter angegeben; Wenn die Konfiguration der Vorlage auch einen Offset angibt, werden beide Offsets zusammen summiert; die Datenblocknummer und der Offset können sowohl im dezimalen (3245) als auch im hexadezimalen Format (0xCAD) angegeben werden; bit - Bit-Nummer für Boolean; TpSz - gleich dem gleichen Feld oben. Beispiele: "Grp 1|0.0" - Boolesch in "Grp 1", Offset 0 und Bit 0; "Grp 2|10|1", "Grp 2|0xA|i1" - Integer, vom Template-IO-Typ und direkt in "Grp 2", Offset 10 und Größe 1; "Grp 3|20|20", "Grp 3|0x13|s20" - String, vom Template-IO-Typ und direkt in "Grp 3", Offset 20 und Größe 20. Gemeinsames Adressformat:
