Repository: aleax/openscada
Catalog: src/moduls/daq/Siemens/po/*.po
Languages: de, ru, uk

source: Siemens DAQ and Beckhoff
de: Datenerfassung Siemens und Beckhoff
ru: Сбор данных Siemens и Beckhoff
uk: Збір даних Siemens та Beckhoff

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: Provides for support of data sources of Siemens PLCs by means of Hilscher CIF cards (using the MPI protocol) and LibnoDave library (or the own implementation) for the rest. Also there is supported the data sources of the firm Beckhoff for the protocol TwinCAT ADS/AMS due it working with data blocks also.
de: Ermöglicht die Unterstützung von Datenquellen von Siemens-Steuerungen mittels Hilscher-CIF-Karten (unter Verwendung des MPI-Protokolls) und der LibnoDave-Bibliothek (oder der eigenen Implementierung) für den Rest. Auch hier werden die Datenquellen der Firma Beckhoff für das Protokoll TwinCAT ADS / AMS unterstützt, da es auch mit Datenbausteinen arbeitet.
ru: Обеспечивает поддержку источников данных ПЛК Siemens с помощью карт HILSCHER CIF (протоколом MPI) и библиотеки LibnoDave (или собственной реализации) для остального. Также поддерживаются источники данных фирмы Beckhoff для протокола TwinCAT ADS/AMS, поскольку он также работает с блоками данных.
uk: Забезпечує підтримку джерел даних ПЛК Siemens за допомогою карт HILSCHER CIF (протоколом MPI) та бібліотеки LibnoDave (або власної реалізації) для решти. Також підтримуються джерела даних фірми Beckhoff для протоколу TwinCAT ADS/AMS, оскільки він також працює з блоками даних.

source: Parameters table
de: Tabelle der Parameter
ru: Таблица параметров
uk: Таблиця параметрів

source: Simple parameters table
ru: Таблица простых параметров
uk: Таблиця простих параметрів

source: Acquisition schedule
de: Planung der Befragung
ru: Планирование сбора
uk: Планування збору

source: Priority of the acquisition task
de: Priorität der Erwerbsaufgabe
ru: Приоритет задачи получения данных
uk: Пріоритет задачі збору даних

source: Restore timeout, seconds
de: Zeit der Wiederherstellung, Sekunden
ru: Интервал восстановления, секунд
uk: Час відновлення, секунд

source: Asynchronous write mode
de: Asynchroner Schreibmodus
ru: Асинхронный режим записи
uk: Асинхронний режим запису

source: Connection type
de: Typ der Verbindung
ru: Тип соединения
uk: Тип з'єднання

source: Remote controller address
de: Adresse des entfernen Controllers
ru: Адрес удалённого контроллера
uk: Адреса віддаленого контролеру

source: Output transport
ru: Выходной транспорт
uk: Вихідний транспорт

source: CPU slot of the PLC
de: CPU Schlitz der PLC
ru: Слот ЦП ПЛК
uk: Слот ЦП ПЛК

source: CIF board
de: CIF Karte
ru: CIF плата
uk: CIF плата

source: Maximum size of the request block, bytes
ru: Максимальный размер блока запроса, байты

source: Logical
de: Logisch
ru: Логический
uk: Логічний

source: Parameter template
de: Vorlage des Parameters
ru: Шаблон параметра
uk: Шаблон параметру

source: Parameter ID
de: Bezeichner des Parameters
ru: Идентификатор параметра
uk: ID параметру

source: Identifier
de: Identifikator
ru: Идентификатор
uk: Ідентифікатор

source: Value
de: Wert
ru: Значение
uk: Значення

source: Simple
ru: Простой
uk: Простий

source: Attributes list
ru: Перечень атрибутов
uk: Перелік атрибутів

source: Address
de: Adresse
ru: Адрес
uk: Адреса

source: Speed
de: Geschwindigkeit
ru: Скорость
uk: Швидкість

source: No device
de: Kein Baustein
ru: Нет устройства
uk: Немає пристрою

source: Error the CIF device %d or the device driver.
de: Error das CIF-Gerät %d oder den Gerätetreiber.
ru: Ошибка CIF устройства %d или драйвера!
uk: Помилка CIF пристрою %d або драйверу!

source: Error starting up the CIF device %d (DevSetHostState(HOST_READY)).
de: Fehler beim Starten des CIF-Geräts %d (DevSetHostState (HOST_READY)).
ru: Ошибка запуска CIF устройства %d (DevSetHostState(HOST_READY)).
uk: Помилка запуску (DevSetHostState(HOST_READY)) CIF пристрою %d!

source: DevPutTaskParameter: error the CIF device %d.
de: DevPutTaskParameter: Fehler beim CIF-Gerät %d.
ru: DevPutTaskParameter: ошибка CIF устройства %d.
uk: DevPutTaskParameter: помилка CIF пристрою %d.

source: DevPutMessage: error the CIF device %d.
de: DevPutMessage: Fehler beim CIF-Gerät %d.
ru: DevPutMessage: ошибка CIF устройства %d.
uk: DevPutMessage: помилка CIF пристрою %d.

source: DevGetMessage: error the CIF device %d.
de: DevGetMessage: Fehler beim CIF-Gerät %d.
ru: DevGetMessage: ошибка CIF устройства %d.
uk: DevGetMessage: помилка CIF пристрою %d.

source: Error sending message: %d.
de: Fehler beim Senden der Nachricht: %d.
ru: Ошибка отправки сообщения: %d.
uk: Помилка відправлення повідомлення: %d.

source: Error getting message: %d.
de: Fehler beim Abrufen der Nachricht: %d.
ru: Ошибка получения сообщения: %d.
uk: Помилка отримання повідомлення: %d.

source: %d:The board %d is not present.
de: %d:Die Tafel %d ist nicht vorhanden.
ru: %d:Плата %d отсутствует.
uk: %d:Плата %d відсутня.

source: %d:Error sending request: %d.
de: %d:Fehler beim Senden der Anfrage: %d.
ru: %d:Ошибка отправки сообщения: %d.
uk: %d:Помилка надсилання запиту: %d.

source: %d:Error getting request: %d.
de: %d:Fehler beim Abrufen der Anfrage: %d.
ru: %d:Ошибка получения сообщения %d.
uk: %d:Помилка отримання запиту: %d.

source: Status
ru: Состояние
uk: Статус

source: CIF driver
de: CIF-Treiber
ru: CIF драйвер
uk: CIF драйвер

source: CIF devices
de: CIF-Bausteine
ru: CIF устройства
uk: CIF пристрої

source: Board
de: Karte
ru: Плата
uk: Плата

source: Firmware name
de: Name der Firmware
ru: Имя прошивки
uk: Ім'я прошивки

source: Firmware version
de: Version der Firmware
ru: Версия прошивки
uk: Версія прошивки

source: Physical address
de: Physikalische Adresse
ru: Физический адрес
uk: Фізична адреса

source: PB address
de: PB Adresse
ru: PB адрес
uk: PB адреса

source: PB speed
de: PB (Profibus) Geschwindigkeit
ru: PB скорость
uk: PB швидкість

source: CIF device
de: CIF Baustein
ru: CIF устройство
uk: CIF пристрій

source: Live stations list
de: Live-Sender Liste
ru: Список живых станций
uk: Перелік живих станцій

source: Error the board %d.
de: Fehler in der Karte %d.
ru: Ошибка платы %d.
uk: Помилкова плата %d.

source: 9600Baud
ru: 9600Бод
uk: 9600Бод

source: 19.2kBaud
ru: 19.2kБод
uk: 19.2kБод

source: 93.75kBaud
ru: 93.75kБод
uk: 93.75kБод

source: 187.5kBaud
ru: 187.5kБод
uk: 187.5kБод

source: 500kBaud
ru: 500kБод
uk: 500kБод

source: 1.5MBaud
ru: 1.5MБод
uk: 1.5MБод

source: 3MBaud
ru: 3MБод
uk: 3MБод

source: 6MBaud
de: 6МBaud
ru: 6МБод
uk: 6MБод

source: 12MBaud
de: 12Мbaud
ru: 12МБод
uk: 12MБод

source: : Active station
de: : Aktive Station
ru: : Активная станция
uk: : Активна станція

source: : Passive station
ru: : Пассивная станция
uk: : Пасивна станція

source: Task terminated!
ru: Задача прервана!
uk: Завдання перервано!

source: Error connecting.
de: Fehler beim Verbinden.
ru: Ошибка подключения.
uk: Помилка підключення.

source: Restoring in %.6g s.
de: Wiederherstellung in %.6g sek.
ru: Восстановления через %.6g с.
uk: Відновлення через %.6g c.

source: Acquisition.
de: Erwerb.
ru: Сбор.
uk: Збір.

source: Acquisition with the period %s.
ru: Сбор с периодом %s.

source: Next acquisition by the cron '%s'.
de: Erwerb nächsten durch cron '%s'.
ru: Следующий сбор по cron '%s'.
uk: Наступний збір за cron '%s'.

source: Spent time %s[%s], read %s, wrote %s, connection errors %g.
ru: Затрачено время %s[%s], прочитано %s, записано %s, ошибок подключения %g.

source: Connection to the data source: %s.
de: Verbindung zur Datenquelle: %s.
ru: Подключение к источнику данных: %s.
uk: Підключення до джерела даних: %s.

source: STOP
ru: ОСТАНОВЛЕН
uk: ЗУПИНЕНО

source: -1:No data
de: -1:Keine Daten
ru: -1:Нет данных
uk: -1:Немає даних

source: No one driver or board are present.
de: Treiber oder CP (Karte) sind nicht vorhanden.
ru: Нет ни одного CP или драйвера.
uk: Немає жодного пристрою або драйвер відсутній.

source: Error opening the remote PLC socket.
de: Fehler beim Öffnen des Remote-SPS-Sockets.
ru: Ошибка открытия сокета удалённого ПЛК.
uk: Помилка відкриття сокету віддаленого ПЛК.

source: Error connecting to the PLC.
de: Fehler beim Verbinden mit der PLC.
ru: Ошибка подключения к ПЛК.
uk: Помилка підключення до ПЛК.

source: The connection type '%d' is not supported.
de: Der Verbindungstyp '%d' wird nicht unterstützt.
ru: Тип соединения '%d' не поддерживается.
uk: Тип підключення '%d' не підтримується.

source: The connector works only with Data Blocks.
ru: Подключатель работает только с Блоками Данных.
uk: З’єднувач працює лише з Блоками Даних.

source: Requested block is too big.
de: Der angefragte Block ist zu groß.
ru: Запрошенный блок очень большой.
uk: Запитаний блок дуже великий.

source: The board %d is not present.
de: Die Tafel %d ist nicht vorhanden.
ru: Плата %d отсутствует.
uk: Плата %d відсутня.

source: Timeout sending request.
de: Timeout-Sendeanfrage.
ru: Исчерпано время отправки сообщения.
uk: Вичерпано час відправлення запиту.

source: Error requesting to DB: %d.
de: Fehler beim Anfordern der DB: %d.
ru: Ошибка запроса БД: %d.
uk: Помилка запиту до DB: %d.

source: ReadDB
de: LesenDB
ru: ЧтениеБД
uk: ЧитанняБД

source: Timeout the get request.
de: Timeout die Anfrage erhalten.
ru: Исчерпано время получения сообщения.
uk: Вичерпано час отримання запиту.

source: There is no response from the remote station.
de: Keine Antwort von der entfernten Station.
ru: Нет ответа от удалённой станции.
uk: Немає відповіді від віддаленої станції.

source: Master is out of the logical token ring.
de: Master ist nicht Teil des logischen Rings.
ru: Мастер не внутри логического кольца.
uk: Майстер не у логічному колі.

source: Error the specified offset address or DB.
de: Error die angegebene Offset-Adresse oder DB.
ru: Ошибка указанного адреса смещения или БД.
uk: Помилка визначення адреси зміщення або БД.

source: Error reading the block %d: %s.
de: Fehler beim Lesen des Blocks %d: %s.
ru: Ошибка чтения блока %d: %s.
uk: Помилка читання блоку %d: %s.

source: Error the DB %d: %s.
de: Fehler in der DB %d: %s.
ru: Ошибка БД %d: %s.
uk: Помилка БД %d: %s.

source: Error the server response.
de: Fehler bei der Serverantwort.
ru: Ошибка ответа сервера.
uk: Помилка відповіді серверу.

source: Not full response.
de: Nicht vollständige Antwort.
ru: Неполный ответ.
uk: Неповна відповідь.

source: Error the server response: %d.
de: Fehler bei der Serverantwort: %d.
ru: Ошибка ответа сервера: %d.
uk: Помилка відповіді серверу: %d.

source: Size of the response data block %d != %d.
de: Größe des Antwortdatenblocks %d != %d.
ru: Размер блока данных ответа %d != %d.
uk: Розмір блока даних відповіді %d != %d.

source: Transmitted block is too big.
de: Übermittelter Block ist zu groß.
ru: Передаваемый блок очень большой.
uk: Передаваний блок дуже великий.

source: Timeout getting request.
de: Timeout bekommen Anfrage.
ru: Исчерпано время получения ответа.
uk: Вичерпано час отримання запиту.

source: WriteDB
de: SchreibeDB
ru: ЗаписьБД
uk: ЗаписБД

source: Error writing the block %d: %s.
de: Fehler beim Schreiben des Blocks %d: %s.
ru: Ошибка записи блока %d: %s.
uk: Помилка запису блоку %d: %s.

source: Unknown target protocol '%s'.
de: Unknown Ziel-Protokoll '%s'.
ru: Неизвестный целевой протокол '%s'.
uk: Невідомий цільовий протокол '%s'.

source: Unknown service '%s'.
ru: Неизвестный сервис '%s'.
uk: Невідомий сервіс '%s'.

source: Inconsistency in response size.
de: Inkonsistenz in der Antwortgröße.
ru: Несоответствие размера ответа.
uk: Невідповідність розміру відповіді.

source: Short.
de: Kurz.
ru: Короткий.
uk: Короткий.

source: Error the PDU type, %d != %d.
de: Fehler beim PDU-Typ, %d != %d.
ru: Ошибка типа PDU, %d != %d.
uk: Помилка PDU типу, %d != %d.

source: Inappropriate size.
de: Ungeeignete Größe.
ru: Несоответствие размера.
uk: Невідповідний розмір.

source: PDU header
ru: Заголовок PDU
uk: Заголовок PDU

source: Not started from 0x32.
de: Nicht von 0x32 gestartet.
ru: Не начинается с 0x32.
uk: Не починається з 0x32.

source: Inconsistency of the response ID to his request one, %d != %d.
de: Inkonsistenz der Antwort-ID zu seiner Anfrage, %d != %d.
ru: Несоответствие ID ответа его запросу, %d != %d.
uk: Невідповідність ID відповіді його виклику, %d != %d.

source: PLC error: [%d] %s
de: SPS-Fehler: [%d] %s
ru: Ошибка ПЛК: [%d] %s
uk: Помилка ПЛК: [%d] %s

source: Size of the parameters + data more to the response size.
de: Größe der Parameter + Daten mehr zur Antwortgröße.
ru: Размер параметров + данных более размера ответа.
uk: Розмір параметрів + даних більш за розмір відповіді.

source: Parameters part size does not match for expected value, %d.
de: Parameter Teilgröße nicht für erwarteten Wert, %d entsprechen.
ru: Размер части параметров не соответствует ожидаемому, %d.
uk: Розмір частини параметрів не відповідає очікуванню, %d.

source: Inconsistency of the response function.
de: Inkonsistenz der Antwortfunktion.
ru: Несоответствующая функция ответа.
uk: Невідповідність функції відповіді.

source: An attempt to access outside the DB '%s' (200 family), %s(%s).
de: Ein Versuch, außerhalb des DB '%s' (200 Familie), %s(%s) zuzugreifen.
ru: Попытка доступа за границы БД '%s' (семейства 200), %s(%s).
uk: Спроба доступу за межі БД '%s' (сімейство 200), %s(%s).

source: An attempt to access outside the DB '%s', %s(%s).
de: Ein Versuch, außerhalb des DB '%s', %s(%s) zuzugreifen.
ru: Попытка доступа за границы БД '%s', %s(%s).
uk: Спроба доступу за межі БД '%s', %s(%s).

source: The DB '%s' doesn't exist.
de: Der DB '%s' existiert nicht.
ru: БД '%s' отсутствует.
uk: БД '%s' відсутній.

source: Unknown error accessing to DB, %xh.
de: Unbekannter Fehler beim Zugriff auf DB, %xh.
ru: Неизвестная ошибка доступа к БД, %xh.
uk: Невідома помилка доступу до БД, %xh.

source: Unknown data encoding type, %d.
de: Unbekannter Datencodierungstyp, %d.
ru: Неизвестный тип данных, %d.
uk: Невідомий тип кодування, %d.

source: Inconsistency in the size of the data block to the response size, %d(%d).
de: Inkonsistenz in der Größe des Datenblocks zur Antwortgröße, %d(%d).
ru: Несоответствие размера блока данных размеру ответа, %d(%d).
uk: Невідповідність розміру блоку даних до розміру відповіді, %d(%d).

source: %d:The value is not gathered.
de: %d:Der Wert wird nicht erfasst.
ru: %d:Значение не получено.
uk: %d:Значення не отримано.

source: Error value type '%s'.
de: Fehlerwerttyp '%s'.
ru: Ошибка типа значения '%s'.
uk: Помилковий тип значення '%s'.

source: OK
ru: НОРМА
uk: НОРМА

source: IN REDUNDANCY
ru: РЕЗЕРВИРОВАНИЕ
uk: РЕЗЕРВУВАННЯ

source: Manual restart of the enabled controller object causes the force reformation of the acquisition blocks. Restart to apply the removed PLC links in run.
ru: Ручной перезапуск включенного объекта контроллера вызывает принудительное переформирование блоков сбора. Перезапустите для применения удалённых при исполнении связей ПЛК.

source: Connection type, supported ones: CIF_PB - connection to S7 controllers of the firm Siemens via CIF-50PB communication processor or similar; ISO_TCP, ISO_TCP243 - connection to S7 controllers of the firm Siemens via the Ethernet network (TCP243 by CP243); ADS - TwinCAT ADS/AMS protocol for connecting to controllers of the firm Beckhoff.
de: Verbindungstyp: CIF_PB - Anbindung an S7-Steuerungen der Firma Siemens über CIF-50PB-Kommunikationsprozessor o.ä.; ISO_TCP, ISO_TCP243 - Anbindung an S7-Steuerungen der Firma Siemens über das Ethernet-Netzwerk (TCP243 von CP243); ADS - TwinCAT ADS / AMS-Protokoll zum Anschluss an Steuerungen der Firma Beckhoff.
ru: Тип соединения, поддерживаются: CIF_PB - подключение к контроллерам серии S7 фирмы Siemens посредством коммуникационного процессора CIF-50PB или похожего; ISO_TCP, ISO_TCP243 - подключение к контроллерам серии S7 фирмы Siemens посредством сети Ethernet (TCP243 для CP243); ADS - TwinCAT ADS/AMS протокол для подключения к контроллерам фирмы Beckhoff.
uk: Тип підключення, підтримуються: CIF_PB - підключення до контролерів серії S7 фірми Siemens за посередництвом комунікаційного процесору CIF-50PB або схожого; ISO_TCP, ISO_TCP243 - підключення до контролерів серії S7 фірми Siemens за посередництвом мережі Ethernet (TCP243 для CP243); ADS - TwinCAT ADS/AMS протокол для підключення до контролерів фірми Beckhoff.

source: Remote controller address, for the connections: CIF_PB - controller address in the ProfiBus network, one digit 0-255; ISO_TCP, ISO_TCP243 - IP-address into the Ethernet network; ADS - network identifier and port for the target and source stations, in view "{Target_AMSNetId}:{Target_AMSPort}|{Source_AMSNetId}:{Source_AMSPort}" (for example: "192.168.0.1.1.1:801|82.207.88.73.1.1:801"), where: AMSNetId - network identifier, writes in view of six digits 0-255, for example: "192.168.0.1.1.1"; AMSPort - port, writes in view of one digit 0-65535.
de: Fernbedienung-Adresse. Für Verbindungen: CIF_PB - Controller-Adresse in ProfiBus Netzwerk stelligen 0-255; ISO_TCP, ISO_TCP243 - IP-Adresse in Ethernet-Netzwerk; ADS - Netzwerkkennung und Port für die Ziel- und Quellstationen angesichts "{Target_AMSNetId}:{Target_AMSPort}|{Source_AMSNetId}:{Source_AMSPort}" (beispielsweise: "192.168.0.1.1.1:801|82.207.88.73.1.1:801"), wo: AMSNetId - Netzwerkkennung, schreiben Sie in die Ansicht von sechs Ziffern 0-255, zum Beispiel: "192.168.0.1.1.1"; AMSPort - Hafen, schreiben Sie in die Ansicht stelligen 0-65535.
ru: Адрес удалённого контроллера, для соединений: CIF_PB - адрес контроллера в сети ProfiBus, цифра 0-255; ISO_TCP, ISO_TCP243 - IP-адрес контроллера в сети Ethernet; ADS - сетевой идентификатор и порт целевого контроллера и исходной станции, в виде "{Target_AMSNetId}:{Target_AMSPort}|{Source_AMSNetId}:{Source_AMSPort}" (например: "192.168.0.1.1.1:801|82.207.88.73.1.1:801"), где: AMSNetId - сетевой идентификатор, записывается в виде шести цифр 0-255, например: "192.168.0.1.1.1"; AMSPort - порт, записывается в виде числа 0-65535.
uk: Адреса віддаленого контролеру, для підключень: CIF_PB - адреса контролеру у мережі ProfiBus, цифра 0-255; ISO_TCP, ISO_TCP243 - IP-адреса контролеру у мережі Ethernet; ADS - мережевий ідентифікатор та порт цільового контролеру та вихідної станції, у вигляді "{Target_AMSNetId}:{Target_AMSPort}|{Source_AMSNetId}:{Source_AMSPort}" (наприклад: "192.168.0.1.1.1:801|82.207.88.73.1.1:801"), де: AMSNetId - мережевий ідентифікатор, записується у вигляді шести цифр 0-255, наприклад: "192.168.0.1.1.1"; AMSPort - порт, записується у вигляді числа 0-65535.

source: OpenSCADA output transport for the protocol ADS (port 48898, 801 for AMS) and ISO_TCP (port 102) for sending requests.
de: OpenSCADA-Ausgabetransport für die Protokolle ADS (Port 48898, 801 für AMS) und ISO_TCP (Port 102) zum Senden von Anfragen.
ru: Выходной транспорт OpenSCADA для протокола ADS (порт 48898, 801 для AMS) и ISO_TCP (порт 102) для отправки запросов.
uk: Вихідний транспорт OpenSCADA для протоколу ADS (порт 48898, 801 для AMS) та ISO_TCP (порт 102) для надсилання запитів.

source: Error of the calculation template.
ru: Ошибка вычисления шаблона.
uk: Помилка обчислення шаблону.

source: 1:Parameter disabled.
de: 1:Parameter ist abgeschaltet.
ru: 1:Параметр отключен.
uk: 1:Параметр вимкнено.

source: 2:Acquisition stopped.
de: 2:Erwerb wurde gestoppt.
ru: 2:Сбор остановлен.
uk: 2:Збір зупинено.

source: 10:Error of connection or no response.
ru: 10:Ошибка соединения или нет ответа.
uk: 10:Помилка з'єднання або немає відповіді.

source: Attributes configuration list. List must be written by lines in the form "(DB{N}|F).{off}.{tp}{SzBit}:{flg}:{id}[:{name}]". Where: DB{N} - Data Block number in decimal, can be negative one for the specific data areas of the ISO_TCP connection types; F - the Flags/Markers specific data area (131) of the ISO_TCP connection types; Start from the symbol '#' for the commented line; off - offset in the Data Block; tp - type in one symbol from the list: b-Boolean, i-Signed integer, u-Unsigned integer, r-Real, s-String; SzBit - type size for non Boolean or bit of byte for it: b=[0...7], iu=[1,2(def),4,8], r=[4(def).8], s=[0(def10)...100]; flg - flags: read/write mode (r-read, w-write); id - identifier of the created attribute; name - name of the created attribute. Examples: "DB1.12.b2:r:var:Variable" - Boolean in DB 1, offset 12 and bit 2; "DB2.24.u:rw:var:Variable", "DB2.0x18.r8:w:var" - Integer or Real in DB 2, offset 24, size default and 8; "DB4.0x30.s20:r:var:Variable" - String in DB 4, offset 48 and size 20; "F.12.b5:r:var:Variable" - Boolean in the Flags/Markers data area, offset 12 and bit 5.
ru: Список конфигурации атрибутов. Список формируется строками в форме "(DB{N}|F).{off}.{tp}{SzBit}:{flg}:{id}[:{name}]". Где: DB{N} - десятичный номер Блока Данных, может быть отрицательным для специфических областей данных типов подключения ISO_TCP; F - специфическая область данных Флагов/Маркеров (131) типов подключения ISO_TCP; Начните с символа '#' для комментирования строки; off - смещение в Блоке Данных; tp - тип одним символом из перечня: b-Логический, i-Знаковое целое, u-Беззнаковое целое, r-Вещественное, s-Строка; SzBit - размер типа для не Логического или бит байта для него: b=[0...7], iu=[1,2(тип.),4,8], r=[4(тип.),8], s=[0(тип.10)...100]; flg - флаги: режим чтения/записи (r-чтение, w-запись); id - идентификатор создаваемого атрибута; name - имя создаваемого атрибута. Examples: "DB1.12.b2:r:var:Variable" - Логический в БД 1, смещение 12 и бит 2; "DB2.24.u:rw:var:Variable", "DB2.0x18.r8:w:var" - Целое или Вещественное в БД 2, смещение 24, размер типовой и 8; "DB4.0x30.s20:r:var:Variable" - Строка в БД 4, смещение 48 и размер 20; "F.12.b5:r:var:Variable" - Логическое в области данных Флаги/Маркеры, смещение 12 и бит 5.
uk: Перелік конфігурації атрибутів. Перелік формується рядками у формі "(DB{N}|F).{off}.{tp}{SzBit}:{flg}:{id}[:{name}]". Де: DB{N} - десятковий номер Блоку Даних, може бути негативним для специфічних областей даних типів підключення ISO_TCP; F - специфічна область даних Прапорців/Маркерів (131) типів підключення ISO_TCP; Почніть з символу '#' для коментування рядка; off - зсув у Блоку Даних; tp - тип одним символом з переліку: b-Логічний, i-Знакове ціле, u-Беззнакове ціле, r-Реальне, s-Рядок; SzBit - розмір типу для не Логічного або біт байту для нього: b=[0...7], iu=[1,2(тип.),4,8], r=[4(тип.),8], s=[0(тип.10)...100]; flg - прапорці: режим запису/читання (r-читати, w-писати); id - ідентифікатор атрибуту що створюється; name - ім'я атрибуту що створюється. Приклади: "DB1.12.b2:r:var:Variable" - Логічний у БД 1, зсув 12 та біт 2; "DB2.24.u:rw:var:Variable", "DB2.0x18.r8:w:var" - Ціле або Реальне у БД 2, зсув 24, розмір типовий та 8; "DB4.0x30.s20:r:var:Variable" - Рядок у БД 4, зсув 48 та розмір 20; "F.12.b5:r:var:Variable" - Логічне у області даних Прапорці/Маркери, зміщення 12 та біт 5.
