Repository: aleax/openscada
Catalog: src/moduls/daq/DiamondBoards/po/*.po
Languages: de, ru, uk

source: Diamond DAQ boards
de: Datenerfassungkarte Diamond
ru: Diamond DAQ платы
uk: Diamond DAQ плати

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: Provides an access to "Diamond Systems" DAQ boards. Includes main support for all generic boards.
de: Bietet Zugriff auf die "Diamond Systems" Messkarten. Inklusive Haupt Unterstützung für alle generischen Platten.
ru: Предоставляет доступ к "Diamond Systems" DAQ платам. Включает основную поддержку базовых плат.
uk: Надає доступ до "Diamond Systems" DAQ плат. Включає основну підтримку базових плат.

source: [-5, +5]V;[-2.5, +2.5]V;[-1.25, +1.25]V;[-10, +10]V;[-5, +5]V;[-2.5, +2.5]V;[-1.25, +1.25]V;[0, 10]V;[0, 5]V;[0, 2.5]V
ru: [-5, +5]В;[-2.5, +2.5]В;[-1.25, +1.25]В;[-10, +10]В;[-5, +5]В;[-2.5, +2.5]В;[-1.25, +1.25]В;[0, 10]В;[0, 5]В;[0, 2.5]В
uk: [-5, +5]В;[-2.5, +2.5]В;[-1.25, +1.25]В;[-10, +10]В;[-5, +5]В;[-2.5, +2.5]В;[-1.25, +1.25]В;[0, 10]В;[0, 5]В;[0, 2.5]В

source: [-10, +10]V;[-5, +5]V;[-2.5, +2.5]V;[-1, +1]V;[-0.5, +0.5]V;+-Custom;[0, 10]V;[0, 5]V;[0, 2]V;[0, 1]V;+Custom
de: [-10, +10]V;[-5, +5]V;[-2.5, +2.5]V;[-1, +1]V;[-0.5, +0.5]V;+-Brauch;[0, 10]V;[0, 5]V;[0, 2]V;[0, 1]V;+Brauch
ru: [-10, +10]В;[-5, +5]В;[-2.5, +2.5]В;[-1, +1]В;[-0.5, +0.5]В;+-Пользоват.;[0, 10]В;[0, 5]В;[0, 2]В;[0, 1]В;+Пользоват.
uk: [-10, +10]В;[-5, +5]В;[-2.5, +2.5]В;[-1, +1]В;[-0.5, +0.5]В;+-Корист.;[0, 10]В;[0, 5]В;[0, 2]В;[0, 1]В;+Корист.

source: [-5, +5]V;[-2.5, +2.5]V;[-1.25, +1.25]V;[-0.625, +0.625]V;[-10, +10]V;[-5, +5]V;[-2.5, +2.5]V;[-1.25, +1.25]V;[0, 10]V;[0, 5]V;[0, 2.5]V;[0, 1.25]V
ru: [-5, +5]В;[-2.5, +2.5]В;[-1.25, +1.25]В;[-0.625, +0.625]В;[-10, +10]В;[-5, +5]В;[-2.5, +2.5]В;[-1.25, +1.25]В;[0, 10]В;[0, 5]В;[0, 2.5]В;[0, 1.25]В
uk: [-5, +5]В;[-2.5, +2.5]В;[-1.25, +1.25]В;[-0.625, +0.625]В;[-10, +10]В;[-5, +5]В;[-2.5, +2.5]В;[-1.25, +1.25]В;[0, 10]В;[0, 5]В;[0, 2.5]В;[0, 1.25]В

source: [-5, +5]V;[-2.5, +2.5]V;[-1.25, +1.25]V;[-0.625, +0.625]V;[0, 10]V;[0, 5]V;[0, 2.5]V;[0, 1.25]V;[-10, +10]V;[-5, +5]V;[-2.5, +2.5]V;[-1.25, +1.25]V
ru: [-5, +5]В;[-2.5, +2.5]В;[-1.25, +1.25]В;[-0.625, +0.625]В;[0, 10]В;[0, 5]В;[0, 2.5]В;[0, 1.25]В;[-10, +10]В;[-5, +5]В;[-2.5, +2.5]В;[-1.25, +1.25]В
uk: [-5, +5]В;[-2.5, +2.5]В;[-1.25, +1.25]В;[-0.625, +0.625]В;[0, 10]В;[0, 5]В;[0, 2.5]В;[0, 1.25]В;[-10, +10]В;[-5, +5]В;[-2.5, +2.5]В;[-1.25, +1.25]В

source: [-10, +10]V;[-5, +5]V;[-2.5, +2.5]V;[-1.25, +1.25]V;[-10, +10]V;[-5, +5]V;[-2.5, +2.5]V;[-1.25, +1.25]V;[0, 8.3]V;[0, 5]V;[0, 2.5]V
ru: [-10, +10]В;[-5, +5]В;[-2.5, +2.5]В;[-1.25, +1.25]В;[-10, +10]В;[-5, +5]В;[-2.5, +2.5]В;[-1.25, +1.25]В;[0, 8.3]В;[0, 5]В;[0, 2.5]В
uk: [-10, +10]В;[-5, +5]В;[-2.5, +2.5]В;[-1.25, +1.25]В;[-10, +10]В;[-5, +5]В;[-2.5, +2.5]В;[-1.25, +1.25]В;[0, 8.3]В;[0, 5]В;[0, 2.5]В

source: [-10, +10]V;[-5, +5]V;[-2.5, +2.5]V;[-1.25, +1.25]V;[0, 10]V;[0, 5]V;[0, 2.5]V;[0, 1.25]V
ru: [-10, +10]В;[-5, +5]В;[-2.5, +2.5]В;[-1.25, +1.25]В;[0, 10]В;[0, 5]В;[0, 2.5]В;[0, 1.25]В
uk: [-10, +10]В;[-5, +5]В;[-2.5, +2.5]В;[-1.25, +1.25]В;[0, 10]В;[0, 5]В;[0, 2.5]В;[0, 1.25]В

source: [0, 5]V;[0, 10]V;[-2.5, +2.5]V;[-5, +5]V;[-10, +10]V
ru: [0, 5]В;[0, 10]В;[-2.5, +2.5]В;[-5, +5]В;[-10, +10]В
uk: [0, 5]В;[0, 10]В;[-2.5, +2.5]В;[-5, +5]В;[-10, +10]В

source: dscInit error.
de: Fehler dscInit.
ru: Ошибка dscInit.
uk: Помилка dscInit.

source: Parameters table
de: Tabelle von Parametern
ru: Таблица параметров
uk: Таблиця параметров

source: Acquisition schedule
de: Planung der Befragung
ru: Планирование сбора
uk: Планування збору

source: Priority of the acquisition task
de: Priorität der Erfassungsaufgabe
ru: Приоритет задачи сбора данных
uk: Пріорітет задачі збору даних

source: Standard
ru: Стандарт
uk: Стандарт

source: Board: type
de: Board: Typ
ru: Плата: тип
uk: Плата: тип

source: Board: address
de: Board: Adresse
ru: Плата: адрес
uk: Плата: адреса

source: Board: interrupt
ru: Плата: прерывание
uk: Плата: переривання

source: Sample rate (single channel)
de: Meßfrequenz (ein Kanal)
ru: Частота измерений (один канал)
uk: Частота вимірів (один канал)

source: Asynchronous read
de: Asynchrones Lesen
ru: Асинхронное чтение
uk: Асинхронне читання

source: AI value mode
de: Modus-Werte AI
ru: Режим значения AI
uk: Режим значення AI

source: Code;%;Voltage
de: Code;%;Volta
ru: Код;%;Напряжение
uk: Код;%;Напруга

source: Addition parameters
de: Zusätzliche Parameter
ru: Дополнительные параметры
uk: Додаткові параметри

source: Acquisition.
de: Erwerb.
ru: Сбор.
uk: Збір.

source: Acquisition with the period %s.
de: Erwerb mit dem Zeitraum %s.
ru: Сбор с периодом %s.

source: Next acquisition by the cron '%s'.
de: Erwerb nächsten durch cron '%s'.
ru: Следующий сбор по cron '%s'.
uk: Наступний збір за cron '%s'.

source: Spent time %s[%s].
de: Verbrauchte Zeit %s[%s].
ru: Затрачено времени %s[%s].

source: 1:Parameter disabled.
de: 1:Parameter ist abgeschaltet.
ru: 1:Параметр отключен.
uk: 1:Параметр вимкнено.

source: 2:Acquisition stopped.
de: 2:Erwerb ist angehalten.
ru: 2:Сбор остановлен.
uk: 2:Збір зупинено.

source: 0:AI acquisition into interrupt mode; SampleRate=%g; Drift=%gs; Overflows=%u; LostCycles=%u; SRateCor=%u.
ru: 0:Опрос AI по прерыванию, SampleRate=%g; Drift=%gc; Overflows=%u; LostCycles=%u; SRateCor=%u.
uk: 0:Опитування AI за перериванням, SampleRate=%g; Drift=%gs; Overflows=%u; LostCycles=%u; SRateCor=%u.

source: DSC driver is not initialized!
de: DSC-Treiber ist nicht initialisiert!
ru: DSC драйвер не инициализирован!
uk: DSC драйвер не ініційовано!

source: Select device %d error!
de: Geräteauswahl Fehler %d!
ru: Ошибка выбора устройства %d!
uk: Помилка вибору пристрою %d!

source: dscInitBoard '%s'(%xh) error: %s %s
de: Fehler dscInitBoard '%s'(%xh): %s %s
ru: Ошибка dscInitBoard '%s'(%xh): %s %s
uk: Помилка dscInitBoard '%s'(%xh): %s %s

source: Analog input %d
de: Analog-Eingang %d
ru: Аналоговый вход %d
uk: Аналоговий вхід %d

source: Analog output %d
de: Analog-Ausgang %d
ru: Аналоговый выход %d
uk: Аналоговий вихід %d

source: Board's '%s' DIO configuration unsupported.
de: Konfiguration ist nicht DIO Board '%s' unterstützt.
ru: Не поддерживается конфигурация DIO платы '%s'.
uk: Конфігурація DIO плати '%s' не підтримується.

source: Digital out %d.%d
de: Digital-Ausgang %d.%d
ru: Дискретный выход %d.%d
uk: Цифровий вихід %d.%d

source: Digital input %d.%d
de: Digital-Eingang %d.%d
ru: Дискретный вход %d.%d
uk: Цифровий вхід %d.%d

source: AI interrupt: Init for: ConvRate=%g; NumbConv=%lu; FIFOdepth=%d; dump_threshold=%lu; scan_interval=%d.
de: Unterbrechung AI: Initialisierung für: ConvRate=%g; NumbConv=%lu; FIFOdepth=%d; dump_threshold=%lu; scan_interval=%d.
ru: Прерывание AI: Иниц. для: ConvRate=%g; NumbConv=%lu; FIFOdepth=%d; dump_threshold=%lu; scan_interval=%d.
uk: Переривання AI: Ініц. для: ConvRate=%g; NumbConv=%lu; FIFOdepth=%d; dump_threshold=%lu; scan_interval=%d.

source: Interrupt mode disabled by dscADScanInt error: %s %s
de: Funktionsweise des Interrupt deaktiviert für Fehler dscADScanInt: %s %s
ru: Режим работы по прерыванию отключен по ошибке dscADScanInt: %s %s
uk: Режим роботи за перериванням виключено через помилку dscADScanInt: %s %s

source: AI interrupt: Cycle: ConvRate=%g; transfers=%lu; prev_transfers=%lu; total_transfers=%lu; overflows=%lu; lag=%lld; drift=%gs.
de: Unterbrechung AI: Zyklus: ConvRate=%g; transfers=%lu; prev_transfers=%lu; total_transfers=%lu; overflows=%lu; lag=%lld; drift=%gs.
ru: Прерывание AI: Цикл: ConvRate=%g; transfers=%lu; prev_transfers=%lu; total_transfers=%lu; overflows=%lu; lag=%lld; drift=%gc.
uk: Переривання AI: Цикл: ConvRate=%g; transfers=%lu; prev_transfers=%lu; total_transfers=%lu; overflows=%lu; lag=%lld; drift=%gс.

source: AI interrupt: Overflows '%d' corrected to %lld! Drift=%gs.
de: Unterbrechung AI: Overflows '%d' korrigiert für %lld! Drift=%gs.
ru: Прерывание AI: Переполнения '%d' скорректированы в %lld! Drift=%gс.
uk: Переривання AI: Переповнення '%d' скориговано у %lld! Drift=%gс.

source: AI interrupt: Lost cycles '%d'. Fast data time corrected! Drift=%gs.
de: Unterbrechung AI: Verlorene Zyklen '%d'. Schnellen Daten zeitkorrigierten! Drift=%gs.
ru: Прерывание AI: Потеря циклов '%d'. Время быстрых данных откорректировано! Drift=%gs.
uk: Переривання AI: Втрата циклів '%d'. Час швидких даних відкориговано! Drift=%gс.

source: AI interrupt: Correction: dt=%gs; dtSz=%lld; per=%d; crmult=%g.
de: Unterbrechung AI: Korrektur: dt=%gs; dtSz=%lld; per=%d; crmult=%g.
ru: Прерывание AI: Коррекция: dt=%gs; dtSz=%lld; per=%d; crmult=%g.
uk: Переривання AI: Корекція: dt=%gc; dtSz=%lld; per=%d; crmult=%g.

source: AI interrupt: Sample rate change to %g! Env: drift=%gs.
de: Unterbrechung AI: Samplefrequenz Änderung für %g! Umwelt: drift=%gs.
ru: Прерывание AI: Частота выборки изменена в %g! Окруж.: drift=%gс.
uk: Переривання AI: Змінено частоту вимірів у %g! Оточ.: drift=%gс.

source: AI numbers process
de: AI Zahlen Prozess
ru: Количество обрабатываемых AI
uk: Кількість оброблюваних AI

source: Configuration
de: Konfiguration
ru: Конфигурация
uk: Конфігурація

source: Analog inputs scan interval (us)
de: Analoge Eingänge Abtastintervall (us)
ru: Интервал сканирования аналоговых входов (мкс)
uk: Інтервал сканування аналогових входів (мкс)

source: Input %d type (all inputs)
de: Eingang %d: type (alle Eingänge)
ru: Вход %d: тип (все входы)
uk: Вхід %d: тип (всі входи)

source: Input %d type
de: Eingang %d: type
ru: Вход %d: тип
uk: Вхід %d: тип

source: Output %d type
de: Ausgang %d: type
ru: Выход %d: тип
uk: Вихід %d: тип

source: DIO %d: out
de: DIO %d: Ausgang
ru: DIO %d: выход
uk: DIO %d: вихід

source: DIO %d: reverse
de: DIO %d: Inversion
ru: DIO %d: инверсия
uk: DIO %d: інверсія

source: DI %d reverse
de: DI %d Inversion
ru: DI %d: инверсия
uk: DI %d: інверсія

source: DO %d reverse
de: DO %d Inversion
ru: DO %d: инверсия
uk: DO %d: інверсія

source: %s error: %s %s
de: Fehler %s: %s %s
ru: Ошибка %s: %s %s
uk: Помилка %s: %s %s

source: Acquisition with the period: %s.
uk: Збір з періодом: %s.

source: Spent time: %s[%s].
uk: Витрачено часу: %s[%s].

source: 0:AI acquisition in the interrupt mode; SampleRate=%g; Drift=%gs; Overflows=%u; LostCycles=%u; SRateCor=%u.
de: 0:Poll AI Interrupt; SampleRate=%g; Drift=%gs; Overflows=%u; LostCycles=%u; SRateCor=%u.
