Repository: aleax/openscada
Catalog: src/moduls/daq/ModBus/po/*.po
Languages: de

source: Parameters table
de: Tabelle der Parameter

source: Logical parameters table
de: Logische Parameter der Tabelle

source: Acquisition schedule
de: Planung der Befragung

source: Gather task priority
de: Priorität der Datenerfassung

source: Modbus protocol
de: Modbus-Protokoll

source: Transport address
de: Adresse der Übertragung

source: Destination node
de: Zielknoten

source: Data fragments merge
de: Datenfragmente zusammenfügen

source: Use multi-items write functions (15,16)
de: Verwenden Sie Multi-Artikel schreiben Funktionen (15,16)

source: Asynchronous write
de: Asynchronous Rekord

source: Connection timeout (ms)
de: Zeitüberschreitung beim Verbinden (msek)

source: Restore timeout (s)
de: Zeit der Wiederherstellung (sek)

source: Request tries
de: Anfrageversuche

source: Maximum request block size (bytes)
de: Die Maximalgröße der Anfrage Block (Bytes)

source: Attributes list
de: Liste der Attribute

source: Logical
de: Logische

source: Parameter template
de: Template-Parameter

source: Parameter ID
de: ID der Parameter

source: Value
de: Wert

source: Task terminated!
de: Task gekündigt!

source: Connection error. Restoring in %.6g s.
de: Fehler beim Verbinden. Wiederherstellung in %.6g sek.

source: Call now.
de: Rufen Sie jetzt an.

source: Call by period: %s.
de: Aufruf mit einer Periode: %s.

source: Call next by cron '%s'.
de: Call nächsten durch cron '%s'.

source: Spent time: %s. Read %g(%g) registers, %g(%g) coils. Write %g registers, %g coils. Errors of connection %g, of respond %g.
de: Verbrauchte Zeit: %s. Gelesen %g(%g) Register, %g(%g) Bits. Geschrieben %g Register, %g Bits. Fehler in der Verbindung %g, in der Antwort %g.

source: DAQ.%s: connect to data source: %s.
de: DAQ.%s: Verbindung zu Datenquelle: %s.

source: 10:Connection error or no response.
de: 10:Verbindungsfehler oder keine Antwort.

source: 4:Server failure.
de: 4:Serverfehler.

source: 15:Response PDU size error.
de: 15:Fehler des Umfangs der PDU - Antwort.

source: Merge not adjacent fragments of registers to single block for request. Attention! Some devices don't support accompany request wrong registers into single block.
de: Kombination nicht benachbarte Fragmente von Registern zu einzelnen Block für Anfrage. Achtung! Einige Geräte unterstützen nicht begleiten Antrag falsch Register in einzelnen Block.

source: Individual connection timeout for device requested by the task. For zero value used generic connection timeout from used output transport.
de: Individuelle Verbindungs-Timeout für das Gerät von der Aufgabe gebeten. Für den Nullpunkt verwendet generische Verbindungszeit aus gebrauchten Transport-Ausgang.

source: 11:Value not gathered.
de: 11:Werte sind nicht erfasst.

source: Error calculate template.
de: Fehler in der Berechnung Vorlage.

source: 1:Parameter is disabled.
de: 1:Parameter ist abgeschaltet.

source: 2:Acquisition is stopped.
de: 2:Anfrage ist angehalten.

source: Attributes configuration list. List must be written by lines in format: "{dt}:{numb}:{rw}:{id}:{name}". Where: dt - ModBus data type (R-register[3,6(16)], C-coil[1,5(15)], RI-input register[4], CI-input coil[2]); R and RI can be expanded by suffixes: i2-Int16, i4-Int32, i8-Int64, u2-UInt16, u4-UInt32, f-Float, d-Double, b5-Bit5, s-String; Start from symbol '#' for comment line; numb - ModBus device's data address (dec, hex or octal) [0...65535]; rw - read/write mode (r-read; w-write; rw-readwrite); id - created attribute identifier; name - created attribute name. Examples: "R:0x300:rw:var:Variable" - register access; "C:100:rw:var1:Variable 1" - coin access; "R_f:200:r:float:Float" - get float from registers 200 and 201; "R_i4:400,300:r:int32:Int32" - get int32 from registers 400 and 300; "R_b10:25:r:rBit:Reg bit" - get bit 10 from register 25; "R_s:15,20:r:str:Reg blk" - get string, registers block, from register 15 and size 20.
de: Liste der Konfiguration der Attribute. Die Liste wird gemacht zeilenweise im Format: "{dt}:{numb}:{rw}:{id}:{name}". Wo: dt - ModBus Datentyp (R-Register[3,6(16)], C-Bit[1,5(15)], RI-Eingansregister[4], CI-Bit des Eingangs[2]); R und RI können mit den Suffixen erweitert werden: i2-Int16, i4-Int32, i8-Int64, u2-UInt16, u4-UInt32, f-Float, d-Double, b5-Bit5, s-Zeile; Star von Symbol '#' für einen Kommentar Linie; numb - Adresse der ModBus - Anlage (dec., hex., oder octal) [0...65535]; rw - Regime Lesen/Einschreiben (r-lesen; w-einschreiben, rw-lesen und einschreiben); id - Bezeichner des gebildeten Attributs; name - Name des gebildeten Attributs . Beispiele: "R:0x300:rw:var:Variable" - Zugang zum Register; "C:100:rw:var1:Variable 1" - Zugang zum Bit; "R_f:200:r:float:Float" - das 'float' bekommen aus den Registern 200 und 201; "R_i4:400,300:r:int32:Int32" - bekommen 'int32' aus den Registern 400 und 300; "R_b10:25:r:rBit:Reg bit" - Bit 10 aus dem Register 25 bekommen; "R_s:15,20:r:str:Reg blk" - Den Stringdie, Register Block, aus dem Register 15 und Größe 20.

source: Template configuration
de: Konfiguration Vorlage

source: Parameters
de: Optionen

source: ModBus address in format: "{dt}:{numb}:{rw}". Where: dt - ModBus data type (R-register[3,6(16)], C-coil[1,5(15)], RI-input register[4], CI-input coil[2]); R and RI can be expanded by suffixes: i2-Int16, i4-Int32, i8-Int64, u2-UInt16, u4-UInt32, f-Float, d-Double, b5-Bit5, s-String; numb - ModBus device's data address (dec, hex or octal) [0...65535]; rw - read/write mode (r-read; w-write; rw-readwrite). Examples: "R:0x300:rw" - register access; "C:100:rw" - coin access; "R_f:200:r" - get float from registers 200 and 201; "R_i4:400,300:r" - get int32 from registers 400 and 300; "R_b10:25:r" - get bit 10 from register 25; "R_s:15,20:r" - get string, registers block, from register 15 and size 20.
de: Modbus-Adresse im Format: "{dt}:{numb}:{rw}". Wo: dt - ModBus Datentyp (R-Register[3,6(16)], C-Bit[1,5(15)], RI-Eingansregister[4], CI-Bit des Eingangs[2]); R und RI können mit den Suffixen erweitert werden: i2-Int16, i4-Int32, i8-Int64, u2-UInt16, u4-UInt32, f-Float, d-Double, b5-Bit5, s-Zeile; numb - Adresse der ModBus - Anlage (dec., hex., oder octal) [0...65535]; rw - Regime Lesen/Einschreiben (r-lesen; w-einschreiben, rw-lesen und einschreiben); Beispiele: "R:0x300:rw" - Zugang zum Register; "C:100:rw" - Zugang zum Bit; "R_f:200:r" - das 'float' bekommen aus den Registern 200 und 201; "R_i4:400,300:r" - bekommen 'int32' aus den Registern 400 und 300; "R_b10:25:r" - Bit 10 aus dem Register 25 bekommen; "R_s:15,20:r" - Den Stringdie, Register Block, aus dem Register 15 und Größe 20.

source: Parameter id error.
de: Parameter-ID Fehler.

source: Description
de: Beschreibung

source: To enable
de: Einschalten

source: Address
de: Adresse

source: Input transport
de: Eingangsübertragung

source: Protocol
de: Protokoll

source: RTU;ASCII;TCP/IP;All
de: RTU;ASCII;TCP/IP;Alle

source: Mode
de: Modus

source: Data;Gateway node;Gateway net
de: Daten;Knotenschnittstelle;Netzschnittstelle

source: Calculate data period (s)
de: Daten Rechenzeit (sek)

source: Program
de: Programm

source: To transport
de: Zur Übertragung

source: To protocol
de: Ins Protokoll

source: To address
de: An die Adresse

source: Node ID
de: Knoten-ID

source: Value type
de: Typ des Wertes

source: Flags
de: Schalter

source: Real position
de: Reale Position

source: Search and create new node error.
de: Fehler dem Suchen und Erstellen des neuen Knotens.

source: 13:Error server respond
de: 13:Fehler in der Antwort des Server

source: Not full respond
de: Nicht voll antworten

source: 13:Error respond: Too short.
de: 13:Fehler in der Antwort: Zu kurz.

source: 13:Error respond: CRC check error.
de: 13:Fehler in der Antwort: Fehler der CRC-Prüfung.

source: 13:Error respond: Error format.
de: 13:Fehler in der Antwort: Formatfehler.

source: 13:Error respond: LRC check error.
de: 13:Fehler in der Antwort: Fehler der LRC-Prüfung.

source: Protocol '%s' error.
de: Fehler des Protokolls '%s'.

source: 13:Error respond
de: 13:Fehler in der Antwort

source: 1:%02X:Function is not supported.
de: 1:%02X:Funktion wird nicht unterstützt.

source: 2:Requested address not allow or request area too long.
de: 2:Angefragte Adresse ist nicht zulässig oder Anfragebereich ist zu groß.

source: 3:Illegal data value into request.
de: 3:Illegale Datenwert in der Anfrage.

source: 5:Request requires too long time for execute.
de: 5:Anfrage benötigt zu viel Zeit für die Ausführung.

source: 6:Server is busy.
de: 6:Server ist beschäftigt.

source: 7:Program function is error. By request functions 13 or 14.
de: 7:Fehler in Programmfunktion. In Anfragefunctions 13 or 14.

source: 10:Gateway problem.
de: 10:Schnittstellenproblem.

source: 12:%02X:Unknown error.
de: 12:%02X:Unbekannter Fehler.

source: 14:Device error:
de: 14:Fehler im Baustein:

source: REQ ->
de: Anfrage ->

source: RESP ->
de: Antwort ->

source: ERR ->
de: Fehler ->

source: Node
de: Knoten

source: Nodes
de: Knoten

source: Report
de: Bericht

source: Report length
de: Berichtsgrösse

source: Zero use for report disabling
de: Null wird für das Abschalten des Berichtes verwendet.

source: Function calculate frequency (Hz)
de: Funktionberechnungsfrequenz (Hz)

source: Function start flag
de: Schalter für das Anhalten der Funktion

source: Function stop flag
de: Schalter für das Starten der Funktion

source: Coil '%d' already registered for IO '%d'. IO '%d' will be disabled for process coil '%d'!
de: Coil '%d' bereits eingetragen für IO '%d'. IO '%d' wird für die Prozess-Coil '%d' deaktiviert zu sein!

source: Register '%d' already registered for IO '%d'. IO '%d' will be disabled for process register '%d'!
de: Register '%d' bereits eingetragen für IO '%d'. IO '%d' wird für die Prozess-Register '%d' deaktiviert zu sein!

source: ModBUS data type '%c' error!
de: ModBUS Datentyp '%c' error!

source: Compile function by language '%s' error: %s
de: Fehler für die Sprache '%s' bei der Funktionskompilation : %s

source: Disabled.
de: Abgeschaltet.

source: Enabled.
de: Eingeschaltet.

source: Spent time: %s. Requests %.4g. Read registers %.4g, coils %.4g. Writed registers %.4g, coils %.4g.
de: Verbrauchte Zeit: %s. Anfragen %.4g. Gelesen %.4g Register, %.4g Bits. Geschrieben %.4g Register, %.4g Bits.

source: Requests %.4g.
de: Anfragen %.4g.

source: Calculate node's function error.
de: Fehler bei der Berechnung der Funktion des Knotens.

source: Node:
de: Knoten:

source: State
de: Zustand

source: Enable
de: Einschalten

source: Configuration
de: Konfiguration

source: Data
de: Daten

source: For "Id" field provide specific ModBus data form: "R{N}[w]" - specific register form, can expanded by suffixes: "i"-Int32, "f"-Float, "d"-Double, "s"-String; "R:{N}:[w]" - classic register form, can expanded by suffixes: "i4"-Int32, "i8"-Int64, "f"-Float, "d"-Double, "s"-String; "C{N}[w]" or "C:{N}:[w]" - coil. Where: {N} - ModBus device's data address (dec, hex or octal) [0...65535]; w - optional symbol for writing allow indicate. Examples: "R0x300w" - register access; "C100w" - coin access, allow for write; "R_f200" - get float from registers 200 and 201; "R_i400,300" - get int32 from registers 300 and 400; "R_s15,20" - get string, registers block, from register 15 and size 20; "R_i8:0x10:w" - get and set int64 into registers [0x10-0x13]; "R_d:0x20,0x30" - get double float point (8 byte) from registers [0x20,0x30-0x32].
de: Für das Feld "Id" spezifische Form des ModBus Daten: "R{N}[w]" - spezifische Form Register, kann durch Suffixe erweitert: "i"-Int32, "f"-Float, "d"-Double, "s"-String; "R:{N}:[w]" - klassische Form Register, kann durch Suffixe erweitert: "i4"-Int32, "i8"-Int64, "f"-Float, "d"-Double, "s"-String; "C{N}[w]" und "C:{N}:[w]" - bit. Wo: {N} - Adresse der ModBus - Anlage (dec., hex., oder octal) [0...65535]; w - optional Symbol, um die Möglichkeit der angeben Aufzeichnung. Beispiele: "R0x300w" - Zugang zum Register; "C100w" - Zugang zum Bit; "R_f200" - das 'float' bekommen aus den Registern 200 und 201; "R_i400,300" - bekommen 'int32' aus den Registern 400 und 300; "R_s15,20" - Den Stringdie, Register Block, aus dem Register 15 und Größe 20. "R_i8:0x10:w" - get-und set int64 in Register [0x10-0x13]; "R_d:0x20,0x30" - erhalten die doppelte Float (8 Byte) aus den Registern [0x20,0x30-0x32].

source: Type
de: Typ

source: Real;Integer;Boolean;String
de: Reelle Zahl;Ganz Zahl;Logisch;Text

source: Link
de: Verbindung

source: Program language
de: Programmsprache.

source: Links
de: Verbindungen

source: Disable node for this operation
de: Knoten abschalten für diese Operation

source: New IO
de: Neu IO

source: Deleting lock attribute is not allowed.
de: Löschen Verriegelungsattribut ist nicht erlaubt.

source: Changing locked attribute is not allowed.
de: Änderung des verriegelten Attributs ist nicht erlaubt

source: Empty value is not valid.
de: Leerer Wert ist nicht zulässig.

source: Roman Savochenko
de: Roman Savotschenko

source: Allow realization of ModBus client service. Supported Modbus/TCP, Modbus/RTU and Modbus/ASCII protocols.
de: Ermöglicht die Realisierung des Klientservices des ModBus-Protokolls. Unterstützt werden Modbus/TCP, Modbus/RTU und Modbus/ASCII Protokolle.

source: Allow realization of ModBus protocols. Supported Modbus/TCP, Modbus/RTU and Modbus/ASCII protocols.
de: Ermöglicht die Realisierung der ModBus-Protokolle. Unterstützt werden Modbus/TCP, Modbus/RTU und Modbus/ASCII Protokolle.
