Repository: aleax/openscada
Catalog: src/moduls/bd/DBF/po/*.po
Languages: de, ru, uk

source: DB DBF
ru: БД DBF
uk: БД DBF

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: BD module. Provides support of the *.dbf files, version 3.0.
ru: Модуль БД. Предоставляет поддержку *.dbf файлов, версии 3.0.
uk: Модуль БД. Надає підтримку *.dbf файлів, версії 3.0.

source: Delete DB error!
ru: Ошибка удаления БД!
uk: Помилка видалення БД!

source: Error create DB directory '%s'!
ru: Ошибка создания директории БД '%s'!
uk: Помилка створення директорії БД '%s'!

source: Restore previous directory as current error.
ru: Ошибка восстановления предыдущей директории в роли текущей.
uk: Помилка відновлення минулої директорії як поточну.

source: Error open table '%s'. DB is disabled.
ru: Ошибка открытия таблицы '%s'. БД отключена.
uk: Помилка відкриття таблиці '%s'. БД вимкнено.

source: For DBF address DB is the directory which contains files of tables (*.dbf). For example: /opt/dbf .
ru: Для DBF адрес БД это директория, которая содержит файлы таблиц (*.dbf). Для примера: /opt/dbf .
uk: Для DBF адреса БД це тека, яка містить файли таблиць (*.dbf). Наприклад: /opt/dbf .

source: Open table error!
ru: Ошибка открытия таблицы!
uk: Помилка відкриття таблиці!

source: Cell error!
ru: Ошибка ячейки!
uk: Помилка чарунки!

source: Field is not present!
ru: Поле отсутствует!
uk: Поле відсутнє!

source: Read only access to file '%s'.
ru: Доступ только на чтение к файлу '%s'.
uk: Доступ тільки на читання до файлу '%s'.

source: Column error!
ru: Ошибка колонки!
uk: Помилка стовпчику!

source: Delete field error!
ru: Ошибка удаления поля!
uk: Помилка видалення поля!

source: Line error!
ru: Ошибка линии!
uk: Помилка лінії!

source: Key column '%s' is not present!
ru: Ключевая колонка '%s' отсутствует!
uk: Ключовий стовпчик '%s' відсутній!

source: DB module. Provides support of the DBF files version 3.0.
de: DB-Modul. Bietet Unterstützung für die DBF-Dateien der Version 3.0.

source: Error deleting DB.
de: Fehler beim Löschen der DB.

source: Error creating the DB directory '%s'.
de: Fehler beim Erstellen des DB-Verzeichnisses '%s'.

source: Error restoring previous directory as the current.
de: Fehler beim Wiederherstellen des vorherigen Verzeichnisses als aktuell.

source: Error opening the table '%s': the DB is disabled.
de: Fehler beim Öffnen der Tabelle '%s': Die DB ist deaktiviert.

source: Error opening the table.
de: Fehler beim Öffnen der Tabelle.

source: For DBF, a DB address is the directory which contains files of the tables (*.dbf). For example: /opt/dbf.
de: Für DBF ist eine DB-Adresse das Verzeichnis, das Dateien der Tabellen (*.dbf) enthält.Zum Beispiel: /opt/dbf .

source: Error the cell.
de: Fehler in der Zelle.

source: The field is not present.
de: Das Feld ist nicht vorhanden.

source: Access to the file '%s' is read only.
de: Der Zugriff auf die Datei '%s' ist schreibgeschützt.

source: Error the column.
de: Fehler in der Spalte.

source: Error deleting the field.
de: Fehler beim Löschen des Feldes.

source: Error the field.
de: Fehler im Feld.

source: The key column '%s' is not present.
de: Die Schlüsselspalte '%s' ist nicht vorhanden.
