Repository: aleax/openscada
Catalog: src/moduls/ui/WebVision/po/*.po
Languages: de, ru

source: Resource not found
de: Ressource nicht gefunden
ru: Ресурс не найден

source: Unknown object of the command: %s.
de: Unbekanntes Objekt des Befehls: %s.
ru: Неизвестный объект команды: %s.

source: Unknown command: %s.
de: Unbekanntes Kommando: %s.
ru: Неизвестная команда: %s.

source: Content is missing.
de: Inhalt fehlt.
ru: Содержимое отсутствует.

source: Fill image type is not supported.
de: Füllen Bildtyp wird nicht unterstützt.
ru: Тип изображения заполнения не поддерживается.

source: At least one of the elementary figures, of which 'fill' is forming, is outside the boundary of the display area.
de: Mindestens eine der elementaren Figuren, von denen sich 'fill' bildet, liegt außerhalb der Grenze des Anzeigebereichs.
ru: По крайней мере одна из элементарных фигур, из которых состоит 'заливка', вне пределов области рисования.

source: gdImageStringFTEx: error for the font '%s': %s.
de: gdImageStringFTEx: Fehler für die Schriftart '%s': %s.
ru: gdImageStringFTEx: ошибка для шрифта '%s': %s.

source: %ds
ru: %dс

source: %gs
ru: %gс

source: %gms
ru: %gмс

source: Creating time of the trend %gms
de: Erstellen Zeit der Trend %gms
ru: Время создания тренда %gмс

source: + Creating time of the PNG-image(%d) %gms
de: + Erstellungszeit des PNG-Bildes (%d) %gms
ru: + Время создания PNG-изображения (%d) %gмс

source: kHz
ru: кГц

source: Hz
ru: Гц

source: Error parsing the document '%s': %s
de: Fehler beim Parsen des Dokuments '%s': %s
ru: Ошибка парсинга документа '%s': %s

source: Operation user interface (WEB)
de: Benutzerschnittstelle (WEB)
ru: Рабочий пользовательский интерфейс (WEB)

source: Roman Savochenko, Lysenko Maxim (2008-2012), Yashina Kseniya (2007)
de: Roman Savotschenko, Maxim Lysjenko (2008-2012), Ksenija Jaschina (2007)
ru: Роман Савоченко, Лысенко Максим (2008-2012), Яшина Ксения (2007)

source: Visual operation user interface, based on the WEB - front-end to the VCA engine.
de: Visuelle Bedienung Benutzeroberfläche, basierend auf dem WEB - Front-End der VCA-Engine.
ru: Рабочий пользовательский интерфейс, основанный на WEB - внешний интерфейс к движку СВУ.

source: Date and time
de: Datum und Uhrzeit
ru: Дата и время

source: Level
de: Stufe
ru: Уровень

source: Category
de: Kategorie
ru: Категория

source: Message
de: Nachricht
ru: Сообщение

source: mcsec
de: mcsek
ru: мкс

source: Ready
de: Fertig
ru: Готов

source: Page
de: Seite
ru: Страница

source: View access is not permitted.
de: Der Zugriff auf Ansichten ist nicht zulässig.
ru: Отсутствует доступ для просмотра.

source: Today
de: Heute
ru: Сегодня

source: Mon
ru: Пн

source: Tue
ru: Вт

source: Wed
ru: Ср

source: Thr
ru: Чт

source: Fri
ru: Пт

source: Sat
ru: Сб

source: Sun
ru: Вс

source: January
de: Januar
ru: Январь

source: February
de: Februar
ru: Февраль

source: March
de: März
ru: Март

source: April
ru: Апрель

source: May
de: Mai
ru: Май

source: June
de: Juni
ru: Июнь

source: July
de: Juli
ru: Июль

source: August
ru: Август

source: September
ru: Сентябрь

source: October
de: Oktober
ru: Октябрь

source: November
ru: Ноябрь

source: December
de: Dezember
ru: Декабрь

source: Field for displaying and changing the current user.
de: Feld zum Anzeigen und Ändern des aktuellen Benutzers.
ru: Поле отображения и изменения текущего пользователя.

source: Field for displaying and changing the used interface style.
de: Feld zum Anzeigen und Ändern des verwendeten Schnittstellenstils.
ru: Поле отображения и изменения используемого стиля интерфейса.

source: Alarm level: %1
de: Stufe der Störung: %1
ru: Уровень нарушения: %1

source: Notificator %1
de: Notifier %1
ru: Уведомитель %1

source: ======================= Module <%s:%s> options ======================= ---- Parameters of the module section '%s' of the configuration file ---- SessTimeLife <min> Lifetime of the sessions in minutes (by default, 10). SessLimit <numb> Maximum number of the sessions (by default 5). CachePgLife <hours> Lifetime of the pages in the cache (by default 1). CachePgSz <numb> Maximum number of the pages in the cache (by default 10). PNGCompLev <lev> Compression level [-1..9] of the creating PNG-images. ImgResize <0|1> Resizing raster images on the server side. CustCSS <CSS> Custom interface CSS rules.
de: ======================== Optionen des Moduls <%s:%s> ============================ ------ Parameter des Modulabschnitts '%s' der Konfigurationsdatei ------ SessTimeLife <Min> Lebensdauer der Sitzungen in Minuten (standardmäßig 10). SessLimit <Anzahl> Maximale Anzahl der Sitzungen (standardmäßig 5). CachePgLife <uhr> Die Lebensdauer von Seiten im Cache (Standard = 1). CachePgSz <Anzahl> Maximale Anzahl der Seiten im Cache (Standard 10). PNGCompLev <lev> Komprimierungsgrad [-1..9] der erstellenden PNG-Bilder. ImgResize <0|1> Ändern der Größe von Rasterbildern auf der Serverseite. CustCSS <CSS> Benutzerdefinierte CSS-Schnittstellenregeln.
ru: ======================== Опции модуля <%s:%s> ============================ ------ Параметры модульной секции '%s' конфигурационного файла ------ SessTimeLife <мин> Время жизни сеансов в минутах (по умолчанию 10). SessLimit <кол.> Максимальное количество сеансов (по умолчанию 5). CachePgLife <часы> Время жизни страниц в кеше (по умолчанию = 1). CachePgSz <кол.> Максимальное количество страниц в кеше (по умолчанию 10). PNGCompLev <уров.> Уровень сжатия [-1..9] создаваемых PNG-фафлов. ImgResize <0|1> Изменение размера растровых изображений на стороне сервера. CustCSS <CSS> Пользовательские CSS правила интерфейса.

source: Welcome "%s (%s)"!
de: Willkommen "%s (%s)"!
ru: Добро пожаловать "%s (%s)"!

source: close
de: schließen
ru: закрыть

source: Opened sessions of the projects
de: Eröffnete Sitzungen der Projekte
ru: Открытые сеансы проектов

source: Available projects
de: Verfügbare Projekte
ru: Доступные проекты

source: There is no session and project of the VCA engine for the user!
de: Es gibt keine Sitzung und kein Projekt der VCA-Engine für den Benutzer!
ru: Нет ни одного сеанса и проекта движка СВУ для пользователя!

source: Sorry, the number of open sessions has reached a limit!
de: Entschuldigung, die Anzahl der offenen Sitzungen hat ein Limit erreicht!
ru: Извините, количество открытых сеансов достигло ограничения!

source: Going to the session '%s' for the project '%s' ...
de: Gehen Sie zu Session '%s' für Projekt '%s' ...
ru: Переход к сеансу '%s' для проекта '%s' ...

source: Going to the main page ...
de: Zur Hauptseite gehen ...
ru: Переход к основной странице ...

source: The session '%s' is closed.
de: Die Sitzung '%s' ist geschlossen.
ru: Закрыт сеанс '%s'.

source: You '%s' have no access to close sessions!
de: Sie '%s' haben keinen Zugriff auf geschlossene Sitzungen!
ru: Вы '%s' не имеете доступа к закрытию сеансов!

source: Going to the different session ...
de: Zur anderen Sitzung gehen ...
ru: Переход к другому сеансу ...

source: The specified project/session '%s' is false!
de: Spitzes Projekt/Sitzung '%s' ist falsch!
ru: Указанный проект/сеанс '%s' ошибочный!

source: Error the page '%s': %s
de: Fehler auf der Seite '%s': %s
ru: Ошибка страницы '%s': %s

source: Wrong session '%s'.
de: Falsche Sitzung '%s'.
ru: Ошибочный сеанс '%s'.

source: State
de: Zustand
ru: Статус

source: Sessions
de: Sitzungen
ru: Сеансы

source: Module options
de: Optionen des Moduls
ru: Опции модуля

source: Lifetime and maximum number of the sessions
de: Lebensdauer und maximale Anzahl der Sitzungen
ru: Время жизни и максимальное количество сеансов

source: The time is specified in minutes, which defines the inactivity interval for closing the WEB-sessions.
de: Die Zeit wird in Minuten angegeben, die das Inaktivitätsintervall zum Schließen der WEB-Sitzungen definiert.
ru: Время указывается в минутах, которое определяет интервал неактивности для закрытия WEB-сеансов.

source: The number defines a limit of opened WEB-sessions.
de: Die Anzahl definiert ein Limit für geöffnete WEB-Sitzungen.
ru: Количество определяет ограничение открываемых WEB-сеансов.

source: Lifetime and maximum number of the cached pages
de: Lebensdauer und maximale Anzahl der zwischengespeicherten Seiten
ru: Время жизни и максимальное количество страниц в кеше

source: The time is specified in hours, which defines the inactivity interval for closing pages in the cache. Zero value of the time excludes the closing of pages in the cache.
de: Die Zeit wird in Stunden angegeben, die das Inaktivitätsintervall für das Schließen von Seiten im Cache definiert. Ein Nullwert der Zeit schließt das Schließen von Seiten im Cache aus.
ru: Время указывается в часах, которое определяет интервал неактивности для закрытия страниц в кеш. Нулевое значение времени исключает закрытие страниц в кеш.

source: The number defines a limit of pages in the cache. Zero value of the number excludes the cache limit.
de: Die Anzahl definiert eine Begrenzung der Seiten im Cache. Ein Nullwert der Zahl schließt das Cache-Limit aus.
ru: Количество определяет ограничение страниц в кеше. Нулевое значение количества исключает закрытие страниц в кеш.

source: Level of the PNG compression
de: PNG Komprimierungsstufe
ru: Уровень сжатия PNG

source: Level of the PNG (ZLib) compression: -1 - optimal speed-size; 0 - disable; 1-9 - direct level.
de: Kompressionsstufe PNG(ZLib): -1 - optimale Geschwindigkeit-Grösse; 0 - abgeschaltet; 1-9 - direkte Stufe.
ru: Уровень компрессии PNG (ZLib): -1 - оптимальный, скорость-размер; 0 - отключен; 1-9 - прямой уровень.

source: Resizing raster images on the server side
de: Ändern der Größe von Rasterbildern auf der Serverseite.
ru: Изменение размера растровых изображений на стороне сервера.

source: Mostly to decrease too big images size then decrease the traffic, what causes to rise the server load.
de: Meistens, um zu große Bilder zu verkleinern und dann den Datenverkehr zu verringern, was zu einer Erhöhung der Serverlast führt.
ru: В основном чтобы уменьшить размер очень больших изображений, а соответственно и трафика, что приводит к увеличению нагрузки на сервер.

source: Custom interface CSS rules
de: Benutzerdefinierte CSS-Schnittstellenregeln
ru: Пользовательские CSS правила интерфейса

source: %s %s(%s):%s(%s): the last %s; cached pages %d and resources %d, %s; session objects %d.
de: %s %s(%s):%s(%s): die letzten %s; zwischengespeicherte Seiten %d und Ressourcen %d, %s; Sitzungsobjekte %d.
ru: %s %s(%s):%s(%s): последний %s; кешированных страниц %d и ресурсов %d, %s; объектов сеанса %d.

source: FrontEnd:
de: VorderesEnde:
ru: ПереднийПлан:

source: Closing the file %d error '%s (%d)'!
de: Schließen der Datei %d Fehler '%s (%d)'!

source: The table is wrong or empty
de: Die Tabelle ist falsch oder leer

source: Error parsing the document
de: Fehler beim Parsen des Dokuments

source: The document is wrong or empty
de: Das Dokument ist falsch oder leer

source: Field to call of exporting some data.
de: Feld zum Aufrufen des Exportierens einiger Daten.

source: Document %1
de: Dokument %1

source: Table %1
de: Tabelle %1

source: No data for export!
de: Keine Daten für den Export!
