Repository: aleax/openscada
Catalog: src/moduls/bd/SQLite/po/*.po
Languages: de, ru, uk

source: DB SQLite
de: Datenbank SQLite
ru: БД SQLite
uk: БД SQLite

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: BD module. Provides support of the BD SQLite.
de: Modul unterstützt die SQLite Datenbank.
ru: Модуль БД. Предоставляет поддержку БД SQLite.
uk: Модуль БД. Надає підтримку БД SQLite.

source: Error deleting DB: %s
de: Fehler beim Löschen der DB: %s

source: Error opening DB file: %s
de: Fehler beim Öffnen der DB-Datei: %s

source: Error opening the table '%s'. DB is disabled.
de: Fehler beim Öffnen der Tabelle '%s'. Datenbank ist abgeschaltet.

source: Request: "%s"
de: Anfrage: "%s"

source: Unknown error
de: Unbekannter Fehler
ru: Неизвестная ошибка
uk: Невідома помилка

source: Error of the request "%s": %s(%d)
de: Fehler der Anfrage "%s": %s(%d)

source: SQLite DB address must be written as: "{FileDBPath}". Where: FileDBPath - full path to DB file (./oscada/Main.db). Use the empty path to create a temporary database on the disk. Use ":memory:" to create a temporary database in memory.
de: Die Adresse der Datenbank SQLite wird geschrieben als: "{FileDBPath}". Wo: FileDBPath - Verzeichnispfad zur Datenbank (./oscada/Main.db). Verwenden Sie den leeren Pfad, um eine temporäre Datenbank auf dem Datenträger zu erstellen. Verwenden Sie ":memory:", um eine temporäre Datenbank im Speicher zu erstellen.

source: Close opened transaction
de: Geöffnete Transaktion schlissen
ru: Закрыть открытую транзакцию
uk: Закрити відкриту транзакцію

source: Table is empty.
de: Tabelle ist leer.
ru: Таблица пуста.
uk: Таблиця порожня.

source: Row "%s" is not present. Are you saved the object?
de: Datensatz "%s" ist nicht vorhanden. Sind Sie das Objekt gespeichert?

source: The DB is into the Read only mode!
de: Die DB befindet sich im Read-Only-Modus!

source: Delete bd error: %s
ru: Ошибка удаления БД: %s
uk: Помилка видалення БД: %s

source: Open DB file error: %s
ru: Ошибка открытия файла БД: %s
uk: Помилка відкриття файлу БД: %s

source: Error open table '%s'. DB is disabled.
ru: Ошибка открытия таблицы '%s'. БД отключена.
uk: Помилка відкриття таблиці '%s'. БД вимкнено.

source: Request "%s" error: %s
ru: Ошибка запроса "%s": %s
uk: Помилка запиту "%s": %s

source: SQLite DB address must be written as: [<FileDBPath>]. Where: FileDBPath - full path to DB file (./oscada/Main.db). Use empty path for a private, temporary on-disk database create. Use ":memory:" for a private, temporary in-memory database create.
ru: Адрес БД SQLite записывается как: [<FileDBPath>]. Где: FileDBPath - полный путь к файлу БД (./oscada/Main.db). Используйте пустой путь для создания временной базы данных на диске. Используйте ":memory:" для создания временной базы данных в памяти.
uk: Адреса БД SQLite записується так: [<FileDBPath>]. Де: FileDBPath - повний шлях до файлу БД (./oscada/Main.db). Використовуйте порожній шлях для створення тимчасової бази даних на диску. Використовуйте ":memory:" для створення тимчасової бази даних у пам'яті.

source: Row "%s" is not present.
ru: Запись "%s" отсутствует.
uk: Запис "%s" відсутній.
