Repository: aleax/openscada
Catalog: src/moduls/special/FLibComplex1/po/*.po
Languages: de, ru, uk

source: Complex1 functions
de: Complex1 Funktionen
ru: Функции Complex1
uk: Функції Complex1

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: Provides a library of the functions of compatibility with SCADA Complex 1 of the firm SIC "DIYA".
de: Bietet eine Bibliothek der Funktionen der Kompatibilität mit SCADA Complex 1 der Firma SIC "DIYA".
ru: Предоставляет библиотеку функций совместимых со SCADA Complex1 фирмы НИП "ДІЯ".
uk: Надає бібліотеку функцій сумісності зі SCADA Complex1 фірми НІП "ДІЯ".

source: Function
de: Funktion
ru: Функция
uk: Функція

source: Functions
de: Funktionen
ru: Функции
uk: Функції

source: Command "Open"
de: Kommando "Öffnen"
ru: Команда "Открыть"
uk: Команда "Відкрити"

source: Command "Close"
de: Kommando "Schliessen"
ru: Команда "Закрыть"
uk: Команда "Закрити"

source: Command "Stop"
de: Kommando "Anhalten"
ru: Команда "Стоп"
uk: Команда "Зупинити"

source: State "Opened"
de: Zustand "Geöffnet"
ru: Сотояние "Открыт"
uk: Стан "Відкрито"

source: State "Closed"
de: Zustand "Geschlossen"
ru: Состояние "Закрыт"
uk: Стан "Закрито"

source: Time of commands holding, seconds
de: Zeit der Befehle halten, Sekunden
ru: Время удержания команды, секунд
uk: Час утримання команди, секунд

source: Frequency of the calculating, Hz
de: Häufigkeit der Berechnung, Hz
ru: Частота вычисления, Гц
uk: Частота обчислення, Гц

source: Counter of the commands processing
de: Zähler der Befehle, die verarbeitet werden
ru: Счётчик обработки команд
uk: Лічильник обробки команд

source: Last command
de: Letztes Kommando
ru: Последняя команда
uk: Остання команда

source: Discrete block
de: Diskreter Block
ru: Дискретный блок
uk: Дискретний блок

source: The function contains a control algorithm for the collection of discrete signals for latches and pumps that contain: signs "Opened", "Closed", and commands "Open", "Close", and "Stop". The function supports the operation of pulsed commands, that is it can take a signal within a specified time interval.
de: Die Funktion enthält einen Steueralgorithmus für die Sammlung diskreter Signale für Signalspeicher und Pumpen, die enthalten: Zeichen "Geöffnet", "Geschlossen" und Befehle "Öffnen", "Schließen" und "Stoppen". Die Funktion unterstützt den Betrieb gepulster Befehle, dh sie kann innerhalb eines bestimmten Zeitintervalls ein Signal empfangen.
ru: Функция содержит алгоритм управления сборками дискретных сигналов для задвижек и насосов, содержащих: признаки "Открыт", "Закрыт" и команды "Открыть", "Закрыть", "Стоп". Функция поддерживает работу с импульсными командами, т.е. может снимать сигнал через указанный промежуток времени.
uk: Функція містить алгоритм управління збірками дискретних сигналів для засувок та насосів, які містять: ознаки "Відкрито", "Закрито" та команди "Открыть", "Закрыть", "Стоп". Функція підтримує роботу з імпульсними командами, тобто може знімати сигнал через вказаний проміжок часу.

source: Output
de: Ausgang
ru: Выход
uk: Вихід

source: Input %d.1
de: Eingang %d.1
ru: Вход %d.1
uk: Вхід %d.1

source: Input %d.2
de: Eingang %d.2
ru: Вход %d.2
uk: Вхід %d.2

source: Simple sumator
de: Einfacher Sumator
ru: Простой сумматор
uk: Простий суматор

source: Simple sumator with multiplication: out=in1_1*in1_2+in2_1*in2_2+in3_1*in3_2+in4_1*in4_2+ in5_1*in5_2+in6_1*in6_2+in7_1*in7_2+in8_1*in8_2;
de: Einfacher Sumator mit Multiplikation: out=in1_1*in1_2+in2_1*in2_2+in3_1*in3_2+in4_1*in4_2+ in5_1*in5_2+in6_1*in6_2+in7_1*in7_2+in8_1*in8_2;
ru: Простое суммирование с умножением: out=in1_1*in1_2+in2_1*in2_2+in3_1*in3_2+in4_1*in4_2+ in5_1*in5_2+in6_1*in6_2+in7_1*in7_2+in8_1*in8_2;
uk: Простий суматор з множенням: out=in1_1*in1_2+in2_1*in2_2+in3_1*in3_2+in4_1*in4_2+ in5_1*in5_2+in6_1*in6_2+in7_1*in7_2+in8_1*in8_2;

source: Input 1.
de: Eingang 1.
ru: Вход 1.
uk: Вхід 1.

source: Input 2.
de: Eingang 2.
ru: Вход 2.
uk: Вхід 2.

source: Simple multiplication
de: Einfache Multiplikation
ru: Простое умножение
uk: Просте множення

source: Simple multiplication with division: out=(in1_1*in1_2*in1_3*in1_4*in1_5*in1_6)/(in2_1*in2_2*in2_3*in2_4);
de: Einfache Multiplikation mit Division: out=(in1_1*in1_2*in1_3*in1_4*in1_5*in1_6)/(in2_1*in2_2*in2_3*in2_4);
ru: Простое умножение с делением: out=(in1_1*in1_2*in1_3*in1_4*in1_5*in1_6)/(in2_1*in2_2*in2_3*in2_4);
uk: Просте множення з діленням: out=(in1_1*in1_2*in1_3*in1_4*in1_5*in1_6)/(in2_1*in2_2*in2_3*in2_4);

source: Input 3.
de: Eingang 3.
ru: Вход 3.
uk: Вхід 3.

source: Input 4.
de: Eingang 4.
ru: Вход 4.
uk: Вхід 4.

source: Multiplication and division
de: Multiplikation und Division
ru: Умножение и деление
uk: Множення та ділення

source: Branched multiplication and division: out=in1_1*in1_2*in1_3*in1_4*in1_5*(in2_1*in2_2*in2_3*in2_4*in2_5+ (in3_1*in3_2*in3_3*in3_4*in3_5)/(in4_1*in4_2*in4_3*in4_4*in4_5));
de: Verzweigte Multiplikation und Division: out=in1_1*in1_2*in1_3*in1_4*in1_5*(in2_1*in2_2*in2_3*in2_4*in2_5+ (in3_1*in3_2*in3_3*in3_4*in3_5)/(in4_1*in4_2*in4_3*in4_4*in4_5));
ru: Разветвленное умножение и деление: out=in1_1*in1_2*in1_3*in1_4*in1_5*(in2_1*in2_2*in2_3*in2_4*in2_5+ (in3_1*in3_2*in3_3*in3_4*in3_5)/(in4_1*in4_2*in4_3*in4_4*in4_5));
uk: Розгалужене множення та ділення: out=in1_1*in1_2*in1_3*in1_4*in1_5*(in2_1*in2_2*in2_3*in2_4*in2_5+ (in3_1*in3_2*in3_3*in3_4*in3_5)/(in4_1*in4_2*in4_3*in4_4*in4_5));

source: Input 3
de: Eingang 3
ru: Вход 3
uk: Вхід 3

source: Input 5
de: Eingang 5
ru: Вход 5
uk: Вхід 5

source: Exponent
ru: Экспонента
uk: Експонента

source: Calculate an exponent over a group of variables: out=exp (in1_1*in1_2*in1_3*in1_4*in1_5 + (in2_1*in2_2*in2_3*in2_4*in2_5+in3) / (in4_1*in4_2*in4_3*in4_4*in4_5+in5) );
de: Berechne einen Exponenten über eine Gruppe von Variablen: out=exp (in1_1*in1_2*in1_3*in1_4*in1_5 + (in2_1*in2_2*in2_3*in2_4*in2_5+in3) / (in4_1*in4_2*in4_3*in4_4*in4_5+in5) );
ru: Вычисление экспоненты над группой переменных: out=exp (in1_1*in1_2*in1_3*in1_4*in1_5 + (in2_1*in2_2*in2_3*in2_4*in2_5+in3) / (in4_1*in4_2*in4_3*in4_4*in4_5+in5) );
uk: Обчислення експоненти над групою змінних: out=exp (in1_1*in1_2*in1_3*in1_4*in1_5 + (in2_1*in2_2*in2_3*in2_4*in2_5+in3) / (in4_1*in4_2*in4_3*in4_4*in4_5+in5) );

source: Power
de: Potenz
ru: Степень
uk: Ступінь

source: Raising to the power: out=(in1_1*in1_2*in1_3*in1_4*in1_5)^(in2_1*in2_2*in2_3*in2_4*in2_5 + (in3_1*in3_2*in3_3*in3_4*in3_5)/(in4_1*in4_2*in4_3*in4_4*in4_5));
de: Zur Macht erheben: out=(in1_1*in1_2*in1_3*in1_4*in1_5)^(in2_1*in2_2*in2_3*in2_4*in2_5 + (in3_1*in3_2*in3_3*in3_4*in3_5)/(in4_1*in4_2*in4_3*in4_4*in4_5));
ru: Возведение в степень: out=(in1_1*in1_2*in1_3*in1_4*in1_5)^(in2_1*in2_2*in2_3*in2_4*in2_5 + (in3_1*in3_2*in3_3*in3_4*in3_5)/(in4_1*in4_2*in4_3*in4_4*in4_5));
uk: Зведення у ступінь: out=(in1_1*in1_2*in1_3*in1_4*in1_5)^(in2_1*in2_2*in2_3*in2_4*in2_5 + (in3_1*in3_2*in3_3*in3_4*in3_5)/(in4_1*in4_2*in4_3*in4_4*in4_5));

source: Input 1
de: Eingang 1
ru: Вход 1
uk: Вхід 1

source: Condition '<'
de: Bedingung '<'
ru: Условие '<'
uk: Умова '<'

source: Operation of the branching according to the condition "less": out=if( in1<(in2_1*in2_2*in2_3*in2_4) ) then in3_1*in3_2*in3_3*in3_4; else in4_1*in4_2*in4_3*in4_4;
de: Operation der Verzweigung gemäß der Bedingung "weniger": out=if( in1<(in2_1*in2_2*in2_3*in2_4) ) then in3_1*in3_2*in3_3*in3_4; else in4_1*in4_2*in4_3*in4_4;
ru: Операция ветвления согласно условию "меньше": out=if( in1<(in2_1*in2_2*in2_3*in2_4) ) then in3_1*in3_2*in3_3*in3_4; else in4_1*in4_2*in4_3*in4_4;
uk: Операція розгалуження відповідно до умови "менше": out=if( in1<(in2_1*in2_2*in2_3*in2_4) ) then in3_1*in3_2*in3_3*in3_4; else in4_1*in4_2*in4_3*in4_4;

source: Condition '>'
de: Bedingung '>'
ru: Условие '>'
uk: Умова '>'

source: Operation of the branching according to the condition "great": out=if( in1>(in2_1*in2_2*in2_3*in2_4) ) then in3_1*in3_2*in3_3*in3_4; else in4_1*in4_2*in4_3*in4_4;
de: Operation der Verzweigung gemäß der Bedingung "groß": out=if( in1>(in2_1*in2_2*in2_3*in2_4) ) then in3_1*in3_2*in3_3*in3_4; else in4_1*in4_2*in4_3*in4_4;
ru: Операция ветвления согласно условию "больше": out=if( in1>(in2_1*in2_2*in2_3*in2_4) ) then in3_1*in3_2*in3_3*in3_4; else in4_1*in4_2*in4_3*in4_4;
uk: Операція розгалуження відповідно до умови "більше": out=if( in1>(in2_1*in2_2*in2_3*in2_4) ) then in3_1*in3_2*in3_3*in3_4; else in4_1*in4_2*in4_3*in4_4;

source: Input 5.
de: Eingang 5.
ru: Вход 5.
uk: Вхід 5.

source: Input 6.
de: Eingang 6.
ru: Вход 6.
uk: Вхід 6.

source: Full condition
de: Verschachtelte Bedingung
ru: Полное условие
uk: Повна умова

source: Full condition check including great, less and equal: out = if( in1<(in2_1*in2_2*in2_3*in2_4) ) then in3_1*in3_2*in3_3*in3_4; else if( in1>(in4_1*in4_2*in4_3*in4_4) then in5_1*in5_2*in5_3*in5_4; else in6_1*in6_2*in6_3*in6_4;
de: Voller Zustandstest einschließlich groß, weniger und gleich: out = if( in1<(in2_1*in2_2*in2_3*in2_4) ) then in3_1*in3_2*in3_3*in3_4; else if( in1>(in4_1*in4_2*in4_3*in4_4) then in5_1*in5_2*in5_3*in5_4; else in6_1*in6_2*in6_3*in6_4;
ru: Полная проверка условия включая больше, меньше и равно: out = if( in1<(in2_1*in2_2*in2_3*in2_4) ) then in3_1*in3_2*in3_3*in3_4; else if( in1>(in4_1*in4_2*in4_3*in4_4) then in5_1*in5_2*in5_3*in5_4; else in6_1*in6_2*in6_3*in6_4;
uk: Повна перевірка умови включаючи більше, менше та дорівнює: out = if( in1<(in2_1*in2_2*in2_3*in2_4) ) then in3_1*in3_2*in3_3*in3_4; else if( in1>(in4_1*in4_2*in4_3*in4_4) then in5_1*in5_2*in5_3*in5_4; else in6_1*in6_2*in6_3*in6_4;

source: Select
de: Auswahl
ru: Выбор
uk: Вибір

source: Selection
de: Auswahl
ru: Выбор
uk: Вибір

source: Choose one from the four options: out = if( sel = 1 ) then in1_1*in1_2*in1_3*in1_4; if( sel = 2 ) then in2_1*in2_2*in2_3*in2_4; if( sel = 3 ) then in3_1*in3_2*in3_3*in3_4; if( sel = 4 ) then in4_1*in4_2*in4_3*in4_4;
de: Wählen Sie eine der vier Optionen: out = if( sel = 1 ) then in1_1*in1_2*in1_3*in1_4; if( sel = 2 ) then in2_1*in2_2*in2_3*in2_4; if( sel = 3 ) then in3_1*in3_2*in3_3*in3_4; if( sel = 4 ) then in4_1*in4_2*in4_3*in4_4;
ru: Выбор одного из четырёх вариантов: out = if( sel = 1 ) then in1_1*in1_2*in1_3*in1_4; if( sel = 2 ) then in2_1*in2_2*in2_3*in2_4; if( sel = 3 ) then in3_1*in3_2*in3_3*in3_4; if( sel = 4 ) then in4_1*in4_2*in4_3*in4_4;
uk: Вибір одного з чотирьох варіантів: out = if( sel = 1 ) then in1_1*in1_2*in1_3*in1_4; if( sel = 2 ) then in2_1*in2_2*in2_3*in2_4; if( sel = 3 ) then in3_1*in3_2*in3_3*in3_4; if( sel = 4 ) then in4_1*in4_2*in4_3*in4_4;

source: Input
de: Eingang
ru: Вход
uk: Вхід

source: Previous
de: Vorhergehend
ru: Предыдущий
uk: Попередній

source: Positive coefficient
de: Positiver Koeffizient
ru: Положительный коэффициент
uk: Позитивний коефіцієнт

source: Negative coefficient
de: Negativer Koeffizient
ru: Отрицательный коэффициент
uk: Негативний коефіцієнт

source: Iterator
ru: Итератор
uk: Ітератор

source: Iterative calculation with the increment specifying, gain ratio for different directions is different: out = if( in > prev ) then prev + (k+)*(in-prev); else prev - (k-)*(prev-in);
de: Die iterative Berechnung mit dem Inkrement-Spezifizierungs-Verstärkungs-Verhältnis für verschiedene Richtungen ist unterschiedlich: out = if( in > prev ) then prev + (k+)*(in-prev); else prev - (k-)*(prev-in);
ru: Итерационное вычисление с указанием приращения, коэффициент приращения для разных направлений различный: out = if( in > prev ) then prev + (k+)*(in-prev); else prev - (k-)*(prev-in);
uk: Ітераційне обчислення з вказаним прирощенням, коефіцієнт прирощення для різних напрямків різний: out = if( in > prev ) then prev + (k+)*(in-prev); else prev - (k-)*(prev-in);

source: Input 6
de: Eingang 6
ru: Вход 6
uk: Вхід 6

source: Division
de: Einteilung
ru: Деление
uk: Ділення

source: Divides assemblies of variables: out = (in1_1*in1_2*in1_3*in1_4*in1_5 + in2_1*in2_2*in2_3*in2_4*in2_5 + in3) / (in4_1*in4_2*in4_3*in4_4*in4_5 + in5_1*in5_2*in5_3*in5_4*in5_5 + in6);
de: Teilt Baugruppen von Variablen: out = (in1_1*in1_2*in1_3*in1_4*in1_5 + in2_1*in2_2*in2_3*in2_4*in2_5 + in3) / (in4_1*in4_2*in4_3*in4_4*in4_5 + in5_1*in5_2*in5_3*in5_4*in5_5 + in6);
ru: Производит деление сборок переменных: out = (in1_1*in1_2*in1_3*in1_4*in1_5 + in2_1*in2_2*in2_3*in2_4*in2_5 + in3) / (in4_1*in4_2*in4_3*in4_4*in4_5 + in5_1*in5_2*in5_3*in5_4*in5_5 + in6);
uk: Здійснює ділення збірок змінних: out = (in1_1*in1_2*in1_3*in1_4*in1_5 + in2_1*in2_2*in2_3*in2_4*in2_5 + in3) / (in4_1*in4_2*in4_3*in4_4*in4_5 + in5_1*in5_2*in5_3*in5_4*in5_5 + in6);

source: Variable
ru: Переменная
uk: Змінна

source: Setpoint
de: Sollwert
ru: Задание
uk: Завдання

source: Maximum of the scale
de: Maximum der Skala
ru: Максимум шкалы
uk: Максимум шкали

source: Minimum of the scale
de: Minimum der Skala
ru: Минимум шкалы
uk: Мінімум шкали

source: Manual input, %
de: Manuell Eingang, %
ru: Ручной ввод, %
uk: Ручний ввід, %

source: Output, %
de: Ausgang, %
ru: Выход, %
uk: Вихід, %

source: Auto mode
de: Auto Modus
ru: Режим Автомат
uk: Режим автомат

source: Cascade mode
de: Kaskadierter Modus
ru: Режим Каскад
uk: Режим каскад

source: Kp
ru: Кп
uk: Кп

source: Ti, milliseconds
de: Ti, Millisekunden
ru: Ти, миллисекунды
uk: Ті, мілісекунди

source: Kd
ru: Кд
uk: Кд

source: Td, milliseconds
de: Td, Millisekunden
ru: Тд, миллисекунды
uk: Тд, мілісекунди

source: Td lag, milliseconds
de: Td Verzögerung, Millisekunden
ru: Тд задержка, миллисекунды
uk: Тд затр., мілісекунди

source: Upper limit of the out, %
de: Obergrenze des Out, %
ru: Верхняя граница выхода, %
uk: Верхня границя виходу, %

source: Lower limit of the out, %
de: Untergrenze des Out, %
ru: Нижняя граница выхода, %
uk: Нижня границя виходу, %

source: Insensibility, %
de: Unempfindlichkeit, %
ru: Нечувствительность, %
uk: Нечутливість, %

source: Follow setpoint from variable on the manual mode
de: Folgen Sie dem Sollwert von der Variable im manuellen Modus
ru: Следить задание за переменной в ручном режиме
uk: Стежити завдання за змінною у ручному режимі

source: K input 1
de: K Eingang 1
ru: К входа 1
uk: К входу 1

source: K input 2
de: K Eingang 2
ru: К входа 2
uk: К входу 2

source: Input 2
de: Eingang 2
ru: Вход 2
uk: Вхід 2

source: K input 3
de: K Eingang 3
ru: К входа 3
uk: К входу 3

source: K input 4
de: K Eingang 4
ru: К входа 4
uk: К входу 4

source: Input 4
de: Eingang 4
ru: Вход 4
uk: Вхід 4

source: Integral value
de: Wert des Integrals
ru: Значение интеграла
uk: Значення інтегралу

source: Differential value
de: Wert des Differentials
ru: Значение дифференциала
uk: Значення диференціалу

source: Differential lag
de: Verspätung der Differenzierung
ru: Задержка дифференциала
uk: Затримка диференціалу

source: PID regulator
de: PID Regler
ru: ПИД регулятор
uk: ПІД регулятор

source: Proportional-integral-differential regulator.
de: Proportional-Integral-Differenzdruckregler.
ru: Пропорционально-интегрально-дифференциальный регулятор.
uk: Пропорційно-інтегрально-диференціальний регулятор.

source: Value
de: Wert
ru: Значение
uk: Значення

source: Maximum
ru: Максимум
uk: Максимум

source: Minimum
ru: Минимум
uk: Мінімум

source: Alarm
ru: Сигнал
uk: Сигнал

source: Setting an alarm sign in case of exceeding of the variable for the specified boundary: out = if (val>max || val<min) then true; else false;
de: Setzen eines Alarmzeichens bei Überschreitung der Variablen für die angegebene Grenze: out = if (val>max || val<min) then true; else false;
ru: Установка признака сигнализации в случае выхода значения переменной за указанную границу: out = if (val>max || val<min) then true; else false;
uk: Установка ознаки сигналізації у випадку виходу значення змінної за вказану границю: out = if (val>max || val<min) then true; else false;

source: Flow
de: Durchfluss
ru: Расход
uk: Витрати

source: X position
ru: X положение
uk: X позиція

source: Calculation of the gas flow: f = K1*((K3+K4*x)^K2);
de: Berechnung des Gasflusses: f = K1*((K3+K4*x)^K2);
ru: Вычисление расхода газа: f = K1*((K3+K4*x)^K2);
uk: Обчислення витрат газу: f = K1*((K3+K4*x)^K2);

source: Sum and multiplicating
de: Summe und Multiplikation
ru: Сумма и умножение
uk: Сума та множення

source: Sum with multiplication of values group: out = in1_1*in1_2*(in1_3*in1_4+in1_5) + in2_1*in2_2*(in2_3*in2_4+in2_5) + in3_1*in3_2*(in3_3*in3_4+in3_5) + in4_1*in4_2*(in4_3*in4_4+in4_5);
de: Summe mit Multiplikation der Wertegruppe: out = in1_1*in1_2*(in1_3*in1_4+in1_5) + in2_1*in2_2*(in2_3*in2_4+in2_5) + in3_1*in3_2*(in3_3*in3_4+in3_5) + in4_1*in4_2*(in4_3*in4_4+in4_5);
ru: Сумма с умножением группы значений: out = in1_1*in1_2*(in1_3*in1_4+in1_5) + in2_1*in2_2*(in2_3*in2_4+in2_5) + in3_1*in3_2*(in3_3*in3_4+in3_5) + in4_1*in4_2*(in4_3*in4_4+in4_5);
uk: Сума з множенням групи значень: out = in1_1*in1_2*(in1_3*in1_4+in1_5) + in2_1*in2_2*(in2_3*in2_4+in2_5) + in3_1*in3_2*(in3_3*in3_4+in3_5) + in4_1*in4_2*(in4_3*in4_4+in4_5);

source: Sum with division
de: Summe und Division
ru: Сумма с делением
uk: Сума та ділення

source: Sum with division of values group: out = in1_1*in1_2*(in1_3+in1_4/in1_5) + in2_1*in2_2*(in2_3+in2_4/in2_5) + in3_1*in3_2*(in3_3+in3_4/in3_5) + in4_1*in4_2*(in4_3+in4_4/in4_5);
de: Summe mit Division der Wertegruppe: out = in1_1*in1_2*(in1_3+in1_4/in1_5) + in2_1*in2_2*(in2_3+in2_4/in2_5) + in3_1*in3_2*(in3_3+in3_4/in3_5) + in4_1*in4_2*(in4_3+in4_4/in4_5);
ru: Суммирование с делением группы значений: out = in1_1*in1_2*(in1_3+in1_4/in1_5) + in2_1*in2_2*(in2_3+in2_4/in2_5) + in3_1*in3_2*(in3_3+in3_4/in3_5) + in4_1*in4_2*(in4_3+in4_4/in4_5);
uk: Сума з діленням групи значень: out = in1_1*in1_2*(in1_3+in1_4/in1_5) + in2_1*in2_2*(in2_3+in2_4/in2_5) + in3_1*in3_2*(in3_3+in3_4/in3_5) + in4_1*in4_2*(in4_3+in4_4/in4_5);

source: Klag
ru: Кзадрж
uk: Кзатр

source: Lag
de: Verzögerung
ru: Задержка
uk: Затримка

source: Delay of the change of a variable, practically it is a filter without binding to time: y = y - Klag*( y - x );
de: Verzögerung der Änderung einer Variablen, praktisch ist es ein Filter ohne Bindung an die Zeit: y = y - Klag*( y - x );
ru: Задержка изменения переменной, практически это фильтр без привязки ко времени: y = y - Klag*( y - x );
uk: Затримка зміни змінної, практично це фільтр без прив'язки до часу: y = y - Klag*( y - x );
