Repository: aleax/openscada
Catalog: src/moduls/protocol/HTTP/po/*.po
Languages: de, ru, uk

source: HTTP-realization
de: HTTP-Realisierung
ru: HTTP-реализация
uk: HTTP-реалізація

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко

source: Provides support for the HTTP protocol for WWW-based user interfaces.
de: HTTP-Unterstützung für eine WWW basierte Benutzerschnittstelle.
ru: Предоставляет поддержку HTTP для WWW основанных пользовательских интерфейсов.
uk: Надає підтримку HTTP для WWW базованих користувацьких інтерфейсів.

source: ======================= Module <%s:%s> options ======================= ---- Parameters of the module section '%s' of the configuration file ---- AuthTime <min> Life time of the authentication session, in minutes (default 10).
de: ======================= Optionen des Moduls <%s:%s> ============================= ------ Parameter des Modulabschnitts '%s' der Konfigurationsdatei ------ AuthTime <min> Lebensdauer der Authentifizierungssitzung in Minuten (Standard 10).
ru: ======================= Опции модуля <%s:%s> ============================= ------ Параметры модульной секции '%s' конфигурационного файла ------ AuthTime <мин> Время жизни сеанса аутентификации, минут (по умолчанию 10).
uk: ======================= Опції модуля <%s:%s> ============================= ------ Параметри модульної секції '%s' конфігураційного файлу ------ AuthTime <хвил> Час життя сеансу аутентифікації, хвилин (по замовченню 10).

source: Error loading the META header '%s': %s
de: Fehler beim Laden des META-Headers '%s': %s
ru: Ошибка загрузки META загаловка '%s': %s
uk: Помилка завантаження META заголовку '%s': %s

source: Error loading the HTML template '%s' for the language '%s': %s
de: Fehler beim Laden der HTML-Vorlage '%s' für die Sprache '%s': %s
ru: Ошибка загрузки HTML шаблона '%s' для языка '%s': %s
uk: Помилка завантаження HTML шаблону '%s' для мови '%s': %s

source: Exiting the authentication for the user '%s'.
de: Beenden der Authentifizierung für den Benutzer '%s'.
ru: Выход аутентификации пользователя '%s'.
uk: Вихід автентифікації для користувача '%s'.

source: The authentication session for the user '%s' is expired.
de: Die Authentifizierungssitzung für den Benutzer '%s' ist abgelaufen.
ru: Сеанс аутентификации для пользователя '%s' устарел.
uk: Сеанс автентифікації для користувача '%s' застарів.

source: Error or not supported the HTTP method '%s'.
de: Fehler oder nicht unterstützt die HTTP-Methode '%s'.
ru: Ошибка или не поддерживается HTTP-метод '%s'.
uk: Помилка або не підтримується метод '%s'.

source: Error the HTTP response
de: Fehler bei der HTTP-Antwort
ru: Ошибка HTTP ответа
uk: Помилка HTTP-відповіді

source: Not full response.
de: Nicht vollständige Antwort.
ru: Неполный ответ.
uk: Неповна відповідь.

source: Protocol
de: Protokoll
ru: Протокол
uk: Протокол

source: State
de: Zustand
ru: Статус
uk: Стан

source: Active authentication sessions
de: Aktive Authentifizierung Sitzungen
ru: Активные сеансы аутентификации
uk: Активні сеанси аутентифікації

source: Module options
de: Moduloptionen
ru: Опции модуля
uk: Опції модуля

source: Deny
de: Verweigern
ru: Запрещено
uk: Заборонено

source: Allow
de: Zulassen
ru: Разрешено
uk: Дозволено

source: HTML template
ru: HTML шаблон
uk: HTML шаблон

source: HTML template of the main page
de: HTML-Vorlage der Hauptseite
ru: HTML шаблон главной страницы
uk: HTML шаблон головної сторінки

source: DB of the active authentication sessions
de: DB der aktiven Authentifizierungssitzungen
ru: БД активных сеансов аутентификации
uk: БД активних сеансів аутентифікації

source: Set to empty to disable using the external table of the active authentication sessions.
de: Auf leer setzen, um die Verwendung der externen Tabelle der aktiven Authentifizierungssitzungen zu deaktivieren.
ru: Установить в пустое для отключения внешней таблицы активных сеансов аутентификации.
uk: Встановити у порожне для вимкнення зовнішньої таблиці активних сеансів автентифікації.

source: Life time of the authentication, minutes
de: Lebenszeit der Authentifizierung, Minuten
ru: Время жизни аутентификации, минут
uk: Час життя аутентифікації, хвилин

source: List of users allowed for authentication, separated by ';'
de: Liste der zur Authentifizierung zugelassenen Benutzer, getrennt durch ';'
ru: Перечень пользователей допустимых для аутентификации, разделённые ';'
uk: Перелік користувачів дозволених до аутентифікації, поділені ';'

source: Auto login
ru: Автоматический вход
uk: Автоматичний вхід

source: A list of address templates can be used for the address field, for example "192.168.1.*;192.168.2.*".
de: Eine Liste von Adressvorlagen kann für das Adressfeld verwendet werden, zum Beispiel "192.168.1.*;192.168.2.*".
ru: Для поля адреса возможно использование списка шаблонов адресов, для примера "192.168.1.*;192.168.2.*".
uk: Для поля адреси може бути використано перелік шаблонів адреси, для прикладу "192.168.1.*;192.168.2.*".

source: Address
de: Adresse
ru: Адреса
uk: Адреси

source: User
de: Benutzername
ru: Пользователь
uk: Користувач

source: %s %s(%s), by "%s"
de: %s %s(%s), durch "%s"
ru: %s %s(%s), от "%s"
uk: %s %s(%s), від "%s"

source: Content: %d: %s
de: Inhalt: %d: %s
ru: Содержимое: %d: %s
uk: Вміст: %d: %s

source: Successful authentication for the user '%s'. Host: %s. User agent: %s.
de: Erfolgreiche Authentifizierung für den Benutzer '%s'. Host: %s. User-Agent: %s.
ru: Успешная аутентификация пользователя '%s'. Узел: %s. Агент пользователя: %s.
uk: Вдала автентифікація користувача '%s'. Вузол: %s. Агент користувача: %s.

source: Going to the page: <b>%s</b>
de: Gehen zur Seite: <b>%s</b>
ru: Переход к странице: <b>%s</b>
uk: Перехід до сторінки: <b>%s</b>

source: Wrong authentication of the user '%s'. Host: %s. User agent: %s.
de: Falsche Authentifizierung vom Benutzer '%s'. Host: %s. User-Agent: %s.
ru: Ошибка аутентификации пользователя '%s'. Узел: %s. Агент пользователя: %s.
uk: Помилка автентифікації користувача '%s'. Вузол: %s. Агент користувача: %s.

source: <p style='color: #CF8122;'>Wrong authentication! Retry please.</p>
de: <p style='color: #CF8122;'>Fehler in der Authentifizierung! Versuchen Sie noch einmal.</p>
ru: <p style='color: #CF8122;'>Ошибка аутентификации! Повторите пожалуйста.</p>
uk: <p style='color: #CF8122;'>Помилка аутентифікації! Повторіть будь ласка.</p>

source: No WWW subtype module found!
de: Keine Modul mit dem Subtyp WWW gefunden!
ru: Не найдено модулей с подтипом WWW!
uk: Не знайдено жодного модуля підтипу WWW!

source: Successful automatic authentication for the user '%s'. Host: %s. User agent: %s.
de: Erfolgreiche automatische Authentifizierung für den Benutzer '%s'. Host: %s. User-Agent: %s.
ru: Успешная автоматическая аутентификация пользователя '%s'. Узел: %s. Агент пользователя: %s.
uk: Вдала автоматична автентифікація користувача '%s'. Вузол: %s. Агент користувача: %s.

source: No HTTP GET function in the module '%s'!
de: Keine HTTP-GET-Funktion für Modul '%s' vorhanden!
ru: Нет HTTP GET функции у модуля '%s'!
uk: Немає HTTP GET функції у модуля '%s'!

source: No HTTP POST function in the module '%s'!
de: Keine HTTP-POST-Funktion für Modul '%s' vorhanden!
ru: Нет HTTP POST функции у модуля '%s'!
uk: Немає HTTP POST функції у модуля '%s'!

source: Login
de: Einloggen
ru: Вход
uk: Вхід

source: You are logged in as "<b>%s</b>".
de: Sie sind eingeloggt als "<b>%s</b>".
ru: Вы вошли как "<b>%s</b>".
uk: Ви увійшли як "<b>%s</b>".

source: Select the necessary Web-module from the list below, <a href='%s'>logout</a> or <a href='%s'>login as an another user</a>.
de: Wählen Sie den Web-Modul aus der Liste unten, <a href='%s'>ausloggen</a> oder <a href='%s'>einloggen als anderer Benutzer</a>.
ru: Выберите нужный Web-модуль из списка ниже, <a href='%s'>выйдите</a> или <a href='%s'>войдите от имени другого пользователя</a>.
uk: Оберіть потрібний Web-модуль із переліку нижче, <a href='%s'>вийдіть</a> або <a href='%s'>увійдіть від ім'я іншого користувача</a>.

source: You are not logged in the system!
de: Sie sind nicht eingeloggt!
ru: Вы не вошли в систему!
uk: Ви не увійшли до системи!

source: To use some modules you must be logged in. <a href='%s'>Login now</a>.
de: Zum Bedienen einiger Module müssen Sie sich einloggen. <a href='%s'>Jetzt einloggen</a>.
ru: Для использования некоторых модулей Вы должны войти в систему. <a href='%s'>Войти</a>.
uk: Для використання окремих модулів Ви маєте увійти у систему. <a href='%s'>Увійти</a>.

source: You can auto-login from the user "<b>%s</b>" just selecting the module.
de: Sie können Auto-Login von dem Benutzer "<b>%s</b>" nur das Modul auswählen.
ru: Вы можете автоматически подключиться от имени пользователя "<b>%s</b>" просто выбрав модуль.
uk: Ви можете автоматично увійти від користувача "<b>%s</b>" просто обравши модуль.

source: Accessible web modules
de: Verfügbare Web Module
ru: Доступные web-модули
uk: Наявні web модулі

source: Login to the system
de: Einloggen in das System
ru: Вход в систему
uk: Вхід до системи

source: User name
de: Benutzername
ru: Имя пользователя
uk: Ім'я користувача

source: Password
de: Kennwort
ru: Пароль
uk: Пароль

source: Enter
ru: Принять
uk: Прийняти

source: Clean
de: Bereinigen
ru: Очистить
uk: Очистити
