Repository: aleax/openscada
Catalog: src/moduls/ui/QTCfg/po/*.po
Languages: de, ru, uk

source: Provides the Qt-based configurator of OpenSCADA.
de: Stellt den Qt-basierten Konfigurator von OpenSCADA zur Verfügung.
uk: Надає заснований на Qt конфігуратор OpenSCADA.

source: ======================= Module <%s:%s> options ======================= ---- Parameters of the module section '%s' of the configuration file ---- StartPath <path> Initial page path of the configurator. StartUser <user> Starting user without password. ToolTipLim <chars> ToolTip limit in chars, by default 150. Set zero for disable.
de: ======================= Optionen des Moduls <%s:%s> ======================== ------ Parameter des Modulabschnitts '%s' der Konfigurationsdatei ------ StartPath <path> Initialer Seitenpfad des Konfigurators. StartUser <user> Benutzer ohne Passwort starten. ToolTipLim <Zeichen> ToolTip-Limit in Chars, standardmäßig 150. Stellen Sie Null zum Deaktivieren ein.
uk: ======================= Опції модуля <%s:%s> ============================= ------ Параметри модульної секції '%s' конфігураційного файлу ------ StartPath <шлях> Шлях первинної сторінки конфігуратору. StartUser <корист> Стартовий користувач, без паролю. ToolTipLim <символів> Обмеження ToolTip у символах, по замовченню 150. Встановити нуль для вимкнення.

source: Loading the module.
de: Laden des Moduls.
uk: Завантаження модуля.

source: Saving the module.
de: Speichern des Moduls.
uk: Збереження модуля.

source: Starting the module.
de: Starten des Moduls.
uk: Запуск модуля.

source: Stopping the module.
de: Stoppen des Moduls.
uk: Зупинка модуля.

source: Module options
de: Optionen des Moduls
ru: Опции модуля
uk: Параметри модуля

source: Timeouts of the connection checking '{fail}:{good}', seconds
uk: Таймаути перевірки підключення '{немає}:{є}', у секундах

source: Initial path of the configurator
de: Anfangspfad des Konfigurators
uk: Початковий шлях конфігуратору

source: Initial user of the configurator
de: Anfängliche Benutzer des Konfigurators
uk: Початковий користувач конфігуратору

source: ToolTip limit, zero to disable
de: ToolTip-Limit, Null zum Deaktivieren
uk: Обмеження ToolTip, нуль для вимкнення

source: Go to configuration of the remote OpenSCADA hosts list
uk: Перейти до конфігурації переліку віддалених хостів OpenSCADA

source: Page
de: Seite
uk: Сторінка

source: Item
de: Artikel
uk: Елемент

source: QTCfg dialog
ru: QTCfg диалог
uk: QTCfg діалог

source: Selecting the identifier and the name of the node
de: Auswahl des Bezeichners und des Knotens
uk: Обрання ідентифікатору та ім'я вузлу

source: Copy text
de: Kopieren Text

source: Saving an image
de: Speichern eines Bildes

source: Loading an image
de: Laden Sie ein Bild

source: Timeouts of checking connections '{fail}:{good}', seconds
de: Zeitüberschreitungen beim Überprüfen von Verbindungen '{fail}:{gut}', Sekunden

source: Go to the configuration of the list of remote stations
de: Gehen Sie auf die Konfiguration der Liste der entfernten Stationen

source: The main navigation tree of the configurator.
ru: Основное дерево навигации конфигуратора.

source: The main configurator frame.
ru: Основное поле конфигуратора.

source: Close configurator window
ru: Закрыть окно конфигуратора

source: The button for closing OpenSCADA configurator window
ru: Кнопка для закрытия конфигурационного окна OpenSCADA

source: Press to close OpenSCADA configurator window
ru: Нажать для закрытия окна конфигуратора OpenSCADA

source: Quit OpenSCADA
ru: Закрыть OpenSCADA

source: The button for full quit from OpenSCADA
ru: Кнопка для полного выхода из OpenSCADA

source: Press for full quit from OpenSCADA
ru: Нажать для полного выхода из OpenSCADA

source: Up page
ru: На страницу вверх

source: The button for going to level up
ru: Кнопка для поднятия на уровень вверх

source: Press for going to level up
ru: Перейти на страницу вверх

source: &Previous
ru: &Предыдущая

source: Previous page
ru: Предыдущая страница

source: The button for going to previous page
ru: Кнопка для перехода на предыдущую страницу

source: Press for going to previous page
ru: Нажать для перехода на предыдущую страницу

source: &Next
ru: &Следующая

source: Next page
ru: Следующая страница

source: The button for going to next page
ru: Кнопка для перехода не следующую страницу

source: Press for going to next page
ru: Нажать для перехода на следующую страницу

source: Load item data from DB
ru: Загрузка данных элемента из БД

source: The button for loading item data from DB
ru: Кнопка для загрузки данных элемента из БД

source: Press for loading item data from DB.
ru: Нажать для загрузки данных элемента из БД.

source: Save item data to DB
ru: Сохранение данных элемента в БД

source: The button for saving item data to DB
ru: Кнопка для сохранения данных элемента в БД

source: Press for saving item data to DB.
ru: Нажать для сохранения данных элемента в БД.

source: The button for adding new item
ru: Кнопка для добавления нового элемента

source: Press for adding new item.
ru: Нажать для добавления нового элемента.

source: The button for deleting item
ru: Кнопка для удаления элемента

source: Press for deleting item.
ru: Нажать для удаления элемента.

source: Item cut
ru: Вырезать элемент

source: Cutting of the item
ru: Вырезание элемента

source: The button for cutting of the item
ru: Кнопка для вырезания элемента

source: Press to cut the item.
ru: Нажать для выполнения вырезания элемента.

source: Item copy
ru: Копировать элемент

source: Copying of the item
ru: Копирование элемента

source: The button for copying of the item
ru: Кнопка для копирования элемента

source: Press to copy the item.
ru: Нажать для выполнения копирования элемента.

source: Item paste
ru: Вставить элемент

source: Pasting of the item
ru: Вставка элемента

source: The button for pasting of the item
ru: Кнопка для вставки элемента

source: Press to paste the item.
ru: Нажать для вставки элемента.

source: Refresh current page
ru: Обновить текущую страницу

source: The button for refreshing of the content of the current page.
ru: Кнопка для обновления содержимого текущей страницы.

source: Press for refreshing of the content of the current page.
ru: Нажать для обновления содержимого текущей страницы.

source: Start cycled refresh
ru: Запустить периодическое обновление

source: The button for starting of the cycled refresh of the content of the current page.
ru: Кнопка для запуска периодического обновления содержимого текущей страницы.

source: Press to start the cycled refresh of the content of the current page.
ru: Нажать для запуска периодического обновления содержимого текущей страницы.

source: Stop cycled refresh
ru: Остановить периодическое обновление

source: The button for stopping of the cycled refresh of the content of the current page.
ru: Кнопка для останова периодического обновления содержимого текущей страницы.

source: Press to stop the cycled refresh of the content of the current page.
ru: Нажать для останова периодического обновления содержимого текущей страницы.

source: The button for display program and OpenSCADA information
ru: Кнопка для показа информации о программе и OpenSCADA

source: Press to display program and OpenSCADA information
ru: Нажать для показа информации о программе и OpenSCADA

source: Press to get the using Qt information.
ru: Нажать для получения информации о Qt

source: Question about GUI elements
ru: Вопрос про GUI элементы

source: The button for requesting the information about user interface elements
ru: Кнопка для запроса информации про элементы пользовательского интерфейса

source: Press for requesting about user interface elements
ru: Нажать для запроса информации про элементы пользовательского интерфейса

source: OpenSCADA toolbar
ru: Панель инструментов OpenSCADA

source: This label displays current user.
ru: Эта метка отображает текущего пользователя.

source: Field for display of the current user.
ru: Поле для отображения текущего пользователя.

source: Double click to change user.
ru: Кликнуть дважды для смены пользователя.

source: This label displays the local station modifying.
ru: Эта метка отображает факт внесения изменений в локальную станцию.

source: Field for display of the local station modifying.
ru: Поле для отображения факта внесения изменений в локальную станцию.

source: This button for call status bar history.
ru: Эта кнопка для вызова истории строки статуса.

source: Button for call status bar history.
ru: Кнопка для вызова истории строки статуса.

source: Changes save
ru: Сохранение изменений

source: Some changing is made. Save changing to DB on exit?
ru: Были сделаны некоторые изменения. Сохранить изменения в БД при выходе?

source: No one editable container is present.
ru: Нет ни одного редактируемого контейнера.

source: Add item to node: '%1'.
ru: Добавление элемента в узел: '%1'.

source: Add node
ru: Добавление элемента

source: Node '%1' is already present.
ru: Узел '%1' уже присутствует.

source: Are you sure of deleting nodes: '%1'?
ru: Вы действительно желаете удалить узлы: '%1'?

source: Delete node
ru: Удаление узла

source: Copy is impossible.
ru: Копирование невозможно.

source: Move or copy node
ru: Перемещение или копирование узла

source: Move node '%1' to '%2'.
ru: Перемещение узла '%1' в '%2'.

source: Copy node '%1' to '%2'.
ru: Копирование узла '%1' в '%2'.

source: Do not the question anymore.
ru: Не спрашивать более.

source: Node '%1' is already present. Continue?
ru: Узел '%1' уже присутствует. Продолжить?

source: Status bar messages list:
ru: Список сообщений строки статуса:

source: Refresh items tree
ru: Обновить элементы дерева

source: Expand/update branch '%s' time %f ms.
ru: Время расширения/обновления ветви '%s' %f мс.

source: Send changes to selections
ru: Отправка изменений выбранным

source: Send current change to other selected nodes "%s"?
ru: Отправить текущее изменение другим выбранным узлам "%s"?

source: %s| Go to link '%s'!
ru: %s| Переход по ссылке '%s'!

source: %s| Press '%s'!
ru: %s| Нажат '%s'!

source: Value no valid:
ru: Значение ошибочно:

source: %s| Change '%s' from '%s' to '%s'!
ru: %s| Изменён '%s' из '%s' в '%s'!

source: Item name set
ru: Установка имени элемента

source: Add new element.
ru: Добавление нового элемента.

source: Insert new element.
ru: Вставка нового элемента.

source: Rename element.
ru: Переименование элемента.

source: %s| Add '%s' element <%s:%s>!
ru: %s| Добавлен '%s' элемент <%s:%s>!

source: %s| Insert '%s' element <%s:%s> to %d!
ru: %s| Вставлен '%s' элемент <%s:%s> в %d!

source: %s| Set '%s' element %d to <%s:%s>!
ru: %s| Установлен '%s' элемент %d в <%s:%s>!

source: %s| Delete '%s' element <%s:%s>!
ru: %s| Удалён '%s' элемент <%s:%s>!

source: %s| Move '%s' from %d to %d!
ru: %s| Перемещён '%s' из %d в %d!

source: Move Up
ru: Передвинуть вверх

source: Move Down
ru: Передвинуть вниз

source: %s| Add '%s' record.
ru: %s| Добавлена '%s' запись.

source: %s| Insert '%s' record %d.
ru: %s| Вставлена '%s' запись %d.

source: %s| Delete '%s' record '%s'.
ru: %s| Удаление '%s' записи '%s'.

source: %s| Move '%s' record from %d to %d.
ru: %s| Перемещение '%s' записи из %d в %d.

source: Save picture
ru: Сохранение картинки

source: Save to file %s error
ru: Ошибка сохранения в файл %s

source: Load picture
ru: Загрузка картинки

source: Open file %s error
ru: Ошибка открытия файла %s

source: Image file %s error
ru: Ошибка файла изображения %s

source: %s| Upload picture '%s' to: %s.
ru: %s| Выгрузка картинки '%s' в: %s.

source: Value '%s' is not valid!
ru: Значение '%s' ошибочно!

source: %s| Set '%s' cell ('%s':%s) to: %s.
ru: %s| Установка '%s' ячейки ('%s':%s) в: %s.

source: Selective element '%s' is not present!
ru: Выборочный элемент '%s' отсутствует!

source: %s| Change '%s' to: '%s'!
ru: %s| Изменено '%s' в: '%s'!

source: Enter text string for search:
ru: Введите текстовую строку для поиска:

source: String search
ru: Поиск строки

source: Select user
ru: Выбор пользователя

source: Auth is wrong!!!
ru: Ошибка аутентификации!!!

source: System configurator (Qt)
ru: Системный конфигуратор (Qt)

source: Allow the Qt based OpenSCADA system configurator.
ru: Предоставляет Qt основанный конфигуратор системы OpenSCADA.

source: ======================= The module <%s:%s> options ======================= ---------- Parameters of the module section '%s' in config-file ---------- StartPath <path> Configurator start path. StartUser <user> No password requested start user.
ru: ======================= Опции модуля <%s:%s> ============================= ------- Параметры модульной секции '%s' в конфигурационном файле --------- StartPath <path> Стартовый путь конфигуратора. StartUser <user> Стартовый, беспарольный, пользователь.

source: Load module.
ru: Загрузка модуля.

source: Save module.
ru: Сохранение модуля.

source: Start module.
ru: Запуск модуля.

source: Stop module.
ru: Останов модуля.

source: Configurator start path
ru: Стартовый путь конфигуратора

source: Configurator start user
ru: Стартовый пользователь конфигуратора

source: Go to remote stations list configuration
ru: Перейти к конфигурации списка удалённых станций

source: Options help
ru: Помощь по опциям

source: Node id and/or name select
ru: Выбор идентификатора и/или имени
