Repository: aleax/openscada
Catalog: src/moduls/ui/QTCfg/po/*.po
Languages: de, ru, uk

source: Ready
de: Fertig
ru: Готов
uk: Готовий

source: The configurator is using the remote host %d times.
de: Der Konfigurator verwendet %d-Zeiten eines Remote-Hosts.
uk: Конфігуратор використовує віддалені хости %d разів.

source: Name
ru: Имя
uk: Назва

source: Type
de: Typ
ru: Тип
uk: Тип

source: Path
de: Pfad
ru: Путь
uk: Шлях

source: Main navigation tree of the configurator.
de: Hauptnavigationsstruktur des Konfigurators.
uk: Основне дерево навігації конфігуратора.

source: Main frame of the configurator.
de: Hauptrahmen des Konfigurators.
uk: Основний простір конфігуратору.

source: Tabulated configuration pages.
de: Konfigurationsseiten in Tabellenform.
ru: Табулированные конфигурационные страницы.
uk: Табульовані конфігураційні сторінки.

source: &Close
de: &Schliessen
ru: &Закрыть
uk: &Закрити

source: Close the configurator window
de: Schließen Sie das Konfiguratorfenster
uk: Закрити вікно конфігуратора

source: The button for closing the configurator window
de: Schaltfläche zum Schließen des Konfiguratorfensters
uk: Кнопка закриття вікна конфігуратора.

source: Press to close the configurator window.
de: Betätigen um das Konfiguratorfenster zu schließen.
uk: Натиснути для закриття вікна конфігуратора.

source: &Quit
de: &Beenden
ru: &Выход
uk: &Вихід

source: Quit the program
de: Beende das Programm
uk: Вихід з програми

source: The button for complete quit the program
de: Schaltfläche zum Beenden beendet das Programm
uk: Кнопка повного виходу з програми

source: Press for complete quit the program.
de: Betätigen um das Programm zu beenden.
uk: Натиснути для повного виходу з програми.

source: &Up
de: Nach &oben
ru: &Вверх
uk: На&гору

source: Go to the parent page
de: Gehe zur Hauptseite
uk: Перейти до батьківської сторінки

source: The button for going to the parent page
de: Schaltfläche um zur übergeordneten Seite zu wechseln
uk: Кнопка переходу до батьківської сторінки

source: Press for going to the parent page.
de: Betätigen um zur übergeordneten Seite zu wechseln.
uk: Натиснути для переходу до батьківської сторінки.

source: &Back
de: &Zurück
uk: По&передня

source: Go back
de: Geh zurück
uk: Перейти назад

source: The button for going to the back page
de: Schaltfläche um zur Rückseite zu gehen
uk: Кнопка переходу на попередню сторінку

source: Press for going to the back page.
de: Betätigen um zur letzten Seite zu gelangen.
uk: Натиснути для переходу на попередню сторінку.

source: &Forward
de: Nach &vorne
uk: На&ступна

source: Go forward
de: Vorwärts gehen
uk: Перейти вперед

source: The button for going to the forward page
de: Schaltfläche um zur nächsten Seite zu gelangen
uk: Кнопка переходу на наступну сторінку

source: Press for going to the forward page.
de: Betätigen um zur nächsten Seite zu gelangen.
uk: Натиснути для переходу на наступну сторінку.

source: Load from DB
de: Laden von der DB
ru: Загрузить из БД
uk: Завантажити з БД

source: Load the item data from DB
de: Laden Sie die Artikeldaten aus der DB
uk: Завантажити дані елементу з БД

source: The button for loading the item data from DB
de: Schaltfläche zum Laden der Artikeldaten aus der DB
uk: Кнопка завантаження даних елементу з БД

source: Press for loading the item data from DB.
de: Betätigen zum Laden der Artikeldaten aus der DB.
uk: Натиснути для завантаження даних елементу з БД.

source: Load from DB forcibly
de: Laden von der DB gewaltsam
uk: Примусово завантажити з БД

source: Load the item data from DB forcibly
de: Laden Sie die Artikeldaten aus der DB gewaltsam
uk: Примусово завантажити дані елементу з БД

source: The button for loading the item data from DB forcibly, not only when it changed
de: Schaltfläche zum zwangsweisen Laden der Artikeldaten aus der DB, nicht nur beim Ändern
uk: Кнопка примусового завантаження даних елементу з БД, не тільки коли змінено

source: Press for loading the item data from DB forcibly, not only when it changed.
de: Drücken Sie, um die Artikeldaten zwangsweise zu laden, nicht nur, wenn sie geändert wurden.
uk: Натиснути для примусового завантаження даних елементу з БД, не тільки коли змінено.

source: Save to DB
de: Speichern Sie an die DB
ru: Сохранить в БД
uk: Зберегти у БД

source: Save the item data to DB
de: Sichern Sie die Artikeldaten in der DB
uk: Зберегти дані елементу у БД

source: The button for saving the item data to DB
de: Schaltfläche zum Speichern der Artikeldaten in der Datenbank
uk: Кнопка збереження даних елементу у БД

source: Press for saving the item data to DB.
de: Betätigen zum Speichern der Artikeldaten in der Datenbank.
uk: Натиснути для збереження даних елементу у БД.

source: Save to DB forcibly
de: Speichern Sie an die DB gewaltsam
uk: Примусово зберегти у БД

source: Save the item data to DB forcibly
de: Sichern Sie die Artikeldaten in der DB gewaltsam
uk: Примусово зберегти дані елементу у БД

source: The button for saving the item data to DB forcibly, not only when it changed
de: Schaltfläche zum zwangsweisen Speichern der Artikeldaten in den DB, nicht nur bei Änderung
uk: Кнопка примусового збереження даних елементу у БД, не тільки коли змінено

source: Press for saving the item data to DB forcibly, not only when it changed.
de: Drücken Sie, um die Artikeldaten zwangsweise in der Datenbank zu speichern, nicht nur, wenn sie geändert wurden.
uk: Натиснути для примусового збереження даних елементу у БД, не тільки коли змінено.

source: &Add
de: &Hinzufügen
ru: &Добавить
uk: &Додати

source: Add item
de: Hinzufügen Elements
ru: Добавить элемент
uk: Додати елемент

source: The button for adding a new item
de: Schaltfläche zum Hinzufügen eines neuen Elements
uk: Кнопка додання елементу

source: Press for adding a new item.
de: Betätigen zum Hinzufügen eines neuen Elements.
uk: Натиснути для додання елементу.

source: &Delete
de: &Löschen
ru: &Удалить
uk: &Видалити

source: Delete item
de: Löschen Elements
ru: Удалить элемент
uk: Видалити елемент

source: The button for deleting the item
de: Schaltfläche zum Löschen des Elements
uk: Кнопка видалення елементу

source: Press for deleting the item.
de: Betätigen zum Löschen des Elements.
uk: Натиснути для видалення елементу.

source: Copy item
de: Kopieren Elements
uk: Копіювати елемент

source: Copying the item
de: Kopieren des Elements
uk: Копіювання елементу

source: The button for copying the item
de: Schaltfläche zum Kopieren des Elements
uk: Кнопка копіювання елементу

source: Press for copying the item.
de: Betätigen zum Kopieren des Elements.
uk: Натиснути для копіювання елементу.

source: Cut item
de: Schneide Elements
uk: Вирізати елемент

source: Cutting the item
de: Schneide des Elements
uk: Вирізання елементу

source: The button for cutting the item
de: Schaltfläche zum Schneiden des Elements
uk: Кнопка вирізання елементу

source: Press for cutting the item.
de: Betätigen zum Schneiden des Elements.
uk: Натиснути для вирізання елементу.

source: Paste item
de: Fügen Elements
uk: Вставити елемент

source: Pasting the item
de: Fügen des Elements
uk: Вставлення елементу

source: The button for pasting the item
de: Schaltfläche zum Einfügen des Elements
uk: Кнопка вставки елементу

source: Press for pasting the item.
de: Betätigen zum Einfügen des Elements.
uk: Натиснути для вставки елементу.

source: &Refresh
de: &Aktualisieren
ru: &Обновить
uk: О&новити

source: Refresh the page
de: Aktualisieren Sie die Seite
uk: Оновити поточну сторінку

source: The button for refreshing the page content
de: Schaltfläche zum Aktualisieren des Seiteninhalts
uk: Кнопка оновлення вмісту поточної сторінки

source: Press for refreshing the page content.
de: Betätigen zum Aktualisieren des Seiteninhalts.
uk: Натиснути для оновлення вмісту поточної сторінки.

source: &Start
de: &Starten
ru: &Запустить
uk: За&пустити

source: Start the cycled refreshing
de: Starten Sie die zyklische Aktualisierung
uk: Запустити періодичне поновлення

source: The button for starting the cycled refreshing of the page content
de: Schaltfläche zum Starten der zyklischen Aktualisierung des Seiteninhalts
uk: Кнопка запуску періодичного поновлення вмісту поточної сторінки.

source: Press for starting the cycled refreshing of the page content.
de: Betätigen zum Starten der zyklischen Aktualisierung des Seiteninhalts.
uk: Натиснути для запуску періодичного оновлення вмісту поточної сторінки.

source: &Stop
de: &Anhalten
ru: &Остановить
uk: &Зупинити

source: Stop the cycled refreshing
de: Stoppen Sie die zyklische Aktualisierung
uk: Зупинити періодичне поновлення

source: The button for stopping the cycled refreshing of the page content
de: Schaltfläche zum Beenden der zyklischen Aktualisierung des Seiteninhalts
uk: Кнопка зупинки періодичного оновлення вмісту поточної сторінки.

source: Press for stopping the cycled refreshing of the page content.
de: Betätigen zum Beenden der zyklischen Aktualisierung des Seiteninhalts.
uk: Натиснути для зупинки періодичного оновлення вмісту поточної сторінки.

source: Append to favorite for '%s'
uk: Додати до улюблених для '%s'

source: The button to toggle the current page as favorite
uk: Кнопка перемикання поточної сторінки в улюблених

source: Press to toggle the current page as favorite.
uk: Натиснути для перемикання поточної сторінки в улюблених.

source: Favorite
uk: Улюблене

source: Go to favorite
uk: Перейти до улюбленого

source: The button-menu to go the favorite page
uk: Кнопка-меню переходу до улюбленої сторінки

source: Press to go the favorite page.
uk: Натиснути для переходу до улюбленої сторінки.

source: &About
de: &Über
ru: Пр&о...
uk: &Про ...

source: Program and OpenSCADA information
de: Programm und OpenSCADA Information
ru: Информация о программе и OpenSCADA
uk: Інформація про програму та OpenSCADA

source: The button of the information of the program and OpenSCADA
de: Schaltfläche der Information des Programms und OpenSCADA
uk: Кнопка інформації про програму та OpenSCADA

source: Press for information of the program and OpenSCADA.
de: Betätigen für Informationen zum Programm und OpenSCADA.
uk: Натиснути для відображення інформації про програму та OpenSCADA.

source: About &Qt
de: Über &Qt
ru: Про &Qt
uk: Про &Qt

source: Qt information
ru: Qt информация.
uk: Qt інформація

source: The button for getting the using Qt information
de: Schaltfläche für Informationen über Qt
ru: Кнопка для получения информации о Qt
uk: Кнопка для отримання інформації про використання Qt

source: Press for getting the using Qt information.
de: Betätigen für Informationen über Qt.
uk: Натиснути для отримання інформації про використання Qt.

source: Manual on '%1'
de: Handbuch zu '%1'
uk: Підручник на '%1'

source: The button for getting the using %1 manual
de: Schaltfläche für %1 Handbuch
uk: Кнопка для отримання підручника %1

source: Press to get the using %1 manual.
de: Betätigen um %1 Handbuch.
uk: Натиснути для отримання підручника %1.

source: Manual on the page
de: Handbuch auf der Seite
uk: Підручник на сторінку

source: Selected page manual
de: Ausgewählte Seiten-Handbuch
uk: Підручник обраної сторінки

source: The button for getting the using selected page manual.
de: Die Schaltfläche für das Erhalten der ausgewählten Seite mit Anleitung.
uk: Кнопка для отримання підручника обраної сторінки.

source: Press to get the using selected page manual.
de: Klicken um das Verwendung ausgewählter Seiten-Handbuch zu bekommen.
uk: Натиснути для отримання обраної сторінки.

source: What's &This
de: Was ist &das
ru: Что &это
uk: Що &це

source: Requesting about GUI elements
de: Anfordern von GUI-Elementen
uk: Запит про GUI елементи

source: The button for requesting information about the user interface elements
de: Schaltfläche zum Anfordern von Informationen zu den Elementen der Benutzeroberfläche
uk: Кнопка запиту інформації про елементи інтерфейсу користувача

source: Press for requesting information about the user interface elements.
de: Betätigen zum Anfordern von Informationen zu den Elementen der Benutzeroberfläche.
uk: Натисніть для запиту інформації про елементи інтерфейсу користувача.

source: &File
de: &Datei
ru: &Файл
uk: &Файл

source: &Edit
de: &Bearbeiten
ru: &Редактирование
uk: Редагування

source: &View
de: &Ansicht
ru: &Вид
uk: &Вид

source: &Help
de: &Hilfe
ru: &Помощь
uk: &Допомога

source: Main toolbar
de: Hauptsymbolleiste
uk: Головна панель інструментів

source: This label displays the current user.
de: Dieses Label zeigt den aktuellen Benutzer an.
uk: Ця мітка відображає поточного користувача.

source: Field for displaying the current user.
de: Feld zum Anzeigen des aktuellen Benutzers.
uk: Поле відображення поточного користувача.

source: Double click to change the user.
de: Doppelklicken, um den Benutzer zu ändern.
uk: Подвійно клацніть для зміни користувача.

source: This label indicates the fact of making changes.
de: Dieses Etikett zeigt an, dass Änderungen vorgenommen wurden.
uk: Ця мітка відображає факт внесення змін.

source: Field for indicating the fact of making changes.
de: Feld zum Anzeigen der Tatsache, Änderungen vorzunehmen.
uk: Мітка відображення факту внесення змін.

source: This button calls the status bar history.
de: Diese Schaltfläche ruft den Verlauf der Statusleiste auf.
uk: Ця кнопка для виклику історії рядку статусу.

source: Button for calling the status bar history.
de: Schaltfläche zum Aufrufen des Statusleistenverlaufs.
uk: Кнопка виклику історії строки статусу.

source: Saving the changes
de: Speichern der Änderungen
uk: Збереження змін

source: Some changes were made! Save the changes to the DB before exiting?
de: Einige Änderungen vorgenommen. Speichern Sie die Änderungen an der Ausfahrt DB?
uk: Здійснено деякі зміни! Зберегти зміни у БД перед закриттям?

source: No edited container is present.
de: Kein bearbeiteter Container ist vorhanden.
uk: Немає жодного редагованого контейнеру.

source: Adding an item to the node '%1'.
de: Hinzufügen eines Elements zum Knoten '%1'.
uk: Додання елементу у вузол: '%1'.

source: Adding a node
de: Hinzufügen eines Knotens
uk: Додання вузлу

source: The node '%1' is already present.
de: Der Knoten '%1' ist bereits vorhanden.
uk: Вузол '%1' вже присутній.

source: ... and yet %d nodes
de: ... und noch %d Knoten
uk: ... та ще %d вузли

source: Are you sure of deleting the nodes: %1 ?
de: Sind Sie sicher, dass Sie die Knoten löschen: %1 ?
uk: Ви дійсно бажаєте видалити вузли: %1 ?

source: Deleting the nodes
de: Löschen der Knoten
uk: Видалення вузлів

source: Selected
de: Gewählt
ru: Выбранный
uk: Обраний

source: Moving or copying the node
de: Verschieben oder Kopieren des Knotens
uk: Переміщення або копіювання вузлу

source: Moving the node '%1' to '%2'.
de: Verschieben des Knotens '%1' in '%2'.
uk: Переміщення вузлу '%1' у '%2'.

source: Copying the node '%1' to '%2'.
de: Kopieren des Knotens '%1' in '%2'.
uk: Копіювання вузлу '%1' до '%2'.

source: Do not ask for more.
de: Frag nicht nach mehr.
uk: Не запитувати більш.

source: The node '%1' is already present. Continue?
de: Der Knoten '%1' ist schon vorhanden. Weiter?
uk: Вузол '%1' вже присутній. Продовжити?

source: Copy/Move node '%1' error '%2'. Continue other nodes?
de: Kopieren/Verschieben des Knotens '%1' Fehler '%2'. Andere Knoten fortsetzen?
uk: Помилка Копіювання/Переміщення вузла '%1': '%2'. Продовжити інші вузли?

source: Remove from favorite for '%s'
uk: Видалити із улюблених для '%s'

source: Clear the list
uk: Очистити перелік

source: List of messages in the status bar:
de: Liste der Nachrichten in der Statusleiste:
uk: Перелік повідомлень рядка статусу:

source: Status messages
de: Statusmeldungen
ru: Сообщения статуса
uk: Повідомлення статусу

source: %s v%s. %s Author: %s License: %s %s v%s. %s License: %s Author: %s Web site: %s
de: %s v%s. %s Autor: %s Lizenz: %s %s v%s. %s Lizenz: %s Autor: %s Web Seite: %s
ru: %s v%s. %s Автор: %s Лицензия: %s %s v%s. %s Лицензия: %s Автор: %s Web сайт: %s
uk: %s v%s. %s Автор: %s Ліцензія: %s %s v%s. %s Ліцензія: %s Автор: %s Web сайт: %s

source: Manual
de: Handbuch
uk: Підручник

source: The manual '%1' was not found offline or online!
de: Nein das Handbuch '%1' gefunden, offline oder online!
uk: Не знайдено підручника '%1' локально або у мережі!

source: Find
de: Suche
ru: Поиск
uk: Пошук

source: Find next
de: Weitersuchen
ru: Поиск следующего
uk: Пошук наступного

source: On
ru: Вкл
uk: Так

source: Off
ru: Выкл
uk: Ні

source: Applying the changes
de: Anwenden der Änderungen
uk: Прийняття змін

source: Some changes were made! Accept the changes now or lose?
de: Einige Änderungen nicht gelten! Bewerben Sie sich jetzt oder verloren das?
uk: Здійснено деякі зміни! Прийняти зміни зараз або втратити?

source: Broken information request - there are no descendants.
de: Unterbrochene Informationsanfrage - Es gibt keine Nachkommen.
uk: Зламаний запит інформації - немає нащадків.

source: Refresh the items tree
de: Aktualisieren Sie den Elementbaum
uk: Оновити елементи дерева

source: Time of expanding/updating '%s': %f ms.
de: Zeit der Erweiterung/Aktualisierung '%s': %f msek.
uk: Час розширення/поновлення '%s': %f мс.

source: Sending the changes to the selected ones
de: Senden der Änderungen an die ausgewählten
uk: Надсилання змін до обраних

source: Send the command '%1' to other selected nodes: %2 ?
de: Senden Sie den Befehl '%1' an andere ausgewählte Knoten: %2 ?
uk: Надіслати команду '%1' до інших обраних вузлів: %2 ?

source: Unknown host '%s'.
uk: Невідомий хост '%s'.

source: Waiting the reply from the host '%1'
de: Warten Sie auf Antwort vom Host '%1'
uk: Очікування відповіді від хосту '%1'

source: Cancel
de: Abbrechen
ru: Отмена
uk: Скасувати

source: Local station
de: Lokaler Bedienrechner
ru: Локальная станция
uk: Локальна станція

source: Remote station
de: Entfernter Bedienrechner
ru: Удалённая станция
uk: Віддалена станція

source: %s| Set '%s' to '%s'!
de: %s| Installieren '%s' in '%s'!
ru: %s| Установлен '%s' в '%s'!
uk: %s| Встановлено '%s' у '%s'!

source: %s| Went to the link '%s'!
de: %s| Geh zum Link '%s'!
uk: %s| Перехід за посиланням '%s'!

source: %s| Pressed down '%s'!
de: %s| Betätigen '%s'!
uk: %s| Натиснуто '%s'!

source: %s| Changed '%s' from '%s' to '%s'!
de: %s| Ändern '%s' aus '%s' in '%s'!
uk: %s| Змінено '%s' з '%s' у '%s'!

source: Go
de: Ändern
ru: Перейти
uk: Перейти

source: Add
de: Hinzufügen
ru: Добавить
uk: Додати

source: Insert
de: Einfügen
ru: Вставить
uk: Вставити

source: Edit
de: Ändern
ru: Редактировать
uk: Редагувати

source: Delete
de: Löschen
ru: Удалить
uk: Видалити

source: Up
de: Nach oben
ru: Вверх
uk: Вверх

source: Down
de: Nach unten
ru: Вниз
uk: Донизу

source: Copy
ru: Копировать
uk: Копіювати

source: Setting the item name
de: Einstellen der Elementname
uk: Встановлення назви елементу

source: Add a new element.
de: Fügen Sie ein neues Element.
uk: Додати новий елемент.

source: Insert a new element.
de: Fügen Sie ein neues Element.
uk: Вставити новий елемент.

source: Rename the element.
de: Benennen Sie das Element.
uk: Перейменувати елемент.

source: %s| '%s' added by the element <%s:%s>!
de: %s| '%s' wurde vom Element hinzugefügt <%s:%s>!
uk: %s| '%s' додано елемент <%s:%s>!

source: %s| '%s' inserted by the element <%s:%s> to %d!
de: %s| '%s' wird vom Element eingefügt <%s:%s> in %d!
uk: %s| '%s' вставлено елемент <%s:%s> до %d!

source: %s| '%s' set for the element %d to <%s:%s>!
de: %s| '%s' für das Element festgelegt %d in <%s:%s>!
uk: %s| '%s' встановлено елемент %d у <%s:%s>!

source: %s| '%s' deleted for the element <%s:%s>!
de: %s| '%s' wurde für das Element gelöscht <%s:%s>!
uk: %s| '%s' видалено елемент <%s:%s>!

source: %s| '%s' moved for the element %d to %d!
de: %s| '%s' wurde für das Element %d nach %d verschoben!
uk: %s| '%s' пересування елементу %d до %d!

source: Add record
de: Datensatz hinzufügen
ru: Добавить запись
uk: Додати запис

source: Insert record
de: Datensatz einfügen
ru: Вставить запись
uk: Вставити запис

source: Delete record
de: Datensatz löschen
ru: Удалить запись
uk: Видалити запис

source: Move Up (Ctrl+Up)
de: Nach oben stellen (Ctrl+Up)
uk: Пересунути вгору (Ctrl+Up)

source: Move Down (Ctrl+Down)
de: Nach unten bewegen (Ctrl+Down)
uk: Пересунути донизу (Ctrl+Down)

source: %s| '%s' add by a record.
de: %s| '%s' wird um einen Datensatz hinzufügen.
uk: %s| '%s' додано запис.

source: %s| '%s' inserted for the record %d.
de: %s| '%s' wurde für den Datensatz %d eingefügt.
uk: %s| '%s' вставлено запис %d.

source: %s| '%s' moved for the record %d to %d.
de: %s| '%s' wurde für den Datensatz %d nach %d verschoben.
uk: %s| '%s' перенесено запис з %d до %d.

source: %s| '%s' deleted for the record '%s'.
de: %s| '%s' wurde für den Datensatz '%s' gelöscht.
uk: %s| '%s' видалено запис '%s'.

source: %s| '%s' user command '%s(%s)' to the record '%s'.
uk: %s| '%s' команда користувача '%s(%s)' до запису '%s'.

source: Enter a string to search:
de: Geben Sie eine Zeichenfolge suchen:
uk: Введіть рядок пошуку:

source: Searching a string
de: Eine Zeichenfolge suchen
uk: Пошук рядку

source: Case sensitively
de: Case sensibel
ru: Чувствительный к регистру
uk: Чутливий до регістру

source: Save image
ru: Сохранить изображение
uk: Зберегти зображення

source: Load image
ru: Загрузить изображение
uk: Завантажити зображення

source: Clear image
uk: Очистити зображення

source: Saving the picture
de: Speichern der Bild
uk: Збереження картинки

source: Images (*.png *.xpm *.jpg)
de: Abbildungen (*.png *.xpm *.jpg)
ru: Изображения (*.png *.xpm *.jpg)
uk: Зображення (*.png *.xpm *.jpg)

source: Error saving to the file '%s'
de: Fehler beim Speichern in der Datei '%s'
uk: Помилка збереження до файлу '%s'

source: Loading the picture
de: Laden Sie das Bild
uk: Завантаження картинки

source: Images (*.png *.jpg)
de: Abbildungen (*.png *.jpg)
ru: Изображения (*.png *.jpg)
uk: Зображення (*.png *.jpg)

source: Error opening the file '%s'
de: Fehler beim Öffnen der Datei '%s'
uk: Помилка відкриття файлу '%s'

source: Closing the file %d error '%s (%d)'!
uk: Помилка закриття файлу %d - '%s (%d)'!

source: Error image file '%s'
de: Fehlerbilddatei '%s'
uk: Помилковий файл зображення '%s'

source: %s| '%s' uploaded by the picture '%s'.
de: %s| '%s' hochgeladen von dem Bild '%s'.
uk: %s| '%s' завантажено картинку до '%s'.

source: %s| '%s' cleared.
uk: %s| '%s' очищено.

source: The value '%s' is wrong!
de: Der Wert '%s' ist falsch!
uk: Значення '%s' помилкове!

source: %s| '%s' set for cell ('%s':%s) to: %s.
de: %s| '%s' für Zelle ('%s':%s) auf: %s gesetzt.
uk: %s| '%s' встановлено клітинку ('%s':%s) у: %s.

source: Selective element '%s' is missing!
de: Selektives Element '%s' fehlt!
uk: Вибірковий елемент '%s' відсутній!

source: %s| '%s' changed to: '%s'!
de: %s| '%s' geändert: '%s'!
uk: %s| '%s' змінено у: '%s'!

source: No connection is established
de: Keine Verbindung hergestellt
uk: Не встановлено зв'язку

source: Picture is not set!
de: Es ist kein Bild hinterlegt!
ru: Картинка не установлена!
uk: Картинку не встановлено!

source: Apply
de: Übernehmen
ru: Принять
uk: Прийняти

source: Cursor = (%1:%2)
ru: Курсор = (%1:%2)
uk: Курсор = (%1:%2)

source: Backward
de: Rückwärts
ru: Обратно
uk: Зворотній

source: Whole words
de: Ganze Wörter
ru: Слово целиком
uk: Слово цілком

source: Identifier:
de: Identifikator:
uk: Ідентифікатор:

source: Name:
ru: Имя:
uk: Ім'я:

source: Ok
uk: Гаразд

source: Item type:
de: Typ des Elements:
ru: Тип элемента:
uk: Тип елементу:

source: Selecting an user
de: Einen Benutzer auswählen
uk: Вибір користувача

source: User:
de: Benutzer:
ru: Пользователь:
uk: Користувач:

source: Password:
de: Kennwort:
ru: Пароль:
uk: Пароль:

source: Error authentication!!!
de: Fehlerauthentifizierung!!!
uk: Помилка аутентифікації!!!

source: Program configurator (Qt)
de: Programmkonfigurator (Qt)
uk: Конфігуратор програми (Qt)

source: Roman Savochenko
de: Roman Savotschenko
ru: Роман Савоченко
uk: Роман Савоченко
